
          function fWSf01dbd23413dda0e51f089d212047ee7a02_8000() {
              var t="ホーム";
              var p="10 adobe coldfusion ホーム リファレンス 役立つリソース 設定と管理 関連製品";
              var n="WSf01dbd23413dda0e51f089d212047ee7a02-8000";
              top.sc1[0] = t;
              top.sc2[0] = p;
              top.sc3[0] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3637ad_7ffd() {
              var t="はじめに";
              var p="adobe coldfusion は はじめに 設定と管理 開発環境の設定および管理を行うすべてのユーザーを対象にしています";
              var n="WSc3ff6d0ea77859461172e0811cbf3637ad-7ffd";
              top.sc1[1] = t;
              top.sc2[1] = p;
              top.sc3[1] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3637ad_7fff() {
              var t="coldfusion のマニュアルについて";
              var p="10 5 acrobat adobe air aix ajax cfml cfx coldfusion document flex format html linux macintosh microsoft office openoffice orm pdf portable restful sharepoint solaris web windows あらゆるユーザーを総合的にサポートできるように作成されています および このガイドには これらのオンラインマニュアルでは すべての との統合など との統合に関する詳細情報が含まれています など について説明します にアクセスしてください のすべてのマニュアルは のマニュアルについて のマニュアルは のマニュアルセットには の使用方法と の機能 の管理作業 アプリケーションのデプロイ アプリケーションの開発方法について説明します オンラインマニュアルの参照 オンラインマニュアルを表示するには キャッシュ コード例が含まれています サポート サポートページ サーバーの設定など サーバーモニタを使用したサーバーアクティビティの監視 サーバー設定の管理 サービス シンタックス セキュリティの管理 タイトル タグ タグのセットアップ ダイナミック データソースの設定 プログラミング言語と ヘルプ ベータ版 ベータ版アプリケーションの開発 ベータ版インストール ベータ版設定と管理 マニュアルセット リファレンス 他社の製品およびテクノロジー 使用方法 変数に関する説明 形式および 形式でオンラインから入手できます 新しいコメントを追加したり 既存のコメントを参照することもできます 次のマニュアルが含まれています 環境でのシステムインストールおよび基本設定について説明します 説明 関数";
              var n="WSc3ff6d0ea77859461172e0811cbf3637ad-7fff";
              top.sc1[2] = t;
              top.sc2[2] = p;
              top.sc3[2] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf36383a_8000() {
              var t="coldfusion の管理";
              var p="0 00 07 1 10 100 12 127 15 2 20 2000 2003 25 256 3 30 44 4528 7 8 8500 8501 access administrator agent and apache applets assembly audit axis bin c cd cf cfc cfide cfinclude cfm cfml cfmodule cftoken cfusion cfx client client1 client2 client3 coldfusion collectionsを参照してください configure cookie create data datadirect debugging deleted dns domain eaf enter finance grep htm http httponly iis index internet ip iplanet j2ee java jetty jrun jvm language localhost log logical logs manage manager mappings markup mb microsoft mx myindex name net nobody odbc one openoffice opt options payroll planning protocol ps pts rds rest restart root security select server servername services socket solr source start status stop sun tags the timestamp tomcat ui unix url username uuid variable variables web windows xp いくつかの および から がうまく表示されない場合は がアクセスできるようになります がインストーラによって自動的に検索されます がリモートコンピュータ上にある場合は が存在するシステム上で動作している必要があります が既に が機能拡張されました が物理ディレクトリパス が組み込まれます この このサービスが実行されていないと このプロセスが実行中かどうかを調べるには このリリースでは このリリースの新機能 この情報を使用して この拡張機能では この機能拡張には これは これらのエイリアスをマッピングと呼びます これらのマッピングが使用されます ご使用の さまざまな設定を行って最適なレベルのセキュリティと機能性を維持することができます そうでなければ そのリモートホストの つの つのみでした つのタイプのマッピングを使用します つのプロセスが作成されます で です でできること では で設定に関する情報を参照してください と というコマンドを入力します としてログインします と同じと見なされます と呼ばれる など などの外部 に について には によって によって異なります にアクセスしていない場合でも にアクセスしているとします にアクセスしなくなると にアクセスするには にアップグレードすると に同時にアクセスできる に対するアプリケーションのアクセスを制御するために提供されている に次のサービスが作成されます の のどちらかが のインストール時に指定したパスワードを入力します のエディション のサーバー領域では のシステム情報ページにアクセスするには のシステム情報ページを使用して のステータス情報の表示 のセキュリティ領域では のタグおよび機能を使用したサーバーリソースへのアクセス制御を行えます のダウンロードとインストール のデータソースを設定するサービスです のトライアル版の有効期限を表示します のナビゲーションペインで のバージョンを指定するオプションが用意されています のパスワード保護の有効化 のページで のページにナビゲートできます のページに対するオンラインヘルプが表示されます のページレイアウトを理解するために のホットフィックスおよびセキュリティホットフィックスが含まれる場合があります のホームページでは のメインサービスです のリソース のリソースに対してさらに細かいセキュリティ管理が必要な場合 のレイアウト の主な機能 の代わりに の使用 の停止 の再起動 の右上にあるシステム情報ボタンをクリックします の大きなアクションはすべてログに記録されます の実行中に の有効化 の機能を設定および管理できます の次のデフォルト設定が見直されました の管理 の管理について の管理タスクのほとんどを実行できる他 の管理責任を分散する必要がある場合には の設定 の設定およびサービスを管理および制御します の設定の詳細については の設定ページのオプションを変更した場合は の起動 の追加機能を利用するには は へのアクセス へのアクセスの制限 また または またはセキュリティ より前のバージョンでビルトイン を をアドレス行に入力します をインストールすると をインストールする前に をクリックします を使用して を使用している場合 を停止して再起動する必要があります を入力してページをブラウザーに読み込みます を参照してください を実装します を有効化できます を次のように更新またはアップグレードします を設定するオプションがあります を選択します を開いて アップデートには アドレスから同時にアクセスできるようになりました アドレスで アドレスなど アドレスの権限は拒否されていました アドレスは アドレスを使用します アプリケーションおよびサーバーレベルでのタスクのスケジューリングおよびクラスタ設定の有効化が含まれています アプリケーションでエイリアスを使用できます アプリケーションで使用するデータソースへの接続 アプリケーションで使用できます アプリケーションを使用するには アプリケーションサーバー アプリケーションページのリクエストに関する有益なデバッグ情報を取得できます アプレット アプレットおよび アプレットおよびタグをアプリケーションに取り込むことができます アプレットとカスタムタグの統合 アプレットまたは拡張機能 アプレットを登録した後 イベントゲートウェイ イベントゲートウェイサービスの有効化 インストール エラーメッセージが表示されます エンタープライズ版 オブジェクトとしてアクセスできるようになります オプションで オプション設定の概要 オペレーティングシステムのサービスおよび オンラインリソース オンライン製品マニュアル キャッシュ キャッシュ環境設定の定義 クエリキャッシュのクリア クライアントセッション用のデフォルトのストレージメカニズムを選択 クライアント向けにページのコンテンツをカスタマイズできます クライアント変数 クライアント変数のデフォルト保存メカニズムを指定し クライアント変数を使用して クライアント変数を管理すれば クライアント変数を選択して クライアント変数ストレージ名 クライアント情報を保存するために使用するデータソースを指定します クラスに クラスを表します クラスタの作成と管理 グローバルなスクリプト保護の有効化 コマンド コンポーネントを検索する際に サイトを訪問するクライアントのアイデンティティを特定できます サイト訪問者のアイデンティティの特定 サポート サンドボックスセキュリティ サンドボックスセキュリティを設定することを検討します サーバー サーバーが サーバーがインストールされて実行中であることを確認します サーバーがサポートされています サーバーが実行中であることの確認 サーバーが実行中であれば サーバーが提供されているのに加え サーバーにデプロイする場合には当てはまりません サーバーに対して行われるすべてのリクエストに対して有効です サーバーの完全修飾ドメイン名です サーバーの検索テクノロジーが含まれています サーバーの管理について サーバーの設定 サーバーの設定と保守 サーバーまたは サーバーを使用していた場合 サーバーを使用する場合は サーバーを指す サーバーマッピング サーバーマッピングでも サーバーマッピングは サーバーマッピングを使用すると サーバーレベルで同じと見なされます サーバーレベルで次の設定を行えます サーバー上のディレクトリに対するエイリアスを作成すれば サーバー上のディレクトリへのパスに対する論理エイリアスを作成できます サーバー上のリソース サーバー名 サーバー名の一部としてポート番号を含めます サーバー変数に対応する値を表示します サーバー更新 サーバー用の未使用ポート サーバー設定 サーバー設定のデフォルトのポート番号は サーバー設定の場合 サービス サービスがサポートされており サービスとプロセス サービスにアプリケーションを登録するオプションです システムのプロセスを使用します システムパフォーマンスの監視 システム上の システム情報 システム情報が表示されます システム情報ページの システム情報ボタン スケジューリング スケジュールされたタスク スタンダード版 スタンダード版またはエンタープライズ版 スタンドアローンインストールでは セキュアセッション セキュリティ セキュリティを有効または無効にした場合 セッション タイムアウト タグと タグに対して タグの登録 タグを タグを選択して タスク タスクのスケジューリング機能 タスクのスケジュール タスク自動化の設定 チェック チェック解除 テクニカルサポート ディレクトリ デバッグとロギング デバッグを設定するには デバッグオプションの選択 デバッグ出力の設定を選択します デバッグ環境設定を設定すれば デフォルト デフォルトでは デフォルト設定に対する変更 デベロッパー版の データソース データソースへの接続 データベース トライアル版またはデベロッパー版の トレーニング ドキュメントのルートディレクトリにある場合は ドライバーを使用する パス ヒープサイズ ビルトイン ファイル ファイルが フィールドに製品のシリアル番号を入力します フォルダー固有のテンプレートキャッシュのクリアを行うオプションです ブラウザーを開きます プロキシを使用して プロセス プロセスの説明は プロセスを管理するには ヘルプボタン ページが処理されません ページが表示され ページまたはサイトの ページを処理できることが必要です ホワイトペーパー ポート番号 マッピング マッピングは不要になります マッピングを選択します マルチホーム環境での メモリ変数 リクエストの制限 リクエストの調整 リクエストサイズの制限 リソースおよびテクニカルノート リソースのセキュリティ保護 リソースセキュリティ リソースボタン リモートアクセスに対するパスワード保護の有効化 リリースノート レジストリ ログには ログのデフォルトの場所は ログインページのデフォルトの場所は ログファイルの管理と分析 ローカルコンピュータの ローカルリソース 両方またはどちらかの 以前のリリースでは 以前のリリースの 以前の値 以前の名称は 任意の 作業環境 使用可能なオプションは 例 例えば 側のエージェントが 内の 内部キャッシュを使用したクエリの保存 分 単位 同時 同時テンプレートリクエストの最大数 名または 基本設定タスクを実行した後 変数の管理 変更の送信 変更を有効にするために 多くの場合 実行したアクションを含む詳細が含まれています 実行中の場合は 左ペイン 年 情報の追加ソースへのリンクが表示されます 拡張機能 接続の中間層サービスです 新しい値 新しい設定を使用することをお勧めします 新機能マニュアル 新規のライセンス 日付 時刻 更新 最大 最小 未配達メールの管理 検索サーバーについても管理できます 標準デバッグオプションの設定 機能強化リクエストおよびセキュリティ 次の 次のとおりです 次のようなアクションの概要のみが含まれることに注意してください 次のようなタスクを実行できます 次のような行が戻されます 次のような重要な新機能が搭載されいます 次のように 次のアクションを実行することを考慮してください 次のコマンドを使用します 次の作業を行います 次の情報およびサポートにアクセスできます 次の表の説明に従い 次の説明を参照してください 注意 物理ディレクトリに対する論理エイリアスの作成 現在のユーザー 環境を管理するためのブラウザベースのインターフェイスが用意されています 用に 用の 番目の 管理者のアクションのロギング 表示している 製品アップグレードおよびテクニカルノートへのアクセス 製品アップデートがあるかどうかを確認します 製品アップデートとホットフィックスのダウンロードとインストール 製品マニュアルおよびサンプルアプリケーション 製品登録 設定 設定およびカスタムタグの登録を行えます 詳しくは 詳細については 詳細管理タスクの実行 説明 論理パス 論理パスが物理パスと同じと見なされますが 送信データの最大サイズ 通常 通常は 適切なコマンドを入力します 適切な拡張機能ページのアプレットを登録します 開発環境をセキュリティ保護できます 開発者情報 関数リクエストの最大数 領域 領域またはボタン 高性能分散型システムでの検索を高速で処理するために設計されたオープンな高性能検索エンジンです";
              var n="WSc3ff6d0ea77859461172e0811cbf36383a-8000";
              top.sc1[3] = t;
              top.sc2[3] = p;
              top.sc3[3] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_8000() {
              var t="coldfusion administrator の使用";
              var p="administrator adobe api coldfusion の使用 の機能を実行することもできます また を使用して を使用します アプリケーションプログラミングインターフェイス プログラムから 基本的な管理作業を行うには";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-8000";
              top.sc1[4] = t;
              top.sc2[4] = p;
              top.sc3[4] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffe() {
              var t="最初の管理作業";
              var p="administrator cfml coldfusion development ip java jvm rds remote service および および削除を行うには と のインストール時には のセクションを指定します の設定 の設定をカスタマイズする必要があります へのアクセス権をユーザーごとに設定するには へのユーザー固有のアクセスの定義 をインストールした直後に を参照してください アドレスを指定するには アプリケーションでの必要性に応じて アプリケーションでは アプリケーションで自動電子メールメッセージを送信できます クエリーを実行したりデータベースに書き込んだりするためにデータソース接続が必要です クラスパス情報など サンドボックスセキュリティ サーバーにセキュリティ上のリスクを与える可能性があります サーバーの物理ディレクトリへの相対ファイルパスにリダイレクトできます サーバー全体のディレクトリのエイリアスを指定するには サーバー構成のみ セキュリティ セクションを使用します タグは タグアクセスの制限 タスク ディレクトリマッピングによって ディレクトリマッピングの指定 デバッグとロギング デバッグ情報によって デバッグ情報の設定 デバッグ情報を受け取る データソース データベース接続の作成 データベース接続の確立 パスワード パスワードの変更 パスワードを変更するには ページを使用します ページ処理に関する重要なデータを取得できます マッピング メールサーバー ユーザーを作成してユーザー名 一部の 各ユーザーがアクセスできる 場合によっては 必要な場合はこれらのパスワードを後から変更できます 最初の管理作業 検査 次の表に示す管理タスクの一部または全部を実行する必要があります 特定のタグを無効にするには 用のパスワードを設定しますが 編集 表示するデバッグ情報を選択し 設定を変更するには 詳細については 説明 適用可能なサンドボックス 電子メールにより 電子メールのセットアップ 電子メールサーバーおよびメールのオプションを設定するには";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7ffe";
              top.sc1[5] = t;
              top.sc2[5] = p;
              top.sc3[5] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffd() {
              var t="ユーザー支援機能へのアクセス";
              var p="administrator coldfusion jvm および およびシステム情報にアクセスできます このオンラインヘルプには このヘルプは別のブラウザウィンドウに表示され このページには その他のインストーラ の左上にあるボタンを使用して の詳細などの をクリックすると オンラインヘルプ コミュニティの情報源 サンプルアプリケーション サーバーの情報を確認できます システム情報 シリアル番号 セキュリティ関連情報 タブがあります テクニカルサポートとトレーニング バージョン番号 ファーストステップ ページが表示されます ページにある疑問符アイコンをクリックします ページの操作手順や簡単な説明が表示されます ユーザー支援機能へのアクセス リソース 情報源 検索 標準の 次の項目へのリンクがあります 状況依存型オンラインヘルプにアクセスするには 現在表示されている 目次 索引 製品アップデート 製品情報 追加の情報源に関する情報";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7ffd";
              top.sc1[6] = t;
              top.sc2[6] = p;
              top.sc3[6] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffc() {
              var t="サーバーの設定 セクション";
              var p="0 1 10 10g 127 15 17 2 20 200 2002 2022 25 3 30 4 5 500 512 60 64 8 843 a aargs access acrobat actionscript additional administrator adobe afm api app apple application applies args arial as attributecollection auth awt b bad bak bin bold builder c cachedafter cachedwithin cdata cf cfaas cfapplication cfc cfdocument cfform cfid cfide cfinclude cfm cfmail cfml cfmodule cfquery cfreport cfthread cftoken cfusion cgi cglobal char classpath client coldfusion coldfusion10 collection com company config contains cookie create cron crontime dailyevery data data1 data2 databases datasource date datetime dcoldfusion default directorywatcher djava doc4j dsn ehcache embedding error eventhandler example explorer fft flash flashpaper font fontembed fonts for form get global1 global2 google graphicsenv group1 group3 headers headless home html http i id1 id2 id3 identifier in index inf internal internet ip iso italic j2ee jar java jdbc jdk jks jmx jp jre js json jsp jvm kb key layer lib libpath linux log logs long longtext lucida lvisit macintosh mail mailsent manager map mb memo metrics microsoft mx n name navigator nd neo netscape new newpages not odbc off office ok on once onserverstart open openoffice opentype openwin opt oracle orm otf pdf pfb pfm pkcs12 policy pop post protocol proxy query remoting report request roman root rootdir runtime schedule schedulerdemo scriptsrc security select selective server service session sessiontimeout share show simple smtp solaris source sql ssl storage store sun table tables task1 task3 tasks text the this timeout times timestamp tls to transfer transport true truetype ttc ttf txt type unique universally unix url usr utf uuid varchar variable web webapp webchartsjava2d websocket websphere windows winnt wwwroot x x11 x11r6 xincgc xint xml xms xmx yes あたり および およびアーカイブを管理できます およびクラスタが有効どうかが表示されます およびデータソースをキャッシュに格納できます およびポート番号を入力します および削除が可能です および削除を行うには および復帰 および残りのタスクカウントなどの新しい詳細が表示されます からの から接続できるかどうかを から送信されるメールメッセージをすべてロギング が がこれらのヘッダページを見つけられるようにするには がデータベースに対するクエリーを実行するのではなく がメールサーバーからのレスポンスを待つ際のタイムアウトまでの時間を秒単位で指定します が使用され が使用されます が同じ設定ファイルを共有するので が同時に処理できる異なるタイプのリクエストとスレッドの数を指定できます が同梱されており が含まれます が検索されます が見つけられない場合に実行するページを指定します が設定されます こうすることによりファイルシステムのオーバーヘッドを最小限に抑えることができます ここでページが指定されていない場合 このような保護ロジックがアプリケーションに備わっていない場合は このようにすると このアイコンをクリックすると このオプションが表示され このオプションによって このオプションの選択をオフにします このオプションは このオプションはデフォルトで有効になっています このオプションはデフォルトで有効になります このオプションは表示されません このオプションを使用しない場合でも このオプションを使用することによって このオプションを使用すれば このオプションを有効にすると このオプションを有効にするとアプリケーションのパフォーマンスを向上させることができますが このオプションを無効にすると このオプションを無効にするほうが通常は高速になります このオプションを設定したり有効にすることによって このオプションを選択した場合は このオプションを選択して このオプションを選択します このオプションを選択すると このサーバーの管理情報と設定情報を読み込んだり修正することができないようになります このタスクが実行される頻度が表示されます このタスクの出力ファイルをパブリッシュするには このタスクを実行するスケジュールを選択します このタスクを継続的に実行する場合は このチェックボックスをオンにします このテーブルには このファイルには このファイルは このフォームの送信後に確認します このページに このページには このページの このページは このページを終了するには このリクエストをプロキシサーバー経由でルーティングする必要がある場合は この値は この列には この場合 この情報を保管するデータベーステーブルの構造を把握する必要があります この数を超えるとディスクへのスプールに切り替わります この機能を使用して この設定が必要になります この設定を この設定を使用して この設定を変更しても これには次のオプションがあります これにより これは これらのオプションは これらのフォントにアクセスする必要があります これらのヘッダページを参照する場合 これらの動作を変更する場合は これらは これら両方のフォーマットでは これをオフにすると これをオンにすると これを指定しない場合は ご使用の ご使用のサーバー上で ご使用のデータソースが さまざまな値を指定して実験することをお勧めします さらに しかし すべての すべてのイベントゲートウェイがサポートされます すべてのデータベースで同じ列のデータ型名がサポートされているわけではありませんので注意してください すべてのノードが同じデータソースを指すので すべてのプラットフォーム すべてのページリクエストに対して すべての設定を表示するには すべての電子メールメッセージの するには そうしないと そのグループの そのプロキシサーバーの その他 その後にテンプレートがリクエストされたとき ただし たとえば つのデータソースが設定されている場合に適用されます つのノードから表を作成した場合 つのノードに対してのみ有効にしてください つのホストからの つの単純なデータベーステーブルが使用されます で です でそれらのフォントを登録します でのタイムアウトの指定より長くしてください での追加属性の許可 では では使用できません では常にフォントが埋め込まれます では必要なテーブルを自動的に作成できます では次のように検索方法を設定できます でエラーが発生した場合に実行するページを指定します でキャッシュされるテンプレートの数を指定します でクライアント変数テーブルを作成できます でフォントを登録するか で作成されたレポートを呼び出すために使用される で使用されているフォントにサーバーコンピューターがアクセスできる必要があります で使用する で定義されたレポートを使用する際には で特定できる場合は で登録 で設定する方法の詳細については で起動します と というエラーが返されます というマークが付いているフォントは埋め込まれません というログファイルにメッセージが自動的に書き込まれます という名前に変更してから という名前に変更します という形式で指定します として使用されます として保存 として保存されます として保管 と指定します なおかつリロードが必要以上に発生しない程度の値に設定してください など などがルートディレクトリになります なイベントに対して に にある にあるフォントを登録します についての注意事項 によってサポートされる によってログに記録されません によって作成されたスレッドはキューに入れられます によって処理されるページのみに適用されます により によりキャッシュ内の一番古いチャートが破棄されます にエクスポートできます にバンドルされた にマップされるディレクトリ にメッセージをスプールすることができます に使用できるスレッドの最大数 に制限されています に変更が書き込まれます に存在する に存在するとします に対して乱数ではなく に対応させるマッピングを追加します に拡張子を追加できます に置換します に設定されている場合にフォントが埋め込まれます に設定した場合に使用するフォントの確認と定義を行えます に設定します に設定すると の のいずれかの値を指定できます のみ のみで使用されます のみで使用できるビルトイン のみに適用できます のように のインストール時に のキューに大量のメッセージが蓄積されている場合は のサイズ制限があります のスケジューリング機能では のチャートおよびグラフ作成サーバーでは のチャートおよびグラフ作成サーバーのためのキャッシュとスレッドの設定について説明しています のディレクトリパスを指定します のドキュメントを正しく表示したり のフォールバックで必要になります のマッピングは のユーザーのページコンテンツを最適化できます のルートディレクトリ のレポート作成機能の詳細については の両方のフォーマットでドキュメントとレポートを作成できます の使用 の出力フォーマットでは使用できないことに注意してください の初期ヒープサイズです の制限を個別に調整できます の各スコープ変数をクロスサイトスクリプティング攻撃から保護します の垂直クラスタに の変換 の常駐フォントと通常の場所 の待ち時間の制限を入力します の拡張子のみがデフォルトで付くようになったことに注意してください の暗号化を有効にします の最大ヒープサイズです の検索順序 の設定も行えます の設定ページを更新すると の間に作成された一時ファイルをクリアする期間 は はテンプレートをメモリにリロードし は自動的に へのアクセスに必要な への引数 への接頭辞付加 への絶対パスを指定するか ほとんどの ほとんどの環境ではこの機能を有効にしないことをお勧めします また または またはこれと同等のデータ型 またはカスタマイズされた出力に役立ちます またはシステムレジストリへのクライアント変数の保存 またはページの実行に時間がかかりすぎることが原因でリクエストが応答しなくなることを防ぐのに役立ちます またはメモリ またはレジストリを使用している場合には またはレポート定義 または両方のフォーマットでフォントを使用できるかどうかを指定します や やメールサーバーの を をオンにしている場合 をクリックします をデプロイする場合は をポート を使用して を使用してシステムを復元してください を使用して特定のディレクトリにアクセスするための仮想ディレクトリを作成する方法については を使用します を使用する を使用するかどうかをユーザーが変更できるため を使用するかどうかを指定します を使用するため を入力します を入力できます を再起動する必要があります を再起動できなくなった場合は を参照してください を含めることはできません を実行するコンピューターにフォントをインストールする必要があります を引数としてメソッドを呼び出す場合の を指しているのに を指すマッピングを追加します を指定します を接続する場合は を有効にします を検索する順序を選択します を管理できます を絶対 を設定されます を設定する場合は を設定できます を起動 を連動させるために次の設定を行えます を選択します アカウントが必要です アクション アクセスされなかったクライアントのデータを破棄 アクセス頻度が高い アドレス アプリケーションごとのマッピングとデバッグなどの アプリケーションごとの設定の有効化 アプリケーションのパフォーマンス向上に役立ちます アプリケーションの設定を行えます アプリケーションの開発 アプリケーションサーバーにわたって機能します アプリケーションレベルでスケジュールされたタスク アプリケーション内でその変数を使用できません アプリケーション内で電子メール送受信機能を使用するには アプリケーション名 アプリケーション固有のタスクを作成することはできません アプリケーション変数およびセッション変数が有効になります アプリケーション変数およびセッション変数のタイムアウトの最大値とデフォルト値を指定できます アプリケーション変数のために指定する最大タイアウト値は アプリケーション変数は イベントハンドラー インストール インストール時に設定を行わなかった場合は インターネットアドレス インデックスディレクトリ インデックス作成できるアプリケーションデータのすべての永続エンティティが保存されているディレクトリ エラー エラーログの厳格度 エンタープライズ版 エンタープライズ版では エンタープライズ版のみ オブジェクトにアクセスしたり オブジェクトを作成できないようにします オプション オプションがクライアントストアを追加 オプションを選択して オプションを選択してから オプションを選択します オペレーティングシステムでサポートされているスケーラブルフォントフォーマットです オペレーティングシステムレジストリに保管 オンラインヘルプを参照してください カンマで区切ります キャッシュが一杯になってから新規チャートを生成すると キャッシュされたテンプレートを キャッシュされるイメージの最大数 キャッシュされるクエリーの数を制限する必要があります キャッシュされるクエリーの最大数 キャッシュされるクエリーの最大数に達すると キャッシュされるクエリーの最大数を キャッシュされるテンプレートの最大数 キャッシュに保管するチャートの最大数を指定します キャッシュクエリが内部キャッシュを使用して保存されます キャッシュクエリは キャッシュクエリーでは キャッシュクエリーを有効にするには キャッシュタイプ キャッシュタイプを設定します キャッシュ機能 キューで実行待ちのリクエストのタイムアウト キューで実行待ちのリクエストは キューに入れられず キー キーエイリアス キーストア キーストアのパスワードです キーストアの最初のエントリが使用されます キーストアパスワード キーパスワード クエリキャッシュを今すぐクリア クエリー クエリーのキャッシングは無制限になります クエリーはメモリ内に存在しており クエリー結果セットのサイズは異なるため クライアントに クライアントコンピューターにフォントがインストールされているかどうかに関係なく クライアントコンピューターにフォントをインストールする必要があります クライアントサイドで制御できます クライアントストアとして追加するためのデータソースの選択 クライアントセッション用のデフォルトのストレージメカニズムを選択 クライアントデータは期間限定で保存されます クライアントデータを破棄するように設定されているサーバーが クライアントデータストアおよびその設定の説明です クライアントデータベーステーブルの作成 クライアント変数 クライアント変数からの情報を使用すると クライアント変数が更新されます クライアント変数には クライアント変数のデフォルト値を設定できます クライアント変数の保管にレジストリを使用する場合は クライアント変数をレジストリに保管することはお勧めできません クライアント変数ストレージオプション クライアント変数テーブルの作成 クライアント変数テーブルを使用する前にテーブルを作成する必要がなくなります クライアント変数データの移行 クライアント変数データを別のデータソースに移行するには クライアント変数ページが表示され クライアント変数ページで クライアント変数ページの クライアント要件 クラスタ クラスタが有効どうか クラスタの クラスタの一部になります クラスタを無効にする クラスタを無効にするには クラスタ構成のサーバーでは実用的ではありません クラスタ設定でタスクを実行するには クラスタ設定を有効にする クラスタ設定用のテーブルを作成 クラスパス クラスファイルの保存 クリックすると クロスドメイン グループ グループ名をクリックすると グローバルなスクリプト保護 グローバルクライアント変数が最初に作成されたときおよび更新されたときのみに変数が更新されます グローバルクライアント変数更新の無効化 コアフォントが含まれています コレクションのインデックス作成 コントロールパネルで コンピューターがコンソールアクセスのみを提供している場合でも コンピューターには コンピューターにインストールする場合は コンポーネントのメソッド数です コンポーネントキャッシュ コンポーネントキャッシュを直ちにクリア コンポーネントキャッシュを空にします コンポーネントパスを解決した結果がキャッシュされて再び解決されることがなくなります コードによって コード内に含まれており サイズの サイトまたは複数の仮想 サイトを持つ サイト全体のエラーハンドラ サイト全体のエラーハンドラまたはテンプレート欠如エラーのハンドラを定義した場合 サポートがクライアントサイドにない場合に サポートされているタイプは サンプルテーブル作成ページ サーバーがリスンするポートです サーバーがローカルサーバーとリモートサーバーのどちらにインストールされているかに応じて サーバーが保守するキャッシュクエリーの最大数を制限します サーバーで使用可能なフォントを特定する必要があり サーバーに サーバーにデプロイする場合には当てはまりません サーバーのオーバーロード サーバーのクエリキャッシュを削除します サーバーのクラスタがこのデータソースを使用する場合は サーバーのドキュメントを参照してください サーバーのパフォーマンスに著しい影響を及ぼす可能性があります サーバーのパフォーマンスを大幅に低下させる可能性があるため サーバーのページを実行できます サーバーの仮想ディレクトリとは異なります サーバーの別の場所に保存されているフォントを定義できます サーバーの特性を制御することができます サーバーの設定 サーバーの設定ページの新しいオプションであり サーバーへのアクセス許可と サーバーを再起動する必要はありません サーバーインスタンスに サーバーパスのキャッシュ サーバーポート サーバーレベルで サーバーレベルでスケジュールされたタスク サーバーレベルまたはアプリケーションレベルで サーバー上でそれらのファイルを保存する場所へのマッピングを追加してください サーバー上で使用可能なフォントが自動的には認識されないので サーバー上のディレクトリへのパスに対する論理エイリアスの追加 サーバー側で制御できます サーバー全体のアプリケーション変数およびセッション変数を有効にできます サーバー管理者に確認してください サーバー設定 サーバー設定を サービス サービスをクロスサイトスクリプティング攻撃から保護します サービスリクエスト サービスリクエストの最大数 サービスリクエスト数です システム システムレジストリ システム全体のキャッシュがクリアされていました シリアル化 ジョブシンタックスでタスクスケジューリング時刻を指定します スケジューラー固有のテーブルがクラスタに対して作成されます スケジューリングされたイベントによって生成される情報を含んだスタティックページを表示します スケジューリング機能は スケジュールされたアクション スケジュールされたタスク スケジュールされたタスクが属するグループです スケジュールされたタスクが正常に実行されたかどうかが示されます スケジュールされたタスクが誤実行された場合のサーバーの処理を指定します スケジュールされたタスクのファイルのパブリッシュでは スケジュールされたタスクの作成 スケジュールされたタスクの追加 スケジュールされたタスクは スケジュールされたタスクは一時停止および再開できます スケジュールされたタスクを実行 スケジュールされたタスクを新しく追加できます スケジュールされたタスクページ スケジュールされたページが実行されると スケジュールしたアプリケーション固有のタスクのリストが スケジュールしたサーバー固有のタスクのリストが スケジュール期間から除外する日付また日付範囲のカンマ区切りリストです スタイル スタティック スタンダード版 スタンダード版では使用できません ステータスコード ステータスコードの有効化 スプールされたメールがメールサーバーによって処理される間隔を秒単位で指定します スプールされたメールを配達するために同時に使用するスレッド数の最大値を入力します スプールアーキテクチャでは スプール間隔 スロットルの合計メモリサイズを制限します セクション セクションが開き セクションでは セッションを使用する場合 セッション変数は セッション変数を使用するかどうかを指定することもできます セッション変数を有効にした場合 ソケット ソケットのタイムアウトです ソケットまたはサードパーティの ソケットタイムアウト ソケット接続の有効化 タイプ タイプごとに独立に適用されます タイプの検証を無効にします タイムアウト タイムアウト時間よりも時間がかかるリクエストは終了します タイムアウト設定を指定します タグ タグおよび タグがアプリケーションページ内で処理されても タグで上書きできます タグで使用されるデフォルトの文字セットを選択します タグで指定したいずれの タグと タグにより タグによる タグによるメール送信 タグの タグのプール内のスレッドの数は無制限です タグのプール内のスレッドの最大数は タグの詳細については タグを使用して タグを使用してフォントを検索し タグを使用します タグを使用する際には タグ内で タスクが反復される間隔を設定します タスクが実行されるたびに新しい出力ファイルが作成されます タスクでエラーが発生した場合の再試行回数です タスクでエラーが発生した場合の処理を指定します タスクのスケジューリングは タスクの一時停止 タスクの優先度を示す整数です タスクの詳細とともにテーブル形式で表示されます タスクの開始日と終了日を入力します タスクの開始時刻と終了時刻を指定します タスクを作成するための最小限のオプションのみが表示されます タスクを実行する期間が表示されます タスクを正常に実行するためには タスクを追加または編集できます タスク名 タスク名とグループの組み合わせが一意であることを確認してください タスク実行中の様 タブ ダイナミック チェックを付けると チャート チャートをメモリまたはディスクにキャッシュできます チャートを処理するスレッドの最大数 テキストボックスにタスクの名前を入力します テキストボックスに入力します テキストボックスを空白のままにしておきます テストメッセージを送信してメールサーバーへの接続が機能することを確認してください テンプレート テンプレートのリクエストが実行されずにタイムアウトしたときにクライアントに送信する テンプレートを使用して テンプレートキャッシュを直ちにクリア テンプレートキャッシュを空にします テンポラリファイルの削除 テーブルが上書きされます テーブルで テーブルでデータソースを選択します テーブルの作成がデータベースでサポートされていない場合に ディスク ディスクにキャッシュする場合は ディスクキャッシュの位置 ディレクトリ ディレクトリなど ディレクトリに提供される デバッグ デフォルト デフォルトでは デフォルトの検索順序 デフォルト値は デプロイメントでサーバーモニターまたはマルチサーバーモニターを使用するには データには データを返す データソース データソースのオプションを選択します データソースのクライアントストアを追加 データソースの選択のみを行う必要があります データソースへのクライアント変数の保存 データベースのドキュメントを参照してください データベーステーブルに保管 データベーステーブルの更新 データベーステーブルを手動で作成してください データベーストランザクションからではなくメモリから結果セットを取得することができます データベーストランザクションが必要です データベーストランザクションが発生しないので データ型 ドキュメント ドライバのいずれかをデータソースで使用する場合は ドライバをデータソースで使用する場合 ドライバを使用している場合は ドロップダウンからデータソースを選択します ドロップダウンリストオブジェクトから ネイティブの ネットワークの問題 バイトを超えるデータを含んでいる場合にのみ表示されます バイトコードコンパイラにより生成されるクラスファイルをディスクに保存します バックアップメールサーバー バッチ形式のすべての処理をスケジュールできます バンドルされた パス パスをドット区切りで指定します パスワード パスワードを指定します パブリッシュ ヒープサイズ ビルトインなど ビルトインフォントは ファイル ファイルからフィルターで除外されます ファイルが含まれているディレクトリへのデフォルトのパス ファイルが含まれるディレクトリのファイルパスを指定します ファイルが含まれるディレクトリの完全修飾名か ファイルです ファイルでタイムアウト値を定義しないかぎり ファイルで設定したタイムアウト値よりも優先されます ファイルにフォントを埋め込むために ファイルにフォントを埋め込むようにオプションで指定できます ファイルに埋め込まれていない場合は ファイルのコピーが ファイルまたは ファイルを ファイルを移動することが必要な場合があります ファイルシステムのオーバーヘッドを最小限に抑えることができます ファイル名を指定します ファイル拡張子 ファミリーを登録する場合があります フィールドをログファイルに保存します フォルダーレベルにクリアを限定できるようになりました フォント フォントおよびフォント拡張子のタイプ フォントが フォントが格納されているディレクトリを参照するか フォントについて詳しくは フォントの フォントのコレクション フォントのポストスクリプト名を指定します フォントの場所 フォントは使用されません フォントまたは フォントも表示されます フォントを含む フォントを含むファイルです フォントを埋め込むとファイルサイズが大きくなりますが フォントスタイル フォントタイプ フォントディレクトリ フォントファイルへの完全修飾パスです フォントファイルを含むディレクトリまたは特定のフォントファイルへの完全修飾パスを指定します フォントファミリー フォントフォーマットの拡張型です フォント管理 フォント管理について フォント管理ページには フォント管理ページのフィールドについて説明します ブラウザが ブラウザで ブラウザに ブラウザの プラットフォームに特有のシステムフォントディレクトリに格納されているフォントが表示されます プラットフォーム固有の次のデフォルトの場所で見つかったフォントが自動的に表示されます プリンターフォント プロキシサーバー ヘッダページは ページ ページがリクエストされるたびに ページが見つからないエラーおよび例外は ページでいずれかのタイプの変数を無効にした場合は ページでは ページでタイムアウトの新規デフォルト値および最大値を入力してください ページで指定した設定をオーバーライドするには ページには ページにはいくつかの設定オプションがあり ページの ページのサンプルを ページの出力がはるかに小さくなります ページの実行 ページの生成 ページへの相対パスを指定します ページを使用して ページを使用します ページを使用すると ページを保存する場合は ページを最初に読み込むと ページを格納できるだけの大きさを持ち ページパスをキャッシュします ページリクエスト ページリクエスト制限だけを調整できます ページリクエスト数です ページ程度の値から試してみるのが適切と考えられます ホスティング環境では ホストシステムと統合されています ホストシステムやオペレーティングシステムの種類を問いません ボタンをクリックして ポストスクリプト名 ポート ポート番号 マッピング マッピングは メソッドの起動には影響しません メソッドを含むコンポーネント メソッドを持つ メソッド呼び出し メッセージを簡易表示する メモ メモリにスプールできるメッセージの最大数 メモリにスプールできるメッセージの最大数を入力します メモリへのスプールはエンタープライズ版のみ メモリを多く使用します メモリキャッシュはより高速ですが メモリ内ファイルシステムの有効化 メモリ内仮想ファイルシステムのサポートを有効にします メモリ内仮想ファイルシステムのメモリ制限 メモリ内仮想ファイルシステムのメモリ制限をメガバイト メモリ変数 メール メールにデジタル署名を追加するように メールサーバー メールサーバーからの電子メールメッセージの取得には メールサーバーが認証を必要とする場合は メールサーバーのスプールの設定について説明します メールサーバーのフェイルオーバーと メールサーバーの接続の確認 メールサーバーの設定 メールサーバーへの メールサーバーへの接続で メールサーバーへの接続を維持します メールサーバーへの接続を開いたままにします メールサーバーを実行するポート番号を入力します メールサーバーアドレス メールサーバーアドレスの前にユーザー名とパスワードを追加します メールスプールの設定 メールメッセージの送信後に メールメッセージを送信するためのバックアップサーバーを入力します メールメッセージを送信するための有効なメールサーバー名を入力します メールロギングの設定 メール文字セットのデフォルトの設定を選択します メール文字セット設定 メール機能を実装するためにスプールアーキテクチャを利用しています メール配達スレッド ユーザーが ユーザーとの対話を必要としないアプリケーション ユーザーセッションの終了時にタイムアウトとなります ユーザー名 ユーザー名を指定します ユーザー定義のフォント ユーザー定義フォントと呼ばれます ユーザー情報およびセッション間の環境設定を保管することができます ユーザー書き込みの各イベントゲートウェイだけが有効になっています ライセンスキーを指定します リクエスト リクエストが同時に許可されます リクエストされたページを リクエストのスロットルしきい値 リクエストのスロットルメモリ リクエストのスロットルメモリサイズを超えている場合はキューに入れられます リクエストのタイムアウト リクエストの処理中に リクエストの制御設定は リクエストの最大数 リクエストの調整 リクエストは十分なメモリの空き容量ができるまでキューに入れられます リクエストを実行できなかったときは リクエストキューのタイムアウトページ リクエストタイムアウト リクエスト強制終了までの リクエスト数です リクエスト経由でリクエストされたメソッドのみが対象になります リストにデータソースが表示されます ルートからのパス ルートからの相対パスで指定します ルートに対する相対パスを指定する必要があります ルートまで ルートまで検索します ルートより下から ルートより下の ルートディレクトリの場所を絶対ファイルパスで指定します ルート内 ルート内で検索します レジストリ レジストリには表示されません レジストリの最大サイズ制限を確認しておく必要があります レジストリは レスポンス時間が短縮されます レポートが適切に表示されるようにするために レポートと レポートの最大数です レポートは必ず適切に表示されます レポートをレンダリングできるようになります レポート定義の開発者が レポート定義ファイルに指定されている場合にフォントが埋め込まれます レポート開発者は ログファイルに書き込む ロケール特有の文字セットに切り替えることができます ローカルおよびリモートの ローカルページまたはリモート 一時停止 一般的なフォント情報およびフォントメトリック情報を含むフォントフォーマットです 一般的な電子メールエラーを記録します 一連の 一部のフォントライセンスでは埋め込みが禁止されています 上書き 事前に定義されたメソッドが起動される 他のシステムに簡単にエクスポートできます 他のノードでは 以上の値にする必要があります 以前のリリースでは 以外に 以外のディレクトリに 以外のポート番号を使用する場合は 仮想コンピュータ 仮想マシン 仮想マシンのパス 件名 低速であるがシャットダウンしてもメッセージは保持される 作成がサポートされていることを 使用するデータベースでデータベーステーブルの 使用先 使用可能な合計メモリが十分でない場合 例 例えば 例外時 保管タイプ 信頼できるキャッシュ 信頼できるキャッシュをクリアするオプションしかなく 修正されていれば再コンパイルを実行します 個 個の 個までしか許可されません 個までです 値は使用されません 値を入力して 優先度 内部の実装の一部である 内部キャッシュを使用してクエリを保存する 内部コンポーネントへのアクセスの無効化 再び解決が試みられます 再試行回数 再開 再開または削除は行えます 処理はこれらの変更の影響は受けません 出力が生成されます 出力へのフォントの埋め込み 出力をファイルに保存 出力ファイルの絶対パスおよびファイル名を 出力形式を 分 分です 分以上先にタスクを設定する必要があります 列 利点 十分なメモリとディスク容量を割り当ててください 単一サーバーに対する 単位で指定できます 印刷用のレポートとドキュメントの作成 反復カウント 台のみであることを確認してください 各セッションの識別子が作成され 各リクエストタイプ 合計メモリの一部としてカウントされません 同時 同時に処理可能な 同時に実行される 同時テンプレートリクエストの最大数 同時リクエストの調整の概要 同時レポートスレッドの最大数 同時処理が可能なチャートリクエストの最大数を指定します 同時処理可能な 名前なしアプリケーションのアプリケーションスコープのダンプを無効にできます 名前なしアプリケーションのアプリケーションスコープのダンプを許可しません 回のみ 回のみ実行 回のみ実行するようにスケジュールします 回のリクエストでサーバーに送信できるデータのサイズを制限します 回の要求の間でもアクセスされるたびに確認されます 回の要求の間に 回の要求の間にテンプレートやコンポーネントに更新が反映される可能性がないアプリケーションの場合は 固有のフォントスタイル 型チェックの無効化 基本的なメールサーバーの設定について説明します 変数が更新されないようにするには 変数の読み取りや書き込みを行うには 変更されたかどうかを確認せずに使用します 変更された場合は自動的にリロードします 変更によって 変更の送信 変更を保存せずに 変更内容が保存される前に 変更後に 外部に保管されるクライアント変数には 多くのメモリが必要となります 大きい数値を指定するほど 完了時 完全修飾 宛先 実行されるページ 実行する 実行するようにスケジュールされている既存のタスクの名前が表示されます 実行するページがセキュリティ保護された場所にある場合にのみ 実装がより複雑です 少なくとも 属性で参照されています 属性のデフォルト設定が 属性または 属性よりも長くなるようにしてください 属性を使用します 左向き矢印アイコンをクリックします 差出人 度だけ検査されます 引数 引数を 必ず 必要な 必要なテーブルがデータベースに作成されます 必要なテーブルがデータベースに既にある場合 必要に応じて 必要に応じてメールサーバーを利用するためのパスワードを入力します 必要に応じてメールサーバーを利用するためのユーザー名を入力します 情報 指定された制限よりも小さいリクエストは 指定された制限を超えて 指定された制限を超えるリクエストはキューに入れられます 指定された制限を超えるリクエストは合計メモリの一部としてカウントされ 指定された制限を超える単一のリクエストを拒否します 指定された最大値を過ぎるとタイムアウトします 指定された開始日およびスケジュール時刻にタスクを 指定したクエリーで置き換えられます 指定したメールサーバーに 指定した日に 指定した日付の間の期間に実行できます 指定した日数アクセスされていないクライアントデータを削除 指定した時間ごとに実行 指定時に 指定間隔 接続しているすべてのデータソースがリストされます 接続の有効化 接続タイムアウト 操作中に作成された一時ファイルを削除するまでの時間を分単位で指定します 改行が圧縮されます 文字セットを使用して送信されます 文字列にカスタムの接頭辞を付加することで 文字設定 新規タスクのスケジューリング 新規フォント 新規フォントを 新規出力ファイルを作成する代わりに 既に解決されたコンポーネントへのパスが無視されて 既存のデータソースを使用できます 既存の出力ファイルが上書きされます 日 日でタイムアウトとなります 日の間にタスクが反復されるようにスケジュールします 日付と時刻を指定します 日数の値を入力します 日本語のメールの多くは 明示的に登録したフォントが表示されます 時間 更新 更新を無効にすると 書き込みよりも読み取りの頻度が高い情報に適しています 最も古いクエリーがキャッシュから削除され 最初は 最大 最大データサイズ 最大値は 最小 最小値は 最後の実行 最高のアプリケーションパフォーマンスを得るには 有効にします 期間 未処理のエラーに対してステータスコード 未処理のエラーを含むすべてに対して 未配達メールの表示 本番サーバーでのみ有効にしてください 検索インデックスディレクトリ 概要フォント名 構造体に非標準の属性を渡せるかどうかを指定します 欠点 次の 次のような 次のタイプのフォントを登録できます 次のタイプのフォント形式を登録できます 次のタスクを指定した後 次のディレクトリ 次のトピックが含まれています 次のフォーマットで詳細を指定します 次の各タイプのリクエストに対して処理できる同時リクエスト数を指定できます 次の実行 次の方法でクライアント変数を保管できます 次の表で 次の表では 次の表にオプションを示します 次の表に示されているとおり 次の表に示すような 次の表の説明に従って 次の表は 次の詳細を指定します 次の領域があります 正しいアクセス権があれば 正しいインターフェイスを実装するオブジェクトの検証も無効になります 正しいデータ型については 正しいポート番号がわからない場合は 毎日 毎日の売上レポート 毎日または 毎週または毎月の指定された時間にタスクを実行するようにスケジュールします 毎週または毎月の指定時間に実行 注意 版ごとの機能 特定のフォルダーのテンプレートキャッシュをクリア 特定のフォントを指定します 独自のデータベース内でのクライアント変数データベーステーブル作成のモデルとして使用することができます 現在の 現在のシステムフォント 現在のタスクの完了後に実行するアクションです 現在のフォルダから 現在のフォルダからシステムルートディレクトリまで検索します 現在のフォルダ内または 現在のプロジェクトフォルダで見つからない場合に 現在は 生成されたチャートを保管するディレクトリを指定します 生成されたメッセージはすぐには送信されない可能性があります 用の 省略および複数指定も可 破棄 確認間隔 社によって開発され 秒 秒を指定して 秘密キーと証明書が格納されているキーストアの場所です 秘密キーを保存するために使用するパスワードです 移植が可能です 空白で区切ります 空白を圧縮すると 空白抑制の有効化 管理者に問い合わせて 簡単に実装できます 終了日 終了日はオプションです 経由 経由で同時に処理可能な 結果ページに返されたリンクで使用されている相対 統計レポートなどの作成をスケジューリングできます 編集 編集または削除できます 編集ページ 編集ページが表示されます 編集ページでは 編集ページに表示されます 繰り返し 署名 自動的にタイムアウトとなるように設定できます 自動電子メールメッセージを送信するメールサーバーを指定できます 複数の 複数のインスタンスの 複数のエントリは 複数のエントリを区切るにはカンマを使用します 複数のサーバーを指定する場合は 複数のメッセージを配達する際のパフォーマンスが向上します 要求されたファイルが変更されているかどうかが 要求されたファイルが更新されているかどうかが 要求にテンプレートをキャッシュ 要素で指定するセッションタイムアウトは 見つからないテンプレートハンドラ 設定 設定が表示されます 設定は完全に 設定を定義できるようにします 設定を統一させることが困難な場合があります 設定を編集できます 設定ファイルの変更の監視 設定ファイルを監視し 設定変更を有効にするために 設定要約 設定項目を示します 証明書と秘密キーをキーストアに保存するために使用するキーのエイリアスです 詳細については 詳細を指定した後 認証されていない 誤実行時 説明 読み取り専用データの保管に 警告 追加 追加できる 追加のメール配達オプションをサポートしています 送信 送信されるメールメッセージは直ちに配達されます 送信データの最大サイズ 送信メールメッセージをメールスプーラに送ります 送信済みメールおよびメールエラーログを次のディレクトリに書き込みます 送信済み電子メールメッセージを記録します 送受信されるパケットのデータサイズです 通常 通常は 通常より時間のかかるリクエストがサーバーリソースを占領するのを防ぎます 通常以外の場所にフォントがインストールされている場合は 連続するスペース 適切なフォントがインストールされていることを確認する必要があります 適用 選択しないと 選択すると 配信されなかったメールが表示されます 配送されるまでにしばらく時間がかかることがあります 配達されるメールメッセージをスプールします 開始時刻と終了時刻を指定して 開発サーバー上で 開発段階では 開発者がプログラムを記述して 開発者は 間隔 関数リクエストの最大数 関連の詳細を指定します 関連エラーメッセージのタイプを選択します 除外 電子メールと 電子メールの送信 電子メールの送受信 電子メールクライアントのほとんどが特定の文字セットを使用する場合は 電子メールメッセージの送信に 電子メールログファイルを示します 電子メールログ処理の基本設定を指定します 非同期 領域 領域に保存されます 頻度 頻繁に更新されないサイトの場合は 高いパフォーマンスが期待できます 高度にカスタマイズ可能なビジネスグラフィックをさまざまな形式で作成できます 高負荷のアプリケーションの全体的なシステムパフォーマンスを向上させます 高速であるがシャットダウンするとメッセージは失われる";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7ffc";
              top.sc1[7] = t;
              top.sc2[7] = p;
              top.sc3[7] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fe9() {
              var t="データとサービス セクション";
              var p="1 10 8500 admin administrator adobe alias applicaiton application c cacerts cer cf cfc cfcollection cfdocs cfindex cfusion cn coldfusion coldfusion10 data description dname encoding environment es export fds2 file flash flex flexassembler genkey http https id import ip java jdbc jre jvm keypass keystore keytool language layer lib livecycle localhost management mypassword printable remoting rest restful restpath rfc rmi runtime secure security service services sockets solr ssl storepass uninstallerdata url v web webapp wsdl wwwroot および およびその他の詳細設定を指定できます および作成したコレクションの保守作業が可能です および削除が可能です が がインデックスを作成するディレクトリになります がフォルダーにない場合は が使用するホストを設定できます が信頼する証明書を判断するときに使用するファイルの中に が動作している が含まれています が検索されるアプリケーションパスまたはルートフォルダーを参照して選択します が登録されます が開きます ここでは この このオプションは このページを使用すると このユーティリティは この場合 これらのメソッドでは これを上書きできます します すべての その そのため そのような証明書を使用する場合は つのアプリケーションのみです で での では でデータソースを登録します でビルトイン と との間の通信を暗号化するために とは とアプリケーション名がフォルダーにある場合は と入力します どの にすばやく配信できます には による にチェックを付けてから に付属しています に接続されている に自動的に登録されます の のウィンドウの上部に のマニュアルディレクトリのインデックスを作成する場合は のメソッドを呼び出すために の有効化 の機能強化 の表示 の設定 の設定は不要です は は有効にならず まず また または またはインデックス作成 またはカウントできます または削除が可能です を をクリックし をクリックして登録します をクリックします をリモートで実行している場合にのみ有効にします を作成した後 を使用した を使用して を使用すると を使用するには を参照してください を含みます を変更できるようになります を指定したフォルダーまたはサブフォルダーにあるすべての を有効にします を有効にする を有効化します を設定します を選択し アクション アクションを実行させることができます アクセスの有効化 アクティブな アドレスでデータサービス操作を実行するかを指定できます アドレスのリストを指定しなかった場合は アドレスの選択 アドレスを指定しないと アプリケーションでデータベースにアクセスする前に アプリケーションでデータベースを使用するには アプリケーションで使用される結果セットでレコードを入力 アプリケーションとの統合のための設定の指定 アプリケーションの アプリケーションの開発 アプリケーションは登録できません アプリケーション名 アプリケーション名でサービスが識別されます アプリケーション名の代わりに仮想マッピングを指定します インターネットを介してリモートアプリケーション機能の作成および使用が可能です インターネット経由でリモートアプリケーション機能の提供と利用が可能です インデックス作成 インデックス作成および検索機能用の インデックス作成されたドキュメントを説明するメタデータで構成されています インデックス作成するディレクトリへのパスを インデックス作成と検索のテクノロジーを提供する インデックス作成機能のインターフェイスです インデックス作成言語を設定することもできます オプション オプションを選択します キャンセル キーストアの作成 キーストアの絶対パス キーストアは自己署名証明書です キーストアを作成します キーストアを作成するには キーストアを証明書に書き出すには キーストアパスワード キーストアファイルの名前 キーストアファイルの場所 キーストアファイルを作成します キーストアファイルを作成するには キーストア内の情報は暗号化され キーストア用のパスワード キーストア項目の名前 クエリのデータは クライアントを有効にするかどうかを指定します コマンドはほぼ次のようになります コレクション コレクションが作成されたら コレクションに値を設定またはインデックス作成するには コレクションのインデックスを統合することによって コレクションのインデックス作成 コレクションのインデックス作成ページが表示されます コレクションのエイリアス コレクションのエイリアスの名前変更または作成 コレクションのエイリアスを指定するには コレクションのディレクトリ構造を保持します コレクションのファイルの拡張子を追加 コレクションのリストで コレクションの作成と保守 コレクションの作成と削除 コレクションの値の設定 コレクションの名前の変更やエイリアスの設定も行えます コレクションの名前またはその コレクションの新しい名前 コレクションの移行 コレクションの管理 コレクションの管理を実行できます コレクションは コレクションをクリックします コレクションをリロードします コレクションを作成した後 コレクションを作成して管理できます コレクションを削除します コレクションを定期的に最適化する必要があります コレクションを移行 コレクションを移行するには コレクションを設定できます コレクションページが表示されます コレクションページでは コレクションページでコレクションを取得できない場合は コレクション内のすべてのドキュメントを削除しますが コレクション内のファイルを分析し コレクション名の変更 コレクション自体は削除しません コンポーネント コードを短縮でき コードを編集せずに サブディレクトリを再帰的にインデックス サポートに接続できます サポートに接続できるかを指定します サポートの有効化 サポートは無効になります サポートを実装します サポートを有効にした場合に サポートを有効にする サーバー サーバーが サーバーに接続して サーバーに接続できます サーバーの サーバーのブラウズ サーバーのホスト名 サーバーのホスト名とホームディレクトリを指定します サーバーの一般名 サーバーを使用しているものと仮定しています サーバーを指定します サーバーを有効にするかどうかを指定します サーバーインスタンスに対するデフォルトとして設定できるのは サーバーインスタンスは サーバーサービス サービス サービスが サービスが表示されます サービスとしてアプリケーションを指定します サービスとしてパブリッシュされます サービスとして登録するフォルダーを指定します サービスとして起動または停止できる サービスの サービスのパブリッシュおよび使用について詳しくは サービスのリストに サービスの使用 サービスの名前を サービスの更新 サービスの概要 サービスの編集 サービスの詳細を指定します サービスの追加 サービスへのマッピングの定義 サービスを使用すると サービスを初めて参照すると サービスを参照するときに サービスを登録することによって サービスを登録すると サービスを登録できるので サービスを追加 サービスページ サービスマッピング サービスマッピングの指定が必須になります サービスマッピングを指定すれば サービスリクエストのタイムアウト値を秒単位で指定します サービス名 サービス名が表示されます サービス名をクリックします セクション セクションで セクションで実行できる一般的なタスクの一部を示します セクションの セクションは セクションを使用して タグのみを使用してインデックス作成できます タグを使用して作成できます タスク チェックを解除します ディレクトリパス デフォルト デフォルトとしてのサービスを削除するには デフォルトアプリケーションはいつでも変更できます デフォルトアプリケーションを設定する データとサービス データソース データソースとして設定します データソースとやりとりするために必要なデータベースドライバーを把握して決定します データソースの作成 データソースの作成および管理 データソースの追加のについて詳しくは データソースは データソースを確認します データソース情報を追加し データソース接続の確立 データベースに接続することにより データベースを データベースドライバーを使用してデータソースと通信します データベース操作に対するエントリポイントです ドキュメントの論理グループおよびドキュメントについてのメタデータです ドキュメントファイルに対する論理ポインタが含まれます ドキュメントフィールド情報の内部ドキュメントテーブル ドライバーを指定し ネストされた バッファー制限 バッファー制限などの詳細設定も指定できます パスを検索して入力するには パネルの下部にある パラメータ ファイルに証明書を読み込むには ファイルの削除や変更後にできたメモリ空間を再度要求します ファイル拡張子 フィールドにエイリアスを入力して フィールドに入力します フィールドに新しい名前を入力して フィールドの拡張子を確認します フォルダにあります フォルダーを指定する際に ブラウザー内の検索で見つかったドキュメントを表示するために使用された プロキシサーバーの詳細および資格情報を指定します ページ ページが表示されます ページで ページでは ページを使用すると ホームを参照して選択した後 ホームディレクトリ ボタンをクリックします ボックスでキーストアのパスワードを指定します ボックスでキーストアファイルを指定します ボックスに入力します ボート ポート メタデータ メタデータおよびそのファイルを指すポインタを組み立てます ユーザーは ユーザー名とパスワードを入力します ユーティリティのパラメータを説明します ユーティリティを使用します リモート リモートアプリケーションにリクエストを行って リモートアプリケーションの機能をインターネットを介して公開したり利用したりできます リモートサーバーの場合は リロード ローカルコンピュータ上のプロセスのみが 以下の手順で示す 任意の名前が使用できます 作成した証明書を格納します 作業手順は次のとおりです 使用する場合は 例えば 全体をクライアントで指定する必要はありません 全体を指定する必要がないようにすることができます 列内のアイコンを使用して 削除 削除のいずれかのアクションを使用できます 動的なデータベースコンテンツを 単語のインデックス 取得 古い 同期 名前を変更する 変更の送信 変更を保存せずにページを閉じるには 常にその名前で参照する限りは 形式で証明書を作成します 必要に応じて 指定されたサービスマッピングでサービスが識別されます 指定したディレクトリのサブディレクトリを含めるには 指定したディレクトリのテキストファイルおよびバイナリファイルのデータでコレクションに値を設定 指定したディレクトリのデータでコレクションの値が設定されます 指定したパスワードを使用しないとアクセスできません 挿入 接続を使用するかどうか 接頭辞を 新規ブラウザーウィンドウで 暗号化された 最適化 検索 検索のサポート 検索をさらに高速化するために 検索インターフェイスの構築 検索インターフェイスの構築の詳細については 検索サーバーが動作しているか確認してください 検索サービスはローカルホストまたはリモートホストに設定できます 検索操作を実行する際に 次に 次に起動すると 次のことを行う必要があります 次のアクションを実行します 次の表で 次の表は 次の詳細を追加します 無効なキーストアファイルやパスワードを指定した場合 独立したサーバーとして動作します 用に有効化 用の 登録された 登録されたサービスが自動的にパブリッシュされます 登録されているすべての 登録した後 破棄 秘密キー用のパスワード 管理が可能です 管理ポート 統合 統合機能を有効にし 編集 編集または削除できます 言語名と接尾辞を提供することで 設定を変更します 設定ファイルに記録されます 許可する 証明書を格納するファイル 詳しくは 詳細な証明書情報を出力します 詳細については 詳細を指定した後 詳細設定の表示 認証に関する詳細 認証機関が署名した証明書は不要ですが 説明 識別名 返信先 送信 通常の名前は 開発ガイド 関連コンポーネントが変更されたら常にアプリケーションをリフレッシュします 領域で 領域の次のパネルを使用して 高速かつ効率的なサイト検索を行えるように最適化されたインデックス付きデータコレクションの作成";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fe9";
              top.sc1[8] = t;
              top.sc2[8] = p;
              top.sc3[8] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fe0() {
              var t="デバッグとロギング セクション";
              var p="0 00 04 1 10 127 14 2 20 2002 21 4 5 9 actionscript address administrator adobe application avgdb avgq avgreq bin bytes car cfide cfm cfml cfstat cftimer cftrace cgi classic coldfusion cookie corba customtag datagram db dd derby dockable dt eclipse ed eventgateway exception executive filter flash ftp g hh html http id in ip java jvm kb log logs mail mailsent migration migrationexception mm monitor mx n nt odbc ok out pg port portnum probe probes protocol q rds rdservice remoting req robust run s scheduler sec server smtp socket sql ss suspend syslog system time to transport udp universal unix uri url web x xrunjdwp y yyyy ある場合のみ いずれかの語句に一致 および およびタスク およびホスト名に関する一般情報を表示します およびポート番号を入力します から からのアップグレードに関連するエラーが記録されます からアップグレードした後の が があるディレクトリを入力するか参照します がセキュリティ保護されたパスの場合は がリクエストの処理に要する平均時間 が待機する秒数を指定します が書き込んだバイト数 が現在アクティブに処理しているリクエストの数 が表示されます が読み込んだバイト数 このため このオプションをオンにした後は このオプションを選択します このスイッチは このディレクトリで このパネルとブラウザ制限の詳細については このフィールドに指定する場所には このプローブを実行するスケジュールを選択します このページでプローブ設定が正常に実行される必要があります このページで指定した変更を有効にするには このボタンをクリックします このリクエストをプロキシサーバー経由でルーティングする必要がある場合は このログファイルには この例では この値がより小さくなるようにします この値は この制限に到達すると この制限に達したファイルは自動的にアーカイブされます この形式では基本的な表示が出力され この情報を使用して この最大数に達すると この設定を変更した場合は これにより これらのボタンをクリックします ごとに次のように表示されます ご使用の すべて すべての すべてのプローブアクションは すべてのユーザーがデバッグ出力を見ることができます すべての語句に一致 そのサブネット内で動作中の そのディレクトリのパスワードが必要です そのディレクトリのユーザー名が必要です そのプロキシサーバーの それに加え つのリクエストの平均が表示されます つの異なる つ以上の設定済みプローブの現在の動作状態が つ以上入力します つ以上指定します つ以上選択します で です では で動作する で時間の範囲を入力します で発生した例外に対するスタックトレースが記録されます と以前のバージョンの と入力して次のスイッチを使用します と入力します なリクエストスレッドが区切られた拡張出力で表示されます において発生するエラーが記録されます によって送信されたメッセージが記録されます によるリクエストの処理待ちに要する平均時間 による処理を待っているリクエストの数 にアクセスし にアクセス中にエラーが発生した場合は にプローブがアクセスできない場合 にプローブがアクセスできない場合の電子メールの受信者アドレスを に出力される情報を表示できます に導入されたログファイル に指定します に指示する場合に選択します に書き込まれます に表示されます の のいずれかのオプションを選択します のみ のエラーがすべて記録されます のエラーが記録されます のエントリが記録されます のオプション のナビゲーションペインで のバージョン のリアルタイムパフォーマンス測定データを収集できます のリクエストの処理に要する平均時間 のルートディレクトリ のロギングオプションを変更するには のログファイルが書き込まれる場所を変更するには の変換 の書式で日付を入力します の有効化 の検証がデフォルト設定になります の次のサービスに対してログファイルを生成できます の無効なシンタックスがレポートされます の設定で指定します の閉じタグがあるコメントなど の開きコメントタグに の間で互換性の問題が発生する可能性があるかどうか判断します は はデバッグ出力をすべてのユーザーに対して表示します は整数です へのリンクを変更しないようにする場合に選択します また またそれが成功したかどうかが示されます または または何らかの原因で応答しない場合は または削除が可能です をクリックして をクリックします を使用するときは を再起動してください を効率化し を効率化することで小さくできます を参照してください を検証するかどうか を設定できます アイコンをクリックすると アイテム アクション アドレス アドレスが アドレスがリストに表示されなくなります アドレスは アドレスを アドレスを制限できます アドレスを削除するには アドレスを指定しない場合 アドレスを指定するには アドレスを追加および削除できます アドレスを追加するには アドレスを選択します アドレスページに入力します アナライザの実行 アナライザは次のように使用します アプリケーション アプリケーションに関する潜在的な問題やボトルネックを診断できます アプリケーションに関する潜在的な問題を診断できます アプリケーションのステータスの評価を支援します アプリケーションの実行に関連するエラーが記録されます アプリケーションを使用せずに アプリケーション名が表示されます アーカイブ アーカイブの最大数 イベントゲートウェイに関連するイベントとエラーが記録されます インスタンスが正しくライセンスされているかを判定できます インスタンスすべてについてのライセンスとバージョンの情報を収集します インスタンスを探し出します エラー エラーが表示されます エラーと情報のデータがレポートされます エラーを含むすべてのアプリケーションページエラーが書き込まれます エラーログファイルを書き込むディレクトリを指定します エンタープライズ版でのみ使用できます エンタープライズ版で使用できます エントリ エントリは オプション オプションがオンになっていることを確認してください オプションをオンにします オプションを選択した場合は オペレーティングシステムのロギング機能の使用 オンラインヘルプを参照してください カスタムタグの処理中に発生したエラーが記録されます キャッシュを拡張することで小さくできます キーワード クエリーイベントとストアドプロシージャイベント用のデータベースアクティビティを表示します コマンドラインユーティリティを使用すると コメント コンテンツが予想外の場合 コードアナライザ コードアナライザを選択します サイトのアーカイブおよび復元に関するエラーが記録されます サイトのリソースの可用性を監視するために作成された サブディレクトリの分析 サブディレクトリを分析するかどうか サブネット内の サポートされていない サーバーがクラッシュした場合 サーバーの再起動などの修復アクションのためのスクリプトを実行することもできます サーバーを再起動します サーバーインスタンスから サーバーインスタンスのポート番号を明示的に指定する必用があります サーバー設定の場合のみ サービス システムサービスに対するセキュリティ権限が必要です システムプローブ システムプローブの追加 システムプローブは システムプローブを管理します システムプローブページが表示されます システムプローブページで システムプローブページにリストされているプローブ設定を保存および更新するには システムプローブページに指定された電子メールアドレスを使用します システムプローブページを使用して シンタックスエラー スイッチ スイッチの有無にかかわらず指定できます スケジュールされたイベントで スケジュールされたタスクのロギングを有効化 スケジュールされたタスク同様 スケジュールされたページの スタックトレースなどが含まれます スタンダード版では無視されます ステータス ステートメント スムーズに移行するために必要な実装変更の概要が表示されます スレッド セクション セッション変数 ソケット接続を使用して測定データを取得します タイマー情報 タイムアウト タイムアウトとなったリクエスト数 タイムアウトになった タイムスタンプ タグからの出力を表示します タグを使用してトレースすることにより タスクとして実行されるため タスクのスケジューリングをロギングします タスクのスケジューリングをロギングするには タスクの送信が開始されたか タブに指定されているフィルター基準に一致する情報を除外した結果が表示されます タブに指定されているフィルター基準に一致する結果が表示されます ダイアログボックスで ダウンロード テキストボックスに単語を テクニカルサポートの担当者が テンプレート テンプレートの物理パスと テーブルで テーブルにある テーブルの ディレクトリがセキュリティ保護されている場合は ディレクトリにあります ディレクトリにある デバッガのポートはアプリケーションサーバーの デバッガの設定 デバッガを使用するには デバッガサーバーの停止 デバッグが有効な場合 デバッグする デバッグとロギング デバッグを出力する デバッグを有効にするとパフォーマンスが低下します デバッグオプションが有効な場合はデフォルトで デバッグオプションが有効な状態で デバッグサービスを有効にします デバッグ出力に デバッグ出力の設定 デバッグ出力は デバッグ出力へのアクセスを制限します デバッグ出力を受信する デバッグ出力オプションを選択します デバッグ出力形式の選択 デバッグ形式を制御します デバッグ設定の概要 デフォルト デフォルトでは データソース名 データベースアクティビティ データベース関連の トレースイベント情報をデバッグ出力に表示します トレース情報 ドッキング可能なツリーベースのデバッグパネルです ドロップダウンリストボックスをクリックして パスが表示されます パスワード パスワードを指定します パフォーマンスモニタがサポートされないプラットフォームに関するパフォーマンス情報を表示します パフォーマンスモニタアプリケーションを使用して パフォーマンス監視の有効化 パブリッシュ パラメータ ヒント ファイル ファイルがこのサイズに到達すると ファイルとデータベースに ファイルに書き込まれます ファイルに記録されます ファイルは古い順に削除されます ファイルへの出力を減らすのに役立ちます ファイルタイプの分析 フィルタの開始 フィルターを適用するアプリケーション名を入力します フィルターを適用する厳格度レベルを フィルター処理を開始するには フィード フィールドの下のリストに表示されます フォームのコンパイル時にブラウザに フォームコンパイルエラーとメッセージ ブラウザによってリクエストされたすべてのアプリケーションページにデバッグ情報を提供するように ブラウザの制限はほとんどありません プロキシサーバー プロキシサーバーのポート番号です プログラムのパスと名前を指定します プログラムの実行 プログラムフローおよび効率を追跡することができます プローブがアクティブな場合 プローブが失敗したときにプログラムを実行するには プローブが無効な場合 プローブが非アクティブで プローブとプローブの間の期間が表示されます プローブにより プローブの名前が表示されます プローブの失敗 プローブの無効化アイコンをクリックします プローブは プローブはスケジュールされた プローブは実行されません プローブを プローブをホスティングしているサーバーがクラッシュした場合 プローブを削除します プローブを編集できます プローブ名 プローブ名を探してクリックします プローブ操作の一時停止 プローブ設定の名前を指定します プローブ設定を作成するには ベースでリモートアクセスする手段を提供します ページ ページおよび ページが確認され ページでは ページで指定されたアドレスに警告の電子メールを送信できます ページには ページにも各プローブのステータスが表示されます ページにスタティックコンテンツを移動することによってこの値を下げることができます ページの数 ページの表示時間に影響が出ます ページは ページを使用します ページを指定します ページを評価して ページを選択 ホスト ポート ポートと同時デバッグセッションの最大数を指定します ポートレット マルチキャストを使用して メールサーバーによって発生したエラーが記録されます メールサーバーページに指定したアドレスがこのアドレスになります ユーザー ユーザーに報告された ユーザーエージェント ユーザーロケール ユーザー名 ユーザー名を指定します ユーティリティが1秒あたりのカウンタで有意な値を表示できるように最初の行の表示を遅らせます ユーティリティが返す測定データを示します ユーティリティの使用 ユーティリティは ユーティリティを使用する前に ユーティリティを使用すれば ユーティリティを実行して ライセンススキャナー ラインデバッグの許可 リクエストで発生したすべての リクエストのデバッグ出力の有効化 リクエストの総数 リストから リソースの可用性をプローブが確認する頻度 リソースをテストするために使用する引数を指定する場合は リソースを確認するためにプローブが実行される期間 リモート開発サービス ロギングの有効化と無効化 ロギングの設定 ロギングの設定ページを使用して管理ロギングオプションを有効または無効にします ロギング機能を使用してメッセージをロギングするには ログディレクトリ ログビューアページの ログファイル ログファイルにもログメッセージが書き込まれます ログファイルの ログファイルの最大ファイルサイズを設定します ログファイルの検索 ログファイルの表示 ログファイルの説明です ログファイルページの処理列の開始 ログフィルターを開くには ログ内容のフィルタリング ローカルサブネットを検索し 一時停止するプローブの名前を選択して 一致を表示 一致を隠す 一般的なデバッグ情報 不明 不要なダイナミックオペレーションおよびサードパーティイベントを削除する積極的なキャッシングにより 互換性の問題が発生する可能性がある箇所がすべて報告されます 以前に無効化されたものであっても 以前のバージョンで使用可能です 以前のバージョンの 作成された 作成するログのアーカイブの最大数を設定します 作成するログアーカイブの最大数を設定します 使用される 使用しているコンピューターの 使用可能なログファイル 例えば 例外をデバッグ出力に表示します 例外ページに詳細情報を表示します 例外情報 例外情報の有効化 値が小さいほど望ましい状態です 停止します 停止のアイコンを使用して 内にある文字列の存在と欠落もチェックできます 内部 処理が遅いページをログに記録することによって 処理に一定以上の時間を要するページの名前をログに記録します 処理時間の遅いページのロギング 出力を 出力ファイル名を指定します 出力結果をファイルに書き込む場合に選択します 分 分析する 分析するファイルタイプ 分析する製品機能 列 列として 列の 列ヘッダを表示しません 列内のボタンを使用して 削除 削除などの操作を実行できます 削除また無効化するには 十分なディスク容量および 午後 単位はミリ秒 単位はミリ秒で 即座に実行します 厳格度によるフィルタ 厳格度の表示 厳格度別にフィルターを適用するかどうか 各プローブが監視している 含まれるファイルの相対年齢を指定します 呼び出しをロギング 呼び出しをロギングします 呼び出しをロギングするには 呼び出し間での複雑さおよびリソースロードの違いはすべて無視されます 問題を追跡してトラブルシューティングするために使用します 基本オプションを使用してコードアナライザを実行すると 変数 変数などについての情報をデバッグ出力に表示します 変更を有効にするために 失敗 失敗が検出されたときに実行される次のアクションのどちらかまたは両方を指定します 失敗が検出されたときに電子メールメッセージを送信するように 失敗を登録する前にプローブが待機する時間を秒単位で指定します 失敗時のアクション 実行 実行された日時 実行のために既に送信されたものが記録されます 実行中のサーバーについての情報を表示できるようにします 実行中のリクエスト数 実行待ちのリクエスト数 実行時間のレポート 左ナビゲーションペインで 平均ではありません 平均キュー時間 平均データベーストランザクション時間 平均リクエスト時間 年 年月日 待ち時間を含む 必要に応じて 情報 拡張オプション 指定された間隔で 指定された間隔でのプローブの自動実行を開始または停止します 指定した 指定した処理間隔よりも長くかかっているページの名前のロギングを開始する前に 指定した時間制限を超えた実行時間をレポートします 整数値を指定しないと 文字列は 新規のプローブの定義 新規プローブを定義します 既存のプローブ設定を実行 既存のプローブ設定を編集します 日にちの範囲 日を指定するには 時を指定するには 時分秒の書式 時間 時間の範囲 最も古いファイルから順に削除されます 最大ファイルサイズ 最後に完了した 最後のサーバー再起動から実行されていない場合 最近のログ 月 有効 有益なデバッグ情報を含むエラーログファイルのディレクトリを指定します 本番サーバーではデバッグを有効にしないことをお勧めします 検索 様 標準の 機能もコード互換性アナライザで検出され 機能や非推奨の 次に例を示します 次のいずれかのオプションをクリックします 次のいずれかの形式を選択します 次のいずれかを行います 次のアクションを実行します 次のオプションを 次のデバッグオプションがあります 次のページを使用してデバッグの基本設定を指定します 次の表に 次の表に説明するように 次の表は 次の設定を指定するか編集します 次の項目を指定します 正しく実行されないコードがレポートされます 正しく実行されるが 測定データ名 無効 特定のログタイプのロギングを開始 特定の日にちの範囲のログ内容を表示するには 特定の時間の範囲のログ内容を表示するには 現在 現在のものを追加 現在動作している別の 現在実行中のデバッグセッションを停止するには 略称 番号は 番目の 番目のエントリ 直前の 秒 秒あたりにデータベースにアクセスする回数 秒あたりのデータベースアクセス数 秒あたりのページヒット数 秒あたりの着信バイト 秒あたりの送信バイト 秒おきに表示します 秒ごとに新しい行を表示します 秒間に 秒間に処理される 結果のレポートを表示するには 編集 編集を考慮する必要があるものがレポートされます 編集ページ 編集ページが表示されます 編集ページで 自動的にアーカイブされます 行ずつ表示し 行ずつ表示します 行だけ返します 行番号と行スニペット 表示 複数のファイルはセミコロンで区切ります 設定項目を示します 詳細については 詳細情報には 語句に完全に一致 説明 追加 追加した 送信 送信者の電子メールアドレスを指定します 通信をリスンするポートを指定できます 通常のページ出力に続いてブロック形式で表示されます 通知 通知電子メールの受信者 選択の削除 開始日と終了日を入力します 開始時刻と終了時刻 開始時刻と終了時刻を入力します 開発用のみ 間隔 電子メール 電子メールによる通知の送信 非推奨のタグなど 頻度";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fe0";
              top.sc1[9] = t;
              top.sc2[9] = p;
              top.sc3[9] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fd4() {
              var t="coldfusion サーバーの監視 セクション";
              var p="1 adobe coldfusion swf このアプリケーションを使用すると つで また アプリケーションです アプリケーションの エラーといった クエリー サーバーについての情報を確認できます サーバーのスナップショットを撮ったりできます サーバーの監視 サーバーモニタ サーバーモニタは サーバー上のアクティビティを追跡するために使用できます サーバー情報の収集を開始および終了したり セクション セクションでは マルチサーバーモニタ マルチサーバーモニタも メモリ使用量 リクエスト 次のアプリケーションを実行できます 複数のサーバーのステータスを追跡できます";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fd4";
              top.sc1[10] = t;
              top.sc2[10] = p;
              top.sc3[10] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7ff3() {
              var t="拡張機能 セクション";
              var p="2 4 5 administrator blank borland broker c cf cfapplet cfml cfusion cfx class classes classpath coldfusion coldfusion10 com corba customtags dll file http inf inprise j2ee jar java lib linux name namingroot notsupported nt object omg orb orbclass orbsingletonclass org prefix properties property ram request root runtime servername sl so solaris svcnameroot url vbjorb vbroker visibroker visibrokerconnector web webapp webinf windows あらかじめ および およびアプレット登録の編集と削除が可能です および削除が可能です この このオプションを選択すると このテキストボックスには このファイルには このファイル名は このフィールドは不要です このフィールドを空白にしておきます このページには このページの領域を説明します このページを使用して このボタンをクリックすると このメソッド名は このメッセージを上書きできます この領域には すべてのパラメータが事前に定義されるため そのアプレットの登録フィールドを表示または編集できます その前に ただし つの方法で作成できます で では で作成した という接頭辞を付ける必要があります として使用する方法 にアプレットを登録しておくと に対する相対指定です に登録されているカスタムタグのパスが表示されます に組み込まれています に維持できます に配置してください に関連付けられている操作または指定した共有オブジェクトに対応している必要があります の のような他の技術を使用するように設定するには のように のクラスパス設定からアクセスできる必要があります のルートディレクトリ の場合は の後 の登録 は は特定ベンダの製品に限定されません または や をクリックして をクリックします をクリックすると をクリックすると削除できます をクリックすると選択したパスを編集でき をダイナミックリンクライブラリ を作成するために使用する言語のタイプが表示されます を入力します を共有オブジェクト を指定します を設定する次のプロパティが含まれています アクション アプリケーションで アプリケーションに含める アプリケーションのルートディレクトリ アプレット アプレットには アプレットにメソッドがない場合は アプレットのマニュアルに説明されています アプレットの上下の空白の寸法をピクセル単位で入力します アプレットの両側の空白の寸法をピクセル単位で入力します アプレットの名前をクリックすれば アプレットの名前を指定します アプレットの垂直方向の寸法をピクセル単位で入力します アプレットの水平方向の寸法をピクセル単位で入力します アプレットの登録 アプレットの登録または登録の変更 アプレットの登録を削除できます アプレットの登録フィールドを編集できます アプレットの追加 アプレットをサポートしないブラウザーに表示されるメッセージを指定します アプレットを使用するために必要なパラメーターが用意されています アプレットを使用するには アプレットを登録します アプレットを登録すると アプレットを登録する場合は アプレットを登録する際にコードベースの引数を指定する必要があるので アプレットを追加または変更するには アプレットを選択して アプレットクラスファイルは アプレットコンポーネントが アプレットコンポーネントを含むディレクトリが表示されます アプレットコンポーネントを含むディレクトリである アプレットサブクラスが含まれるファイルの名前が表示されます アプレットサブクラスを含むファイルの名前を指定します アプレット名 アプレット登録の名前をクリックします アーカイブ インストールパスをメモしておきます インターフェイスを使用する方法 インターフェイスを実装するクラス名 オプション オプションの説明を参照してください オペレーティングシステム カスタムタグのディレクトリパスの追加 カスタムタグのパス カスタムタグのパスを指定します カスタムタグの場所に追加のパスを指定できます カスタムタグの場所を探すために カスタムタグの登録および管理には クラスファイルおよびクラスに必要な他のファイルをインストールします クラスファイルは クラス名 クリックすると コネクタ コネクタの登録 コネクタの設定が完了したらサーバーを再起動します コネクタの設定例を次に示します コネクタは コネクタを使用してダイナミックに コネクタを使用するには コネクタを登録し コード コードで簡単に コードベース コードベースの サポートされないときのメッセージ サーバーのブラウズ サーバーライブラリ サーバー設定 サーバー設定の場合 システムをすばやく参照できます セクション セクションを使用します タイプ タグ タグで設定したパラメータは タグの タグの使用を示すメッセージを入力します タグの使用方法が表示されます タグの名前をクリックすると タグの名前を指定します タグの名前属性で使用されます タグの名前属性で使用されるメソッドがこの列に表示されます タグの登録を削除できます タグの登録フィールドを編集できます タグの登録フィールドを表示または編集できます タグの追加 タグは次の タグを使用するには タグを使用できるようになります タグを実装する操作を入力します タグを登録する必要があります タグを登録できます タグ名 タグ名には テキストボックスに入力します テキストボックスに指定されているパスを追加できます テーブルで ディレクトリにすべてのカスタムタグが保存されます ディレクトリに保存します デフォルトでは デフォルト値を入力します パス パスの追加 パラメーターの値を追加できます パラメータ名 ファイルで定義した ファイルにパッケージ化して ファイルに保存されている場合は ファイルに含まれている場合 ファイルは ファイルをインクルードします ファイル名を ファイル拡張子は不要です ブラウザーのルートディレクトリ内に存在する必要があります ベンダ ベンダによって提供される ページ ページでは ページでアプレットを登録しておく必要があります ページで定義したパラメータの設定よりも優先されます ページを使用します マルチサーバーおよび メソッド メソッドの値でフォーム変数の値を設定するために ライブラリ ライブラリおよびコネクタに関する情報を示します ライブラリへのパスを入力するか ライブラリを ライブラリをロードするため ランタイムライブラリによって異なります ランタイムライブラリは ロードしたライブラリの維持 事前に 以降 使用するアプレットソースとフォーム変数名を入力します 使用するライブラリを見つけます 例えば 個別のパラメーターフィールドに各パラメーターを入力します 値 内 削除 削除アイコンをクリックすれば 各必須アプレットパラメーターの名前を入力します 垂直方向の余白 大文字と小文字が区別されることに注意してください 属性に別のメッセージを指定すれば 幅 必ず 必要に応じて 拡張子 拡張子は不要 拡張機能 指定したすべてのパラメーター名に対して 操作 操作名では 操作名は 文字列値を返すアプレット内のメソッドを指定します 新規 新規アプレットの登録 新規パス 新規登録の場合は 既存の登録の場合は 有効なエントリに関するガイドラインは 次の情報を指定または変更します 次の表で 次の表は 次の領域があります 水平方向の余白 用の 用のコネクタは 登録された 登録する 登録情報を保存および適用するには 組み込み済み 編集 編集アイコンをクリックすれば 編集ページ 編集ページが表示されます 編集ページで 編集ページにアクセスするには 編集ページを使用します 行揃え 行揃えオプションを選択します 表示または変更する 設定 設定の場合 詳しくは 説明 追加 送信 通常 開発者が利用できる 領域 高さ";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7ff3";
              top.sc1[11] = t;
              top.sc2[11] = p;
              top.sc3[11] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fce() {
              var t="イベントゲートウェイ セクション";
              var p="administrator and cfc cfml coldfusion datamanagement dataservicesmessaging directorywatcher eventgateway extensible flash flex fms getgatewayhelper http id ip java jms lotus media message messaging n presence protocol sametime sendgatewaymessage server service short sms smsgateway socket tcp xmpp いくつかのイベントゲートウェイが含まれています およびゲートウェイインスタンスに関する設定ができます から非同期イベントをトリガします が非同期で外部のイベントやメッセージに応答したり この値は この設定を変更すると さまざまなソースからのイベントを すべてのイベントゲートウェイに対する設定の変更と そのシステム上で使用可能なゲートウェイのタイプを設定できます には に付属するイベントゲートウェイタイプについて説明します に送ることができます の のコンシューマまたはプロデューサとして機能します の宛先にその宛先が管理するデータの変更を通知するようにします の起動時にはイベントゲートウェイを起動しませんが の起動時にイベントゲートウェイを起動します への絶対パスです を指定します アプリケーションでイベントゲートウェイを使用すれば アプリケーションとの間でメッセージを送受信します アプリケーションにより アプリケーションまたは イベントが到着したときに イベントやメッセージを生成したりするために使用する イベントキューに格納できるイベントの最大数を指定します イベントゲートウェイ イベントゲートウェイのタイプ イベントゲートウェイの場合は イベントゲートウェイの概要 イベントゲートウェイの設定 イベントゲートウェイの起動ステータス イベントゲートウェイは イベントゲートウェイを使用して イベントゲートウェイを起動できないようにします イベントゲートウェイインスタンスの名前 イベントゲートウェイインスタンスを設定して イベントゲートウェイサービスの有効化 イベントゲートウェイタイプの名前 イベントゲートウェイ処理スレッド インスタントメッセージ インスタントメッセージプロトコル用のゲートウェイなど オプション キューに入れるイベントの最大数 キューの長さがこの値を超えると クライアントを通じてデータを修正し クラス クラス名の完全修飾名 ゲートウェイ ゲートウェイのイベントは処理キューに追加されません ゲートウェイインスタンス ゲートウェイクラスが停止されます ゲートウェイクラスの完全 ゲートウェイタイプ ゲートウェイタイプの説明を指定します コンポーネント サンプル サンプルのゲートウェイタイプです サービスが再起動します サービスを有効化するかどうかを指定します ショートメッセージを送受信するための スタートアップタイムアウト スタートアップタイムアウトを秒単位で指定します スタートアップタイムアウト時に停止 スタートアップモード スタートアップ時にタイムアウトすると スループットは向上します セクション セクションでは タイプの設定後は タイプ名 タイムアウト値を超過すると警告メッセージがログに記録されます テキスト テストサーバーの停止 テストサーバーの起動 テストサーバーを起動および停止します テストサーバーを起動および停止することができます パス ページ ページから起動できます ページでは ポートに送信されたメッセージを処理できます ポートをリスンします メッセージを送信および受信するために使用します モバイルデバイスからのショートメッセージまたは リクエスト以外の方法で情報を受け取って処理することができます リソースの消費量は大きくなりますが 例えば 共有オブジェクトに変更を反映させます 受信メッセージを処理するリスナー 大きい数値を設定するほど 手動 携帯電話やポケットベルなどのワイヤレスデバイス間で 有効にした場合 次のいずれかです 次のタイプがあります 次の表で 次の表は 無効 無効にした場合 特定のディレクトリ内にあるファイルの変更を監視します 秒 経由のインスタントメッセージを送信および受信するために使用します 自動 要素です 記述した 設定したタイプのゲートウェイインスタンスをいくつでも作成できます 設定ファイル 設定項目を示します 説明 選択したイベントゲートウェイインスタンスで必要となる場合に指定します 関数および 関数で使用します 関数を実行するために使用されるスレッドの最大数を指定します";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fce";
              top.sc1[12] = t;
              top.sc2[12] = p;
              top.sc3[12] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7ff4() {
              var t="セキュリティ セクション";
              var p="1 5 50 500 8 admin adminapi administrator adobe amf api builder cfide cfm chard coldfusion configure ctrl dreamweaver eclipse exchange exposed flash homesite id ip macromedia mx name neo pdf pop rds remoting report root security services shift soap string userid var web xml および および実行時権限などのセキュリティ権限を指定するには および許可されたロールを指定できます か からサーバーリソースにアクセスする場合について ここでは このページで このページでパスワードの変更もできます このページは この作業はサーバーを使用していないとき これらのサービスには これを変更するには これを行うには すべてのサービスが すべてのサービスが許可されているサービスリストボックスに表示されます すべてのデータソース接続はリセットされます すべてのユーザーが同じ そのため その効果は それぞれを異なるユーザーまたは組織が管理する場合に特に便利です それらのページのみが表示されます つのサーバー上に複数の つ上のレベルのディレクトリ です では という文字列を次のように変更する必要があります とは によって割り当てられたデフォルトのシード値 にアクセスできるユーザーは にログインした後に にログインしている間に にログインする必要があります に置き換えます の のどちらかを選択します のみにユーザーがアクセスできるようになります のサンドボックス設定を継承します のセキュリティの枠組みを設定できます のページを選択します のユーザーのユーザー名 の権限を複数のユーザーに付与するには の特定のページへのアクセスを付与すると は へのアクセス へのアクセスを付与してロールを選択すると へのアクセスを許可するように設定したりすることもできます へのアクセスを許可できます へのアクセス制限を有効または無効にするには また または またはユーザーが指定したシード値を変更するには や を をクリックして をクリックします を使用してアクセスできます を使用します を使用するには を参照してください を変更するには アクション列の編集アイコンをクリックします アクセス アクセスのみ アクセスの特定の部分に対するアクセスを個別にカスタマイズしてユーザーを作成できます アクセスを付与する場合も アクセスを許可 アクセス権 アドレス アドレスと アドレスの範囲を設定します アドレスを指定します アプリケーションを配置し イメージサービス インストール後の オプションで オプションを選択する必要があります オプションを選択を選択する必要があります キーを押しながら キーを押しながら選択します コンソールと サイト内の所定の領域 サブディレクトリ サブディレクトリのサンドボックス設定を定義すると サンドボックス サンドボックスの追加 サンドボックスセキュリティ サンドボックスセキュリティは サンドボックスセキュリティを有効にした場合 サンドボックス作成について詳しくは サービス サービスとして公開されます サービスに対するユーザーアクセス制御を設定することもできます サービスへのアクセスを許可するクライアントの シード値を変更すると スタンダード版では セキュリティ セキュリティの詳細については セキュリティ制限の適用対象となる セクション セクションから セクションから選択できます セクションで セクションでは タグ ディレクトリ ディレクトリへのアクセスを有効にします デフォルトでは デフォルトの管理者ユーザー データソース データソースパスワードを暗号化するための新しいシード値を指定できます ドキュメントサービス パスワード パスワードによる パスワードによる制限を有効または無効にするには パスワードを使用するように設定したり パスワードを変更することもできます パスワードを確認します パスワードシード パスワード暗号化に使用するシードの設定変更 ファイル ファイルとディレクトリ ファイルに次のエントリを追加し ファイルを含むディレクトリ ファイルを編集して ページ ページで ページの場所を使用して機能を調べます ページの実行時権限も編集できます ページを使用します ページを使用すると ホスティングによって ボタンをクリックします ポート メールサービス ユーザーが ユーザーがアクセスできるページやサンドボックスを変更した場合は ユーザーがログアウトして ユーザーが使用できないようにするサービスを選択して ユーザーが使用できるサービスは ユーザーが使用できるサービスを選択できます ユーザーが次にログインしたときに適用されます ユーザーによるアクセスを許可するサービスを選択して ユーザーにアクセスを許可する ユーザーにアクセスを許可するサンドボックスを選択します ユーザーにアクセスを許可するサービスを選択します ユーザーのパスワード ユーザーの編集 ユーザーの認証タイプはリセットできません ユーザーの追加 ユーザーを作成した後は ユーザーを追加 ユーザーサンドボックス ユーザーマネージャ ユーザーマネージャで ユーザーマネージャで定義されたユーザーとルートの管理ユーザーのみに ユーザーマネージャで定義されたユーザーのみに ユーザーマネージャページが編集モードで開きます ユーザーマネージャページで ユーザーマネージャページでユーザーを作成することに加えて ユーザーマネージャページの ユーザーマネージャーでは ユーザー列などにあるユーザー名をクリックするか ユーザー名とパスワードの両方を使用して ユーザー名とパスワードを指定して ユーザー設定の変更を有効にします ユーザー設定の編集 リストボックスにリストされます リソースセキュリティ ルート管理者のデフォルトユーザー名は ログイン中のユーザーのロールを管理者が取り消した場合 不明なアプリケーションやユーザーによるアクセスを防止できます 使用するユーザー 使用できる 信頼できるユーザーのみに限定してください 個 公開されているサービスにアクセスする権限があるクライアント 公開されているサービスをセキュリティで保護すると 公開されるサービスには次のものがあります 公開サービス 公開サービスのリセットを行えます 再びログインした後に変更が有効になります 初期段階に行うことをお勧めします 別のユーザー名とパスワードで認証する 同様に 変更の送信 子 拡張機能 指定したページの 文字の新しいシード値を指定します 既存のエンタープライズサービスが 既存のユーザー設定の編集について詳しくは 最大文字制限は 最小文字制限は 次のオプションを選択します 次の要素へのアクセスの管理に使用します 用 禁止されているサービス 管理アクセスを許可 管理者ユーザー 経由でのアクセスを許可するように設定したりすることもできます 編集モードでは 複数のユーザーに 親 親ディレクトリから継承したサンドボックス設定は上書きされます 許可されているサービス 詳しくは 説明 説明を入力します 連続した複数のサンドボックスまたはロールを選択するには 連続していない複数のサンドボックスまたはロールを選択するには 関数";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7ff4";
              top.sc1[13] = t;
              top.sc2[13] = p;
              top.sc3[13] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fc5() {
              var t="パッケージとデプロイ セクション";
              var p="1 12 2 4 a administrator and application applicationarchives archive archivename as car cf cfide cfm cfml cfmx cfx coldfusion com create deploy development ear enterprise hostname http index j2ee java mb mx ok overview packaging rds remote run services solr specific this unix url user war web およびその他のタイプの情報をアーカイブしてデプロイできるツールがあります およびオプションで が が含まれています この このアーカイブファイルには このシステムの既存のユーザー名とパスワードに完全に一致している必要があります このシステムアカウントの既存のユーザー名とパスワードと一致していない場合は このページを使用して作成します この機能により この機能は これは すべてのアーカイブおよびデプロイオペレーションに適用するさまざまなアーカイブシステム設定を行います すべてのデータソースを選択および削除できます そのユーザーでこのアーカイブプロセスを実行する ただし つのアプリケーションが つまり で では で指定した場所に保存されました という というコンテキストルートで という名前が使用されます と呼ばれる固有の どの になります に有効 の のすぐ後の部分 のアーカイブファイルのデプロイおよび受信をオンラインで実行できるようにします のサーバーを作成するために必要な のモジュールおよびディレクトリ の以前のインストールのシリアル番号を指定します の左側のナビゲーションペインで の最初の部分 の管理者が の設定 ほとんどの また または またはコンテキストパス または異なるコンピュータ上で実行されている をクリックして をクリックしてから をクリックして続行します をクリックします をコンテキストルートとして使用できるようになっています をサーバー構成で使用する場合にも を使用して を使用する場合 を参照してください を含めないと を含める を含めるかどうかを指定します を実行している場合は を表示します アップグレードの場合 アプリケーション アプリケーションが使用する アプリケーションが着信リクエストを処理しているかが判断されます アプリケーションでデバッグを無効にするかどうかを指定します アプリケーションと アプリケーションの アプリケーションのコンテキストルートをオプションで指定できます アプリケーションのルートは アプリケーションのルートディレクトリに格納された アプリケーションは必要ありません アプリケーションを アプリケーションをデプロイするために使用できるアーカイブをすばやく作成できます アプリケーションをデプロイできます アプリケーションサーバーでは アプリケーションサーバー上にデプロイします アプリケーションサーバー固有の方法でコンテキストルートが処理されます アプリケーションディレクトリ アプリケーション全体を含んだ アプレット アーカイブ アーカイブが正常に作成されて アーカイブするアーカイブ定義の名前を見つけて アーカイブに含めるデータソースの設定 アーカイブに含めるデータソースを指定します アーカイブのための必要事項リスト アーカイブのサイズが約 アーカイブの作成 アーカイブの概要 アーカイブの構築アイコンをクリックします アーカイブの要約情報を確認して アーカイブの設定 アーカイブは アーカイブは作成されませんでした アーカイブを作成します アーカイブを作成することは アーカイブを保存する場所の完全パスとアーカイブの名前を続けて指定します アーカイブを選択します アーカイブウィザードが表示されます アーカイブウィザードで アーカイブタイプ アーカイブタイプに応じて アーカイブファイルの位置の選択ページが表示されます アーカイブファイルの位置の選択ページで アーカイブページで アーカイブページにアクセスするには アーカイブ可能な情報の一覧は次のとおりです アーカイブ名 アーカイブ名には アーカイブ定義の名前を指定します アーカイブ操作が完了すると イベントゲートウェイインスタンス ウィザードページの エンタープライズ版の有効なシリアル番号を指定します オプション オプションを選択して オンラインヘルプを参照してください カスタムタグのパスなど クラスタ内の個 コレクション コンテキストルート コンテキストルートとして コンテキストルートは空になります コンテキストルートを指定する場合もあります サポートを含めないと サポートを含める サポートを実現するモジュールを含めるかどうかを指定します サーバー サーバーで実行されている各 サーバーの設定 サーバーインスタンスのクラスタを作成するには サーバー上に サーバー設定 シリアル番号 スケジュールされたタスク スラッシュ セクション セクションでは ソースを含める タグ テキストまたはコンパイル済みの テキストボックスに テキストボックスに入力し テキストボックスに入力します ディレクトリ構造 デバッグの無効化 デフォルトでは デプロイツールまたはサーバー固有の設定ファイルを使用して デプロイディレクトリ データソース データソースを選択および削除します データソース定義など データソース情報 バイトコードに変換するかを指定します パスワード パッケージとデプロイ ビルドに失敗しました ビルドに成功しました ファイルとは異なります ファイルについて詳しくは ファイルに付けられた名前でもあります ファイルのどちらが作成されるかを指定します ファイルの名前がデフォルトのコンテキストルートになります ファイルの場所を指定します ファイルまたは ファイルも作成できます ファイルを ファイルをすばやくバックアップするために ファイルをデプロイするには ファイルを作成してデプロイできます ファイルを作成する場合は ファイルを作成できます ファイルを使用するか ファイルを配置するディレクトリを指定します ファイル名 ページ ページでは ページには ページに表示される情報を確認し ページを マッピング マルチサーバー構成を使用している場合 ユーザーの場合のみ ユーザー名 ユーザー名とパスワードが ユーザー名とパスワードは ランタイムシステムを含んだ ルートの下に含まれる ワンクリックで 一度情報をアーカイブすると 一部のアプリケーションサーバーでは 二重矢印ボタンを使用すれば 以前のシリアル番号 任意のシステムアカウント名を 例えば 元の 台のサーバーインスタンスで実行できるので 右向きおよび左向きの矢印ボタンを使用して 各サーバーインスタンスで 同じ 名前およびファイルの場所 問題の原因をさらに分析します 問題の原因を特定するには 定義をアーカイブするには 対応するアカウントパスワードを 小さくなります 手順 拡張子を付ける必要があります 既存の 構成で使用する場合にも可能です 構成で動作している必要があります 構築操作が失敗します 次のいずれかのアーカイブメッセージが表示されます 次のようにします 次の項目を含んだ 次へ 特権ユーザーとしてこのアーカイブを実行する必要がある場合は 環境では 環境設定 管理者が使用して 複数の独立した 詳しくは 詳細 詳細については 説明 閉じる";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fc5";
              top.sc1[14] = t;
              top.sc2[14] = p;
              top.sc3[14] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fc2() {
              var t="エンタープライズマネージャ セクション";
              var p="0 10 100 228 3000 4 4003 45564 45565 500 5000 6 8 address administrator apache auto autobind catalina cf cfusion channel channelsendoptions classname cluster clusterlistener clustersessionlistener coldfusion conf config deltamanager dir droptime ear engine expiresessionsonshutdown false filter frequency group groupchannel ha host http install instance interceptor interceptors ip j2ee jvm jvmroutebindervalve jvmroutesessionidbinderlistener manager maxthreads mcastservice membership messagedispatch15interceptor mx name nio nioreceiver notifylistenersonreplication org pooledparallelsender port receiver replicationtransmitter replicationvalve runtime selectortimeout sender server session simpletcpcluster tcp tcpfailuredetector tomcat transport tribes true valve war web xml およびセッションレプリケーションを有効にする前にネットワークのトラフィックが増加しているかどうかを検討してください からの作成 こうすると このページからアクセスできます この名前をクリックして これをクラスタ内のサーバーごとに行います すべてのインスタンスを再起動します そのインスタンスに必ずマッピングされるようになります そのクライアントからのそれ以降のすべてのリクエストが ただし で です でのクラスタ設定について詳しくは ではサーバーが含まれているクラスタの名前を指定します にクラスタブロックを追加します の のクラスタの編集ページでは のクラスタマネージャページでは のコピーをデプロイします は をクリックして をクリックします を使用した を使用して を使用してクラスタを管理します を参照してください アクション アドレスを指定します アプリケーション アプリケーションがセッションレプリケーションを使用している場合 アプリケーションのコピーをそのサーバーに自動的にデプロイします アプリケーションのビジネス要件でセッションレプリケーションが必要かどうか アプリケーションを含んだ個 アーカイブページを使用してパッケージ化されたアプリケーションのデプロイはサポートしません インスタンスにセッションが確立された後 インスタンスをクラスタに追加します インスタンスマネージャ インスタンスマネージャページでは インスタンスマネージャーに定義する際に動作している必要はありません インスタンスマネージャーは エンタープライズマネージャ エンタープライズマネージャーは エンタープライズ版およびデベロッパー版でのみ表示されます エントリと エントリの間に次のブロックを追加します エントリ内のメンバーシップポートをクラスタのマルチキャストポートで更新します オプションを使用して オプションを有効にします クラスタ クラスタが作成されて クラスタにサーバーを追加します クラスタにリモートインスタンスを追加するには クラスタに参加しているすべてのインスタンスが クラスタに追加するために クラスタに追加する際には動作している必要があります クラスタのサーバーインスタンスを定義して クラスタの管理 クラスタの編集ページ クラスタの編集ページが表示されます クラスタへのリモートインスタンスの追加 クラスタを作成すると クラスタを追加します クラスタマネージャ クラスタマネージャをクリックします クラスタメンバーをグループ化するために使用されます クラスタ名 クラスタ名をクリックして クラスタ名を入力して クラスタ設定をカスタマイズできます サーバーからアクセスできる サーバーから構成されるクラスタを作成および管理できます サーバーが開始している場合は サーバーの サーバーのポートを指定します サーバーの編集 サーバーをインスタンスマネージャーに対して定義します サーバーを作成し サーバーを定義したり サーバーを登録したりできるページに サーバーを表示できます サーバーを開始 サーバーインスタンスのクラスタの作成を行えます サーバーインスタンスのビルトイン サーバーインスタンスのホスト名または サーバーインスタンスのリモートポートです サーバーインスタンスの作成 サーバーインスタンスの登録 サーバーインスタンスは サーバーディレクトリ サーバーディレクトリを指定します サーバー名を指定します サーバー設定を変更します スティッキーセッションおよびセッションレプリケーションオプションを利用するには スティッキーセッションが必要かどうかを指定します スティッキーセッションでは スティッキーセッションは必要ありません スティッキーセッションを有効にする場合は セクション セクションでは セッションを使用する必要があります セッションを有効にするには セッションレプリケーションが有効になっていると セッション変数が変化するたびに セッション変数の代わりにクライアント変数の使用を検討してください セッション変数の使用 セッション変数の情報をクラスタ内のすべてのサーバーに反映します テーブルに追加されます テーブルのクラス名の横の編集アイコンをクリックして デフォルトでは デプロイ済みの データソース ビルトイン ファイルにポートが追加されます ファイルを開きます ページ ホスト ボックスに名前を入力し ポート マルチキャストポートについて詳しくは マルチキャストポートのデフォルト値は マルチキャストポートは マルチキャストポートを編集します メモリ変数ページで リモート リモートインスタンスとローカルインスタンスの リモートインスタンスの リモートインスタンスの登録 リモートインスタンスをローカルマシンに登録します リモートインスタンスを登録して リモートコンピューター上で動作する既存の リモートポート ルートをブラウザーウィンドウで開けます ルートを同じにしないでください ローカルおよびリモートの ローカルインスタンスとリモートインスタンスをクラスタに追加します ローカルホストの ローカルマシンでクラスタを作成します 以前にアーカイブされたアプリケーションからサーバーを作成することもできます 使用可能なサーバー 停止 再起動および削除できます 動作中の 同じ 名前 対象のリモート 必要に応じて 新規インスタンスの追加 新規ローカル 既存のリモート 次に 次のようにして 現在の 管理者パスワードなど 要件に基づいてサーバーをクラスタに移動します 設定 設定済みクラスタ 説明 追加 送信 通常 領域";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fc2";
              top.sc1[15] = t;
              top.sc2[15] = p;
              top.sc3[15] = n;
          }
  
          function fWSe61e35da8d318518_33adffe0134c60cd31c_8000() {
              var t="サーバー更新 セクション";
              var p="10 administrator coldfusion には の新しいセクションが用意されています サーバー更新 セクション ブラウザーインターフェイス自身で製品アップデートを検証して適用できるようにする";
              var n="WSe61e35da8d318518-33adffe0134c60cd31c-8000";
              top.sc1[16] = t;
              top.sc2[16] = p;
              top.sc3[16] = n;
          }
  
          function fWSe61e35da8d318518_33adffe0134c60cd31c_7fff() {
              var t="更新ページ";
              var p="0 0400 09 1 10 11 19 2 2011 20f33dd56597b68c3634be08116bc84a 8 8500 address administrator category cdata cf cfhf channel checksum chronology coldfusion cumulative description downloadlink encoding fields file filename fix for hf home hot hotfix html http id indicating input install060811 installer installinput integer ip item j2ee jar link localhost name oct optional port pubdate rss rsst server servers technote technotelink title to tue type update updatelevel updates upload url utf version xml からログインしているインスタンスに対するアップデートのリストが表示されます このオプションは これを行うには しかし そのインスタンスのみにホットフィックスが適用されます そのサイトの にファイルをダウンロードして置いておきます に値を設定して の のすべてのアップデートがリストされれます のように設定します のインストールには適用できません のホットフィックスおよびセキュリティホットフィックスが含まれる場合があります のメインインスタンスは自動的に停止します の例を次に示します また をクリックして をクリックすると を使用して を参照してください を指定してアップデートを取得することもできます を更新します アップデートには アップデートの前に アップデートの環境設定を指定するオプションが用意されています アップデートを確認 アップデートを通知するかどうかやアップデートを自動的に確認するかどうかなど アップデートを適用する アンインストール インストールされているホットフィックスを削除できます インストール可能なアップデートがあるかどうかが表示されます インストール済みの インストール済みアップデート オプションを使用すれば サイト サイトを更新 サイレントインストールを実行します サーバー更新 ダウンロード ダウンロードとインストール デフォルトでは ホットフィックスをインストールするサーバーを選択する必要があります ホットフィックスをダウンロードして ホットフィックスを適用するすべてのローカルインスタンスを選択することもできます マルチサーバーインストールの場合は マルチサーバー設定の場合 メインインスタンスからアップデートを適用する際に メインインスタンスからホットフィックスを適用するか メインインスタンスのみにアップデートが適用されます ローカルアップデートサイトを設定した場合は 他のすべてのインスタンスは手動で停止する必要があります 他のインスタンスには 使用可能なアップデート 例えば 各インスタンスから個別に適用する必要があります 変更の送信 後でインストールするために 必要な場合に 新規作成したローカルインスタンスからアップデートを適用する場合は 更新 更新ページ 更新ページには 次のいずれかを行えます 次のオプションがあります 次のサンプルを参照 次の場合は 環境設定を有効にします 製品アップデートがあるかどうかを確認します 設定 設定を指定した後 詳しくは";
              var n="WSe61e35da8d318518-33adffe0134c60cd31c-7fff";
              top.sc1[17] = t;
              top.sc2[17] = p;
              top.sc3[17] = n;
          }
  
          function fWSe61e35da8d318518_33adffe0134c60cd31c_7ffe() {
              var t="後でインストールするためのホットフィックスのダウンロード";
              var p="administrator any application applies cf cfusion cfusion1 coldfusion contains ddonot deployment dinstall dir directory doc donot ear f file files folder following for gui hf home i inf install installer instance j2ee jar java jre linux list mac meta multi name on only osx outside path post properties root scenarios server servers silent solaris specify start system that the to true ui unix updates user war which windows wwwroot xml your から新しいインスタンスを作成すると がシステムパスに入っていることを確認するか こうすると このようにすると でもサイレントモードでもインストールできます というコマンドを実行します というプロパティをプロパティファイルに追加します という引数を実行します に直接アクセスします のインストールディレクトリから の場合 まず をデプロイする場合 を手動で更新します インストールの場合 コマンドプロンプトが表示されたら コンソールに手順が表示されます コンソールの手順に従います コンソールモードおよび コンソールモードでもサイレントモードでもインストールできます コンソールモードのいずれでもインストールできます コンソールモードの場合 サイレントインストールの場合 サイレントモード サイレントモードでインストールされます サイレントモードの場合 サーバーを再起動しない場合は スタンドアローンインストールの場合 デフォルトでは デフォルトのインスタンスに適用されるホットフィックスが プラットフォーム プロパティファイルの例を次に示します ホットフィックスを適用した後にサーバーが再起動します ホットフィックスインストーラーが起動されます ホットフィックスインストーラーが起動します モードの場合 以外のホットフィックスファイルをシステムにインストールしてから 作成した新しいインスタンスに自動的に適用されます 展開された 展開されていない 後でインストールするためのホットフィックスのダウンロード 次のようにします 次の場所からダウンロードファイルにアクセスします 画面の手順に従います 説明 追加で次のコマンドを指定します";
              var n="WSe61e35da8d318518-33adffe0134c60cd31c-7ffe";
              top.sc1[18] = t;
              top.sc2[18] = p;
              top.sc3[18] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3638e6_7fbf() {
              var t="カスタム拡張機能 セクション";
              var p="1 a administrator blank body bowdoin br cfide cfm coldfusion college complutense content custommenu de edu es extensionscustom head href html http it la madrid sapienza target ucm uniroma1 universidad web www wwwroot xml および このファイルを これらのリンクは その他の値を たとえば つのリンクを記述します という名前で と指定すると に保存します のメインペインにページが表示されます の左側のナビゲーションペインにある の拡張 の機能は へのリンクを追加します また を付加し を拡張するには アプリケーションおよびサイトへのリンクを追加することによって拡張できます カスタム拡張機能 コードは含めないでください セクション セクションに表示されます タグなど他の タグや ファイルを編集する方法もあります ページは別のウィンドウに表示されます リンクをクリックすると リンクコードを含むファイルを作成します リンク先のページが表示されます ルートディレクトリ 他の 各リンクの後には 属性に指定すると 属性は各リンクごとに必須です 次のファイルでは 行ごとに";
              var n="WSc3ff6d0ea77859461172e0811cbf3638e6-7fbf";
              top.sc1[19] = t;
              top.sc2[19] = p;
              top.sc3[19] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fcf() {
              var t="administrator api";
              var p="1 1433 2 23 29 299 6 64000 8500 999 a accessmanager admin adminapi administrator adminobj advanced alter always and api application argumentcollection arguments base blob buffer cfc cfdump cfide cfm cfoutput cfscript cfx clob code coldfusion component corba create createobject data database datasource debugging delete description disable driver drop dsn dump enable enabledebug enablemaxconnections eventgateway example explorer extensions false for get grant host http instantiate interval is line lines localhost login mail maxconnections maxpooledstatements mssql mssqlserver myobj name northwind object of office openoffice optional optionally password pooling port propertyname propertyvalue rds required revoke runtime sa security select server serverinstance servermonitoring set setdebugproperty setmsql setmssql setstringparameterasunicode single source sql stdsn storedproc structnew structure the this timeout tomcat true two update username uses var web x xx xxx および およびサンドボックスセキュリティを管理します およびセットアップウィザード およびマニュアルを参照するには および再起動します および削除します および許可されたロールを指定します が含まれます この この例では すべてに対する基本オブジェクトです すべてのメソッド引数を その他の設定項目に関するランタイムの設定を管理します たとえば つのサブディレクトリも含まれています つの構造体として渡しています つの領域に対応しています では ではメソッド引数を使用します にアクセスします に含まれるメソッドのスタイルは次のとおりです の のほとんどのタスクは のインスタンス化と のセットで構成されています のデバッグ設定など のデータソースを追加できます のメソッド のユーザーのユーザー名 の他のメソッドを呼び出すときは の使用 の基本的な機能 の設定を管理します は または をインスタンス化します を使用してください を使用することでプログラムから実行できます を使用するには を参照するには アクセス権 アプレット イベントゲートウェイを管理します カスタムタグ キャッシュ コンポーネント サンドボックス サンドボックスセキュリティを使用している場合 サーバーを起動 サーバー設定を使用している場合に サービスを管理します タスクを実行するために呼び出すことが可能なメソッドを含んだ チャート ディレクトリにあります ディレクトリには ディレクトリへのアクセスを有効にします デバッグの設定を管理します デバッグを有効にしています デベロッパー版とエンタープライズ版に対してのみ動作します データソースを追加 データソースを追加します データソースを追加しますが パスワード パスワードの後にユーザー名を指定します パスワードまたは パスワードを渡します ファイルと フォント ブラウザを開いて プログラムによってサーバーモニタの多数のタスクを実行します プロパティメソッドを使用します マッピング メソッドの呼び出しを メソッドを使用すれば メソッドを呼び出します メソッドを呼び出す必要があります メソッドを呼び出す際には メソッド引数 メール設定を管理します ルートディレクトリ ログアウト ログイン 他の 使用する 例 個 停止 先に 単純な値の設定と取得 単純な値を設定する場合 変更 属性を使用し 次のように 次のようにして 次のようにログインできます 次の例では 次の例でも同じ 次の表に示すように 正しい権限があれば 目的の 移行ウィザード 管理者以外のユーザーとして 行のコードで実行することもできます 複雑な値や変化する値を設定する場合 設定 説明";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fcf";
              top.sc1[20] = t;
              top.sc2[20] = p;
              top.sc3[20] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7ffa() {
              var t="データソース管理";
              var p="administrator adobe coldfusion jdbc で では は をクリックして を通じてデータソースと通信できるようになります を選択します データソースおよびデータベース接続についての基本的な情報を参照するには データソースは データソースを設定すると データソース管理 ドライバを使用して特定のデータベースと通信する詳細なデータベース設定です ファーストステップ 使用するデータベースごとにデータソースを設定します 情報源";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7ffa";
              top.sc1[21] = t;
              top.sc2[21] = p;
              top.sc3[21] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3639b1_7ffd() {
              var t="jdbc について";
              var p="1 2 3 390 4 access administrator all and apache api cfusion client coldfusion database db2 dbms derby directory drivers embedded inf informix interface j2ee jar java jdbc jndi lib microsoft mysql naming native net odbc oracle os partly protocol pure server socket sql sybase type unicode universal web がサポートされません このタイプのドライバを使用することはお勧めしません これらのプロトコルはメーカー独自のものが多く さまざまなデータベース管理システム そのドライバを そのリクエストをデータベース固有のネイティブコネクティビティインターフェイスに変換します その他 その他の ただし たとえば つのタイプの です でサポートされるデータベースのバージョンについては で設定できます との通信を可能にするための仕組みです と同じコンピュータに置く必要があります について には に同梱されている に同梱されているデータベースドライバと に固有の機能を必要とする場合以外は に配置します のようなアプリケーションでデータベースやプラットフォームに固有のインターフェイスを使用することなく のドライバより のルートディレクトリ は または を参照してください を実行するコンピュータに特別なソフトウェアをインストールする必要がありません アプリケーションから使用できます アプリケーションで特定の アプリケーションのルートディレクトリ アプリケーションサーバーを使用して定義する必要がある点が異なります アプリケーションプログラミングインターフェイス クライアントデータベースライブラリが存在していることが条件になります クラスパス内に格納する必要があります サーバーコンピュータに サーバー設定 スタンダード版では一部の ステートメントを実行するときに使用する タイプ データソースで使用する データソースと同等ですが データソースに接続するデータソースも データソースの定義の詳細については データソースは データベースおよび データベースが直接使用するネットワークプロトコルに変換します データベースごとに異なるドライバが必要です データベースで使用する データベース固有のコードは中間層で実行する必要があります ドライバ ドライバがインストールされていることと ドライバが含まれています ドライバについて説明します ドライバに送信します ドライバは ドライバを使用する場合は ドライバタイプと比べると低下します パフォーマンスが優れています パフォーマンスが高速です パフォーマンスは他の ファイルに含まれています ファイルに格納されています ブリッジ ベンダのクライアントデータベースライブラリを ベンダのデータベースライブラリをクライアントコンピュータに置く必要がありません マルチサーバー設定または ロードが高速になります 他のデータソースと同様に 利点 同梱されているドライバ 名前 呼び出しに変換し 呼び出しを 呼び出しをデータベース固有の呼び出しに変換します 呼び出しを中間層サーバーに変換し 場合によっては 多くの 定義した後は 小さなサイズにすることも可能です 欠点 次の表で 次の表に 用の 異なる多くのデータベースへのアクセスが可能です 設定 設定で実行する場合は 詳細情報 詳細情報の参照先を示します 説明";
              var n="WSc3ff6d0ea77859461172e0811cbf3639b1-7ffd";
              top.sc1[22] = t;
              top.sc2[22] = p;
              top.sc3[22] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3639b1_7ffc() {
              var t="データソースの追加";
              var p="1 2 administrator bullwinkle cfml cfquery coldfusion comp connectstring dsn ip jdbc jms microsoft mytestdsn northwind provider server service sql url validationquery およびアンダースコア文字 から使用できるすべてのデータソースのステータスを確認するには がデータソースに接続できることを確認してください このエラーは このフォームで使用できるフィールドは この問題を回避するには これらをデータソース名として使用することはできません すべての接続の確認 そのデータソースが それらのデータソースは次の手順を実行しなくても操作できます たとえば つの場所に整理されます で でのデータソースの追加 では で大文字と小文字が区別される場合があります と通信できるようにデータソースを設定する必要があります どの など などのデータソース名を入力します にその名前を指定してデータソースにアクセスできるようになります には にデータソースを追加すると にデータソースを追加する際には に指示されます のみを使用することができます はデータソースに接続できるかどうかを自動的に確認します はパフォーマンス上の問題を引き起こす可能性があるので また またはセキュリティ許可における変更など をクリックして をクリックします を使用して を使用します を入力します を指定し を指定します を選択します アクション アドレスを入力し アプリケーションで使用するデータソースをすばやく追加するには アプリケーションページ上でデータソースを使用してデータを取得するには オプション キャッシュ済みの接続を使用してクエリーが実行され クエリーの実行時にどのデータベースに接続し クエリーを実行する前に クエリーを実行する前に接続を検証します コマンドを使用してこのデータソースを操作できるかを設定できます サーバー サーバーのデータベース接続に関するすべての情報が タグ デフォルトで設定済みのデータソースが付属しています デフォルトのポートに接続されたサーバー データとサービス データソース データソースが確認できない原因になります データソースにより データソースにデータソース名 データソースに対する接続文字列引数を指定できます データソースに関するガイドライン データソースの追加 データソースを作成します データソースを使用するには データソースを追加するとともに データソースを追加するには データソース名には データソース名に特殊文字またはスペースを使用しないでください データソース名の大文字と小文字は区別されませんが データソース名はすべて データベース データベースにログイン情報が必要な場合は データベースへの変更を指定することができます データベースをホスティングしているサーバーのネットワーク名または データベースを再起動した後にクエリーを実行すると データベース名 データベース接続を確立する ドライバによっては ドロップダウンリストからドライバを選択します ハイフン フィールドに フィールドには ページで ページの ユーザー名とパスワードを入力します 使用するデータベースドライバのドキュメントを参照してください 使用する場合は十分な注意が必要です 例外が返されることによって発生します 内に存在している必要があります 再配置 列の確認アイコンをクリックします 名前と値のペアをセミコロンで区切って入力します 名前変更 回目以降のリクエストでは発生しません 大文字の使い方は統一してください 属性のサポートは廃止されました 後でこのデータソースを確認するには 必要なポート値を入力します 必要なユーザー名とパスワード情報を省略すると 情報のフォームが表示されます 接続にどのパラメータを使用するかが 接続の問題 接続の確立に必要なすべての情報を設定します 接続を検証するには 接続プーリングが無効になっている場合も発生しません 接続文字列 接続文字列および 接続文字列の引数の指定 数字 文字 新規のデータソースの追加 最初のリクエストの際に 最初のリクエストの際にエラーが発生する場合があります 次に示す名前は予約されています 次のガイドラインに従ってください 特有の設定を指定します 詳細については 詳細設定 詳細設定の表示 語で指定する必要があります 説明を入力します 追加 追加の 送信 選択したドライバによって異なります";
              var n="WSc3ff6d0ea77859461172e0811cbf3639b1-7ffc";
              top.sc1[23] = t;
              top.sc2[23] = p;
              top.sc3[23] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fdb() {
              var t="apache derby client への接続";
              var p="1 2 32k 64000 7 apache blob cf cfquery chr client clob coldfusion create derby dsn image jdbc local mx package sql text udb および が がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このタイプのデータソースを設定する際は このデータソースのデータベース内にあるすべての この制限を使用するには この場合 この接続の説明です これを選択していない場合は これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です ではサポートされていません でデータソースのデータベース接続数を制限するかどうかを指定します で指定した文字数のデータが取得されます によって廃棄されるまでの時間を分単位で指定します に制限されます に接続する際には の場合 は への接続 を を丸括弧で囲んでください アプリケーションが オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリーの応答時間が長くなることがあります サーバー タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルにある場合は データベースの再起動後には検証クエリーを削除してください データベースの名前です データベースを再起動する直前に検証クエリーを指定する必要がありますが データベース管理者がパッケージを作成する必要があります データベース管理者に相談してください ドライバに渡すパスワードです ドライバに渡すユーザー名です バイト バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ユーザー名 ユーザー名にはデータベースに対する ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 分 列の内容全体が返されます 制限数 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 検証クエリー 権限がない場合は 権限が必要です 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 長いテキストのバッファー";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fdb";
              top.sc1[24] = t;
              top.sc2[24] = p;
              top.sc3[24] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fda() {
              var t="apache derby embedded への接続";
              var p="1 2 32k 64000 7 administrator apache blob cf cfquery cfqueryparam cfstoredproc chr clob coldfusion derby dsn embedded image mx sql text udb および がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションをオンにします このオプションを有効にすると このデータソースのデータベース内にあるすべての この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これを選択していない場合は これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です ではサポートされていません でデータソースのデータベース接続数を制限するかどうかを指定します で指定したパスに作成されます で指定した文字数のデータが取得されます によって廃棄されるまでの時間を分単位で指定します に制限されます に接続する際には の再利用を有効にするには の場合 の警告が生成され は へのログインに使用するパスワードです へのログインに使用するユーザー名です への接続 を を使用する固有の オプション オプションがオフの場合に使用されます オペレーションです クエリーの応答時間が長くなることがあります タイムアウト タイムアウトになるまでの秒数です タグ タグを使用するストアドプロシージャおよびクエリー デフォルトのバッファーサイズで デフォルト値は データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソースを追加するときは データソース名 データベースが存在する場合は データベースが置かれているフォルダです データベースの作成 データベースの再起動後には検証クエリーを削除してください データベースを作成するには データベースを再起動する直前に検証クエリーを指定する必要がありますが データベースフォルダ バイト バイトです バッファー パスワード パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プリペアードステートメント プールからの接続が再利用される際に呼び出されます プールされるステートメントの最大数 ユーザー名 ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用可能な 分 列の内容全体が返されます 制限数 固有の 当初は次の値の合計値を設定してください 指定したディレクトリが存在していないことを確認してください 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 新規データベースは 既存のデータベースへの接続が確立されます 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 長いテキストのバッファー";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fda";
              top.sc1[25] = t;
              top.sc2[25] = p;
              top.sc3[25] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fdd() {
              var t="db2 universal database への接続";
              var p="1 2 32k 390 64000 7 application blob cf cfc cflogin cfquery cfqueryparam cfstoredproc chr clob coldfusion create database db2 dsn image ip iseries jdbc linux local mx os package s390 sql tcp text udb universal unix windows および が がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このタイプのデータソースを設定する際は このデータソースのデータベース内にあるすべての この制限を使用するには この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これを選択していない場合は これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です ではサポートされていません でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します で使用するデータソースの定義に関する情報については で指定されているアプリケーション名です で指定されているアプリケーション名の前に付加されます で指定した文字数のデータが取得されます とは によって廃棄されるまでの時間を分単位で指定します に制限されます に接続する際には のすべてのバージョンを意味します のバージョンについては の再使用を有効にします の場合 は への接続 を を丸括弧で囲んでください を使用する固有の を参照してください アプリケーションが アプリケーション名 オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリが実行されるホスト名です クエリーの応答時間が長くなることがあります クライアントホスト名 クライアントユーザー名 サーバー サーバーが実行する間隔 サーバーが接続を監視する タイムアウト タイムアウトになるまでの秒数です タグ タグなどで タグを使用してログインしている場合のユーザー名です タグを使用するストアドプロシージャとクエリー デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルにある場合は データベースの再起動後には検証クエリーを削除してください データベースの名前です データベースを再起動する直前に検証クエリーを指定する必要がありますが データベース管理者がパッケージを作成する必要があります データベース管理者に相談してください ドライバに渡すパスワードです ドライバに渡すユーザー名です バイト バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プラットフォームで動作する プリペアードステートメント プールからの接続が再利用される際に呼び出されます プールされるステートメントの最大数 ポート ポートの番号です ユーザーが ユーザー名 ユーザー名にはデータベースに対する ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 値は 分 列の内容全体が返されます 制限数 固有の 当初は次の値の合計値を設定してください 指定した場合 接続の検証を有効にする 接続の無効化 接続の維持 接続を検証する場合は選択します 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 接頭辞 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 権限がない場合は 権限が必要です 次の表の設定値を使用します 版 版または 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 長いテキストのバッファー 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fdd";
              top.sc1[26] = t;
              top.sc2[26] = p;
              top.sc3[26] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe8() {
              var t="informix への接続";
              var p="64000 application blob cf cfc cflogin cfquery cfqueryparam cfstoredproc clob coldfusion dsn image informix ip jdbc local mx sql tcp text が がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての このデータソースの接続先のデータベースです この制限を使用するには この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します で指定されているアプリケーション名です で指定されているアプリケーション名の前に付加されます によって廃棄されるまでの時間を分単位で指定します により のバージョンについては の再使用を有効にします の設定で指定された文字数のデータが取得されます への接続 を を丸括弧で囲んでください を使用する固有の を参照してください アプリケーションが アプリケーション名 オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリが実行されるホスト名です クエリーの応答時間が長くなることがあります クライアントホスト名 クライアントユーザー名 サーバー サーバーが実行する間隔 サーバーが接続を監視する タイムアウト タイムアウトになるまでの秒数です タグ タグなどで タグを使用してログインしている場合のユーザー名です タグを使用するストアドプロシージャとクエリー デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルにある場合は データベースの再起動後には検証クエリーを削除してください データベースの名前です データベースをホストするサーバーの名前です データベースを再起動する直前に検証クエリーを設定する必要がありますが ドライバに渡すパスワードです ドライバに渡すユーザー名です バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プリペアードステートメント プールからの接続が再利用される際に呼び出されます プールされるステートメントの最大数 ポート ポートの番号です ユーザーが ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用可能な 値は 分 列の内容全体が返されます 制限数 固有の 当初は次の値の合計値を設定してください 指定した場合 接続する 接続の検証を有効にする 接続の無効化 接続の維持 接続を検証する場合は選択します 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 接頭辞 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe8";
              top.sc1[27] = t;
              top.sc2[27] = p;
              top.sc3[27] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe7() {
              var t="microsoft access への接続";
              var p="2048 256 600 64000 access blob cf cfquery clob coldfusion createodbcdatetime date dateformat dsn image jdbc kb mdb mdw microsoft mx sql string system system32 text time timeformat timestamp windows が がディスクとの間でデータ転送に使用する内部バッファーのサイズ がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての このドライバを使用すると過大なネットワーク通信が発生する場合は この制限を使用するには この場合 この接続の説明です この設定を有効にしてください これを選択していない場合は これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには それからそれを です でデータソースのデータベース接続数を制限するかどうかを指定します で割り切れる整数値を指定します で指定した文字数のデータが取得されます によって廃棄されるまでの時間を分単位で指定します により に戻す のような関数を使用する の設定で指定された文字数のデータが取得されます はユーザー名またはパスワードを渡しません への接続 を をクリックしてデータベースのセキュリティ情報を含んでいるデータベースを指定します を適用せずに アプリケーションが オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリーの応答時間が長くなることがあります サーバーが実行する間隔 サーバーのブラウズ システムデータベースは システムデータベースファイル ステートメント内で再使用する場合は タイムアウト タイムアウトになるまでの秒数です タグなどで ディレクトリに置かれています デフォルトでは デフォルトのバッファーサイズで デフォルトのバッファーサイズは デフォルトのパスワード デフォルトのユーザー名 デフォルトのユーザー名とパスワードが使用されます デフォルトのユーザー名を使用 デフォルト値は データを取得し データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベースの再起動後には検証クエリーを削除してください データベースを再起動する直前に検証クエリーを指定する必要がありますが データベースを含むファイルです データベースファイル ドライバでは ドライバに渡すパスワードです ドライバに渡すユーザー名です バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため ファイルと同じディレクトリか フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ページタイムアウト ページタイムアウト値を増やしてください ミリ秒単位 ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用可能な 分 列の内容全体が返されます 制限数 単位 形式設定 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続リクエスト時に 接続数の制限 接続文字列 最大バッファーサイズ 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 未使用のページがバッファーに維持される時間 検証クエリー 次の表の設定値を使用します 特定のデータベースファイルへのアクセスを保護するには 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe7";
              top.sc1[28] = t;
              top.sc2[28] = p;
              top.sc3[28] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe6() {
              var t="microsoft access unicode への接続";
              var p="0 1 2 256 64000 access blob cf cfquery clob coldfusion dsn image jdbc jet kb last microsoft mx sql text type unicode が がディスクとの間でデータ転送に使用する内部バッファーのサイズ がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての このドライバでは この制限を使用するには この場合 この接続の説明です これは これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です でデータソースのデータベース接続数を制限するかどうかを指定します で割り切れる任意の整数値を指定できます によって廃棄されるまでの時間を分単位で指定します により の予約語リストを使用します の設定で指定された文字数のデータが取得されます への接続 を を参照してください を含む を指定します アプリケーションが オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリーの応答時間が長くなることがあります サーバーが実行する間隔 タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベースの再起動後には検証クエリーを削除してください データベースを再起動する直前に検証クエリーを指定する必要がありますが データベースを含むファイルです データベースファイル ドライバです ドライバに渡すパスワードです ドライバに渡すユーザー名です バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ページがタイムアウトになるまでの時間 ページタイムアウト ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用可能な 分 列の内容全体が返されます 制限数 単位 完全なリストについては 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 最大バッファーサイズ 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 秒単位 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe6";
              top.sc1[29] = t;
              top.sc2[29] = p;
              top.sc3[29] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe5() {
              var t="microsoft sql server への接続";
              var p="0 1 127 1433 64000 administrator application authentication blob cf cfc cflogin cfquery cfqueryparam cfstoredproc character clob coldfusion connection dbms domain dsn enterprise image ip jdbc local login logins manager microsoft msde mx national nchar new northwind ok properties refused security server servername sql tcp text unicode windows および が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にします このオプションを有効にすると このデータソースのデータベース内にあるすべての このデータソースの接続先のデータベースです この例外を回避するには この制限を使用するには この問題は この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これは これを修正するには これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには そのデータソースに対して つのオープンな つの接続で複数のオープンな で です でのデータベースの設定 でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します でデータベースを設定します で指定されているアプリケーション名です で指定されているアプリケーション名の前に付加されます で混合認証モード で認証情報を指定した場合 というサンプルデータベースが付属していました とそれぞれ入力します との接続をうまく確立できない場合は と入力し と同じコンピュータ上で動作している場合に発生することがあります には によって廃棄されるまでの時間を分単位で指定します により に接続する際には の のような のサービスを再起動します のバージョンについては の上限値よりも低い数値を設定します の使用方法を学ぶことができます の再使用を有効にします の名前を右クリックし の設定で指定された文字数のデータが取得されます の設定を選択します への接続 または またはデータベースサーバーの を をインストールした場合は をクリックします をローカルで実行している場合 を丸括弧で囲んでください を使用して を使用している場合 を使用する固有の を使用する場合 を参照しているすべての箇所で使用する必要があります を参照してください を右クリックします を指定します を選択して を選択します を開きます アドレス アプリケーションが アプリケーションでは一般的なメソッドです アプリケーションでは一般的なメソッドではありません アプリケーション名 エラーは次のような状況で発生する可能性があります オプション オプションがオフの場合に使用されます オプションと オプションを必ずクリックしてください オプションを有効にします オプションを設定し オペレーションです カーソルメソッドでは クエリが実行されるホスト名です クエリーに使用するかどうかを決定します クエリーの応答時間が長くなることがあります クライアントホスト名 クライアントユーザー名 サンプルデータベースの設定 サーバー サーバーが実行する間隔 サーバーが接続を監視する サーバーを右クリックし サーバーを展開します サーバーカーソルを サーバーグループを展開します サーバー名には実際のインスタンス名でなく ステートメントに制限する場合は ステートメントを使用できます セクションから セクションに移動します タイムアウト タイムアウトになるまでの秒数です タグ タグなどで タグを使用してログインしている場合のユーザー名です タグを使用するストアドプロシージャとクエリー タブをクリックします タブを選択します デフォルトのバッファーサイズで デフォルト以外のサーバー名で デフォルト値は データとサービス データを使用する場合は データソース データソースからユーザー名とパスワードを削除することを検討してください データソースではユーザー名とパスワードを指定しないでおくことが必要です データソースに接続するために データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソースを保存します データソースを確認します データソース名 データソース定義の際は データベース データベースがローカルにある場合は データベースに対して接続を確立するには データベースの再起動後には検証クエリーを削除してください データベースへの接続を確立することにより データベースを再起動する直前に検証クエリーを設定する必要がありますが データベースを選択し データベースサーバーで混合認証を使用していることを確認します データ型の ドライバ ドライバに渡すパスワードです ドライバに渡すユーザー名です ドロップダウンリストで ネットワークの設定 バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドに フィールドを使用して最大数を指定できます フォルダの下で プリペアードステートメント プロトコルが有効になっていない可能性があります プロパティ プールからの接続が再利用される際に呼び出されます プールされたステートメントを使用しない限り プールされるステートメントの最大数 ページで ポート ポートの番号です メソッドの選択 ユーザーが ユーザー名 ユーザー名とパスワードを指定しないでください ユーザー名を渡さない場合に リクエストが ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 一度に 以前のバージョンの 使い慣れたデータベースを使用して 使用していない接続が 使用する 使用するデータベースをホストするサーバーの名前です 使用可能な 値は 全般 分 列の内容全体が返されます 制限数 効率的にデータを取得できます 固有の 当初は次の値の合計値を設定してください 指定した場合 接続できない場合は 接続のトラブルシューティング 接続の検証を有効にする 接続の無効化 接続の維持 接続を 接続を検証する場合は選択します 接続を要求するオペレーションが実行されるたびに確立されます 接続数に制限があるバージョンの 接続数の制限 接続数の制限を超過した可能性があります 接続文字列 接頭辞 文字列形式 有効になっているプロトコル 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次に 次の手順を実行します 次の点を再確認してください 次の表の設定値を使用します 無効になっているプロトコル 特有の 現在のデータソースを操作可能な 直接メソッドでは 秒 言語を選択します 設定 詳細設定 説明 追加 追加のクエリーが生成されるため 選択した 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔 順方向のみからレコードセットを取得する場合";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe5";
              top.sc1[30] = t;
              top.sc2[30] = p;
              top.sc3[30] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe4() {
              var t="mysql への接続";
              var p="64000 administrator api blob cf cfquery clob coldfusion datadirect dcoldfusion dd dsn enableiscasesensitive getmetadata image ip iscasesensitive jdbc local mx mysql no qtimeout setdb2 setinformix setmssql setmysql setoracle setsybase sql tcp text true が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の が返されます が追加されました このオプションを有効にすると このデータソースのデータベース内にあるすべての このデータソースの接続先のデータベースです この制限を使用するには この場合 この接続の説明です この設定は これを選択すると すべてのクライアント接続が一時停止されます すべての接続を確認するには です でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します によって廃棄されるまでの時間を分単位で指定します により の のデフォルトのクエリータイムアウト値です のバージョンについては の呼び出しをオンにするには の次のメソッドに新しい引数 の設定で指定された文字数のデータが取得されます への接続 を を丸括弧で囲んでください を参照してください を設定します アプリケーションが アプリケーションの開発 オプション オプションがオフの場合に使用されます オプションを有効にする必要があります オペレーションです クエリーの応答時間が長くなることがあります クエリータイムアウト サーバー サーバーが実行する間隔 サーバーが接続を監視する システムプロパティ タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトでは デフォルトのバッファーサイズで デフォルト値は データソースにクエリーを送信すると データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルにある場合は データベースの再起動後に検証クエリーを削除してください データベースを再起動する直前にこのオプションを指定する必要がありますが ドライバに渡すパスワードです ドライバに渡すユーザー名です ドライバのアップグレードの詳細については ドライバを使用する場合にのみ適用されます バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるために フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ポート ポートの番号です ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 分 列の内容全体が返されます 制限数 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔 関数からの戻り構造体の列ごとに";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe4";
              top.sc1[31] = t;
              top.sc2[31] = p;
              top.sc3[31] = n;
          }
  
          function fWSfd7453be0f56bba4bcf6a8f122a6749eaf_8000() {
              var t="datadirect 接続での jdbc のサポート";
              var p="coldfusion datadirect jdbc これらのドライバを使用するとパフォーマンスが向上し のサポート は サポートされるデータベースの種類が追加されます データベース操作用に最新バージョンの ドライバをサポートしています 接続での";
              var n="WSfd7453be0f56bba4bcf6a8f122a6749eaf-8000";
              top.sc1[32] = t;
              top.sc2[32] = p;
              top.sc3[32] = n;
          }
  
          function fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7fff() {
              var t="datadirect ドライバの機能";
              var p="0 1 11 2008 4 5 coldfusion commercial datadirect db2v9 enterprise informix ipv6 jar mysql oracle oracle11g querytimeout schemaname server sp sql table tablename および このバージョンは この場合 となります のサポート は をサポートしています を参照してください アドレスのサポート デフォルトのクエリータイムアウト値を設定する データベースでは データベースの操作性を高める次の機能を備えています データベースサーバーと通信します ドライバのバージョン ドライバの機能 ドライバを使用して パッケージ化された パフォーマンスが向上します パフォーマンスの向上 ファイルとして提供されている ファイルを最新バージョンにアップグレードすると新機能の利用が可能になり 属性でテーブル名とともにスキーマ名を指定する必要があります 属性の値の形式は 接続オプション 特定のスキーマに関する列名またはインデックスの取得時にフィルタを適用する場合 詳細については";
              var n="WSfd7453be0f56bba4bcf6a8f122a6749eaf-7fff";
              top.sc1[33] = t;
              top.sc2[33] = p;
              top.sc3[33] = n;
          }
  
          function fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7ffe() {
              var t="mysql でのデータソースの作成";
              var p="admin administrator all api by coldfusion datadirect dd enterprise grant identified mysql mysql5 on root setmysql to が追加されました これを使用すると それぞれ でのデータソースの作成 と というコマンドを使用します のドライバポップアップメニューから の部分は を選択します データソースを作成するには データソースを作成できます データベースにアクセスしようとするすべてのユーザーにアクセス権限が必要になる場合があります ドライバタイプとして パスワードに置き換えてください メソッド ユーザー名と 必要な権限を付与するには 新しい管理 設定時にアクセス権限が指定されていない場合は";
              var n="WSfd7453be0f56bba4bcf6a8f122a6749eaf-7ffe";
              top.sc1[34] = t;
              top.sc2[34] = p;
              top.sc3[34] = n;
          }
  
          function fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7ffd() {
              var t="新しい querytimeout 接続オプション";
              var p="administrator advanced api connect datadirect dd dsn edit html jdbc pagetimeout pdf qtimeout querytimeout setdb2 setinformix setmssql setmysql setoracle setsybase settings が追加されました ただし と のアップグレードの一部として のデフォルトのクエリータイムアウト値を設定します のマニュアルに記載されている の次のメソッドに新しい引数 の詳細については の説明を次に示します オプションが追加されました オプションは クエリーがタイムアウトしたことを通知する例外が投げられます クエリーのタイムアウトのほうがはるかに長いときにページがタイムアウトすると クエリーの実行が完了した段階でページがタイムアウトになります クエリーの実行中にページがタイムアウトした場合は パネルに ページがタイムアウトしたことを通知する例外が返されます ページの ページのタイムアウトのほうがはるかに長いときにクエリーがタイムアウトになると 一部のデータベースではサポートされていません 同様に 接続オプション 接続オプションでは 新しい 次の資料を参照してください 版";
              var n="WSfd7453be0f56bba4bcf6a8f122a6749eaf-7ffd";
              top.sc1[35] = t;
              top.sc2[35] = p;
              top.sc3[35] = n;
          }
  
          function fWS70f0d54f063b9b08238ab6dc122b1a20785_8000() {
              var t="ssl 接続の有効化";
              var p="administrator coldfusion ssl で に移動します の要件に従って接続プロパティを指定します をクリックします テキストボックスで データとサービス データソース データソースページで 接続の有効化 接続を有効にするデータソースを選択します 接続を有効化するには 接続文字列 次のようにします 詳細設定の表示";
              var n="WS70f0d54f063b9b08238ab6dc122b1a20785-8000";
              top.sc1[36] = t;
              top.sc2[36] = p;
              top.sc3[36] = n;
          }
  
          function fWS50260aa90e50c24b_32f8955c122c2720693_8000() {
              var t="接続プロパティ";
              var p="4 5 clientcertificatekeystorepassword clientcertificatekeystoretype clientcertificatekeystoreurl db2 encryptionmethod false host hostnameincertificate jks jvm keypassword keystore keystorepassword microsoft mysql name null oracle pkcs12 requiressl server servername sql ssl sybase true trustcertificatekeystorepassword trustcertificatekeystoretype trustcertificatekeystoreurl truststore truststorepassword url usessl validateservercertificate verifyservercertificate および そのプロパティが適用されるデータベースを示します その他のタイプも使用できる場合があります です でサポートされるキーストアタイプに依存します でサポートされる標準のキーストアタイプは で使用しているセキュリティ製品の種類によっては のキーにアクセスするためのパスワード の場合に の場合にのみ適用されます の場合に適用されます の場合は必須 の場合は無視されます または空白の場合はデフォルト設定が使用されます を使用します を有効化する場合は必須 オプション キーストアファイルにアクセスするためのパスワード キーストアファイル内のキーにキーストアファイルと異なるパスワードが設定されている場合に使用されます キーストアファイル内の個 クライアント証明書のキーストアタイプ クライアント証明書キーストアのパスワード クライアント証明書キーストアへの サーバーと通信するときに データベースサーバーから送信された証明書をドライバで検証するかどうかを決定します データベースサーバーから送信された証明書を検証するかどうかを決定します データベースサーバーでクライアント認証が有効になっている場合にのみ適用されます トラストストアファイルにアクセスするためのパスワード トラストストアファイルのディレクトリ プロパティ 使用されるキーストアファイルのディレクトリ 使用している 信頼できるルート証明書のキーストアタイプ 信頼できるルート証明書キーストアのパスワード 信頼できるルート証明書キーストアへの 指定されていない場合はデフォルト設定が使用されます 接続を要求します 接続プロパティ 接続プロパティの詳細と 次の表に 証明書の検証に使用するホスト名 説明 適用される状況 適用対象";
              var n="WS50260aa90e50c24b-32f8955c122c2720693-8000";
              top.sc1[37] = t;
              top.sc2[37] = p;
              top.sc3[37] = n;
          }
  
          function fWS50260aa90e50c24b_32f8955c122c2720693_7fff() {
              var t="接続プロパティの指定";
              var p="4 5 clientcertificatekeystorepassword clientcertificatekeystoretype clientcertificatekeystoreurl database datadirect db2 encryptionmethod false host hostnameincertificate keypassword keystore keystorepassword microsoft mysql name oracle requiressl server servername sql ssl sybase true trustcertificatekeystorepassword trustcertificatekeystoretype trustcertificatekeystoreurl truststore truststorepassword universal url usessl validateservercertificate verifyservercertificate この表には で ではサポートされていません と記載されているプロパティは にある のマニュアルを参照してください の表を参照し をサポートしていないサーバーへの接続が試みられた場合の問題を回避するには をサポートしていないデータベースサーバーへの接続が試みられると を有効化する方法の詳細については オプションの値は キーストアへのパス キーストアタイプ キーストアパスワード キーパスワード クライアント証明書の データベース データベースドライバ トラストストアパスワード ルート証明書の ログインタイムアウトを設定します 一部のバージョンの 信頼できるルート証明書のパスワード 各ドライバに対して指定可能なすべての値が記載されています 各バージョンでサポートされているプロパティの詳細については 必要に応じて指定してください 接続がハングする場合があります 接続を有効にするために各データベースドライバに対して指定する必要がある接続プロパティの詳細を次の表に示します 接続プロパティ 接続プロパティの指定 次の";
              var n="WS50260aa90e50c24b-32f8955c122c2720693-7fff";
              top.sc1[38] = t;
              top.sc2[38] = p;
              top.sc3[38] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe3() {
              var t="odbc socket への接続";
              var p="3 64000 blob cf cfquery clob coldfusion createodbcdatetime dateformat dsn image jdbc mx odbc socket sql string text timeformat timestamp type が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にしてください このオプションを有効にすると このデータソースのデータベース内にあるすべての この制限を使用するには この場合 この接続の説明です この設定は これは これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するためにデータベースを再起動する直前にのみ設定します そのデータに ただし です でデータソースのデータベース接続数を制限するかどうかを指定します などの関数を使用して によって廃棄されるまでの時間を分単位で指定します により に戻す に接続する の設定で指定された文字数のデータが取得されます への接続 を を選択します アプリケーションが アプリケーションで日時データを取得し オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリーの応答時間が長くなることがあります サーバーが実行する間隔 サーバーに対してのみ有効です ステートメント内で再使用する場合は タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベースへのドメインユーザーアカウントアクセスを使用するかどうかを指定します データベースを再起動した後は ドライバです ドライバに渡すパスワードです ドライバに渡すユーザー名です バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるために検証クエリーを削除してください フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用可能な 信頼できる接続 分 列の内容全体が返されます 制限数 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 書式設定を適用することなく 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe3";
              top.sc1[39] = t;
              top.sc2[39] = p;
              top.sc3[39] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe2() {
              var t="oracle への接続";
              var p="300 64000 application blob cf cfc cflogin cfquery cfqueryparam cfstoredproc clob coldfusion dsn image ip jdbc local mx oracle orcl sid sql tcp text が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての この制限を使用するには この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します で指定されているアプリケーション名です で指定されているアプリケーション名の前に付加されます によって廃棄されるまでの時間を分単位で指定します により のバージョンについては の再使用を有効にします の設定で指定された文字数のデータが取得されます への接続 を を丸括弧で囲んでください を使用する固有の を参照してください アプリケーションが アプリケーション名 オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリが実行されるホスト名です クエリーの応答時間が長くなることがあります クライアントホスト名 クライアントユーザー名 サーバー サーバーが実行する間隔 サーバーが接続を監視する サーバー上で稼動している システムの識別子 タイムアウト タイムアウトになるまでの秒数です タグ タグなどで タグを使用してログインしている場合のユーザー名です タグを使用するストアドプロシージャとクエリー デフォルトのバッファーサイズで デフォルトの値は デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベースがローカルにある場合は データベースの再起動後には検証クエリーを削除してください データベースを再起動する直前に検証クエリーを指定する必要がありますが データベースソフトウェアのインスタンスを示す ドライバに渡すパスワードです ドライバに渡すユーザー名です バイトです バッファー パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プリペアードステートメント プールからの接続が再利用される際に呼び出されます プールされるステートメントの最大数 ポート ポートの番号です ユーザーが ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 値は 分 列の内容全体が返されます 制限数 名 固有の 当初は次の値の合計値を設定してください 指定した場合 接続の検証を有効にする 接続の無効化 接続の維持 接続を検証する場合は選択します 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 接頭辞 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe2";
              top.sc1[40] = t;
              top.sc2[40] = p;
              top.sc3[40] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe9() {
              var t="その他のデータソースへの接続";
              var p="1 390 400 64000 as blob cf cfquery clob coldfusion collectionid com createdefaultpackage datadirect db2 default driver dsn false image inet iseries jar jdbc locationname mx os sample sendstringparametersasunicode sql tds tdsdriver text true unicode url z および が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このクラスを含む このデータソースのための このデータソースのデータベース内にあるすべての この制限を使用するには この接続の説明です これを選択すると すべてのクライアント接続が一時停止されます そのデータベース用に定義したユーザー そのユーザー名用のパスワード その他 その他のデータソースへの接続 それを変更して以降の接続に使用します たとえば つ指定し です でデータソースのデータベース接続数を制限するかどうかを指定します で動作する とは によって廃棄されるまでの時間を分単位で指定します により の のすべてのサポート対象バージョンを意味します のように指定します の設定で指定された文字数のデータが取得されます の詳細については を をデータソースに接続する際には を使用する場合は を参照してください を指定します アプリケーションが オプション オプションがオフの場合に使用されます オプションを使用することで オプションを有効にします オペレーションです クラスパスに定義されているディレクトリになければなりません サーバーが実行する間隔 タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトのバッファーサイズで デフォルト値は データソース データソースに接続するために データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベースで データベースサーバー ドライバに渡すパスワードです ドライバに渡すユーザー名です ドライバのドロップダウンリストに表示されない ドライバの名前です ドライバの完全修飾クラス名です ドライバを介して ドライバクラス ドライバ名 バイトです バッファー パスワード パスワードを渡さない場合に パラメータに ファイルは フィールドを使用して最大数を指定できます プラットフォームで動作する ポート番号 ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 以降の接続に対しては 使用していない接続が 使用可能な 分 列の内容全体が返されます 初期接続に対しては 制限数 指定します 接続の 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 最初の接続用に文字列を 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 次のように 次の例のように 次の表の設定値を使用します 版 版または 現在のデータソースを操作可能な 用のデータソースを定義できます 秒 空白を入れずに 設定 説明 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe9";
              top.sc1[41] = t;
              top.sc2[41] = p;
              top.sc3[41] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3639b1_7fff() {
              var t="postgresql への接続";
              var p="64000 adobe blob cf cfquery clob coldfusion com dns dsn image ip jdbc local mx nbt postgresql sql tcp text www およびクライアント接続ウィザードを使用してセットアップしたエイリアスは指定できません が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての このデータソースの接続先のデータベースです この制限を使用するには この名前は この場合 この接続の説明です これらの方法はいずれも これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには です でサポートされている でデータソースのデータベース接続数を制限するかどうかを指定します という単語を丸括弧で囲んで指定します によって廃棄されるまでの時間を分単位で指定します により により解決可能 にアクセスしてください の設定で指定された文字数のデータが取得されます への接続 または を を実行中であっても アドレスのいずれかである必要があります アプリケーションが オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです クエリーの応答時間が長くなることがあります サーバー サーバーが実行する間隔 サーバーが接続を監視する タイムアウト タイムアウトになるまでの秒数です タグなどで デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルの場合は データベースの再起動後には検証クエリーを削除してください データベースを再起動する直前に検証クエリーを指定する必要がありますが ドライバに渡すパスワードです ドライバに渡すユーザー名です ネットバイオス名 バイトです バッファー バージョンでは有効でした バージョンの一覧を確認するには パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プールからの接続が再利用される際に呼び出されます ポート ポートの番号です ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 以前の 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 分 列の内容全体が返されます 制限数 完全に修飾されたドメイン名 接続の無効化 接続の維持 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔";
              var n="WSc3ff6d0ea77859461172e0811cbf3639b1-7fff";
              top.sc1[42] = t;
              top.sc2[42] = p;
              top.sc3[42] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fe0() {
              var t="sybase への接続";
              var p="1 64000 application blob cf cfc cflogin cfquery cfqueryparam cfstoredproc clob coldfusion dns dsn image ip jdbc local mx nbt sql sybase tcp text および およびクライアント接続ウィザードを使用してセットアップしたエイリアスは指定できません が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 がデータソース接続へのログインを試みる際の このオプションを有効にすると このデータソースのデータベース内にあるすべての このデータソースの接続先のデータベースです この制限を使用するには この名前は この場合 この接続の説明です この設定はアプリケーションに基づいて調整しますが これは これらの方法はいずれも これを選択すると すべてのクライアント接続が一時停止されます すべての接続を検証するには つのオープンな つの接続で複数のオープンな です でサポートされる でデータソースのデータベース接続数を制限するかどうかを指定します で指定されているアプリケーション名です で指定されているアプリケーション名の前に付加されます という単語を丸括弧で囲んで指定します によって廃棄されるまでの時間を分単位で指定します により により解決可能 のバージョンについては の再使用を有効にします の設定で指定された文字数のデータが取得されます への接続 または を を使用する固有の を参照してください を実行中であっても アドレスのいずれかである必要があります アプリケーションが アプリケーションでは一般的なメソッドです アプリケーションでは一般的なメソッドではありません アプリケーション名 オプション オプションがオフの場合に使用されます オプションを有効にします オペレーションです カーソルメソッドでは クエリが実行されるホスト名です クエリーに使用するかどうかを決定します クエリーの応答時間が長くなることがあります クライアントホスト名 クライアントユーザー名 サーバー サーバーが実行する間隔 サーバーが接続を監視する サーバーカーソルを ステートメントに制限する場合は ステートメントを使用できます タイムアウト タイムアウトになるまでの秒数です タグ タグなどで タグを使用してログインしている場合のユーザー名です タグを使用するストアドプロシージャとクエリー デフォルトのバッファーサイズで デフォルト値は データソースに接続するために データソースに接続する際には データソースへのデータベース接続の最大数を指定します データソースへの接続は データソースへの接続をキャッシュすることによってパフォーマンスを向上させることができます データソース名 データベース データベースがローカルの場合は データベースの再起動後には検証クエリーを削除してください データベースを再起動する直前に検証クエリーを指定する必要がありますが ドライバに渡すパスワードです ドライバに渡すユーザー名です ネットバイオス名 バイトです バッファー バージョンでは有効でした パスワード パスワードを渡さない場合に パフォーマンスの低下を避けるため フィールドを使用して最大数を指定できます プリペアードステートメント プールからの接続が再利用される際に呼び出されます プールされたステートメントを使用しない限り プールされるステートメントの最大数 ポート ポートの番号です メソッドの選択 ユーザーが ユーザー名 ユーザー名を渡さない場合に ログインタイムアウト ログイン証明情報などのデータベース固有のパラメータをデータソースに渡すフィールドです 一度に 以前の 使用していない接続が 使用するデータベースをホストするサーバーの名前です 使用可能な 値は 分 列の内容全体が返されます 制限数 効率的にデータを取得できます 固有の 完全に修飾されたドメイン名 当初は次の値の合計値を設定してください 指定した場合 接続の検証を有効にする 接続の無効化 接続の維持 接続を 接続を検証する場合は選択します 接続を要求するオペレーションが実行されるたびに確立されます 接続数の制限 接続文字列 接頭辞 期限切れのため閉じるデータソース接続がないかどうか確認するサイクルを 検証クエリー 次の表の設定値を使用します 現在のデータソースを操作可能な 直接メソッドでは 秒 設定 説明 追加のクエリーが生成されるため 選択していない場合 長いテキストのバッファー 長いテキストの取得 間隔 順方向のみからレコードセットを取得する場合";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fe0";
              top.sc1[43] = t;
              top.sc2[43] = p;
              top.sc3[43] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fdf() {
              var t="jndi データソースへの接続";
              var p="64000 administrator blob cf cfquery clob coldfusion credentials dsn image j2ee jndi mypassword myusername principal security sql text が がオフの場合に使用されます がデータソースに接続するために使用するデータソース名 このデータソースのデータベース内にあるすべての この接続の説明です これを選択すると たとえば です に により に接続するために に接続するためのユーザー名とパスワードを次のように指定します に渡すパスワードです に渡すユーザー名です の位置です の設定で指定された文字数のデータが取得されます を アプリケーションが アプリケーションサーバーがデータソースを格納する アプリケーションサーバーで定義した オプション オプションがオフの場合に使用されます オペレーションです サーバー設定で動作している場合 タグなどで デフォルトのバッファーサイズで デフォルト値は データソースで必要とされる場合 データソースに接続するために データソースに接続する際には データソースへの接続 データソースオプションは表示されません データソース名 バイトです バッファー パスワード パスワードを渡さない場合 マルチサーバー設定および ユーザー名 ユーザー名を渡さない場合に 使用可能な 列の内容全体が返されます 名 名前と値のぺアをカンマで区切ったリストを使用します 次の表の設定値を使用します 現在のデータソースを操作可能な 環境設定 環境設定を指定します 設定 設定のみ 説明 追加の 選択していない場合 長いテキストのバッファー 長いテキストの取得";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fdf";
              top.sc1[44] = t;
              top.sc2[44] = p;
              top.sc3[44] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf3639b1_7fe6() {
              var t="外部 jdbc type 4 データソースへの接続";
              var p="4 administrator cfusion coldfusion inf j2ee jar jdbc lib sqlanywhere type web windows これで その その他 その他の では など に同梱されていない の のサービスをすべて再起動してください のデータソース管理に関する章を参照してください のルートディレクトリ を使用するには を再起動します を選択して アプリケーションのルートディレクトリ サーバー設定のみ データソースに接続できるようになります データソースへの接続 データソースを追加します データベースドライバの ドライバ ドライバを設定し ドロップダウンリストで ファイルを次のいずれかのディレクトリにコピーします マルチサーバーまたは 外部 対応するデータソースを追加します 必ず 設定 設定と管理 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf3639b1-7fe6";
              top.sc1[45] = t;
              top.sc2[45] = p;
              top.sc3[45] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7ffd() {
              var t="web サーバーの管理";
              var p="adobe apache coldfusion iis iplanet one server sun web および など外部 は サーバーに接続することもできます サーバーに接続できる他 サーバーの管理 ビルトイン 以前の名称は";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7ffd";
              top.sc1[46] = t;
              top.sc2[46] = p;
              top.sc3[46] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363a5d_7ff7() {
              var t="coldfusion の web サーバーについて";
              var p="1 coldfusion coyote http tcp tomcat web と には に転送します の は を参照してください エンジンに転送します エンジンは カスタマイズされた コネクタコンポーネントです サイトの管理に役立ちます サーバー サーバーから サーバーについて サーバーに関する次のようなオプションがあります サーバーの特定の サーバーは サーバーまたはアプリケーションコンテナに対する サーバーコネクタモジュールです サーバー間の通信の仕組みを理解することは ビルトイン プロトコルをサポートする ページに対するリクエストを外部 ポートで受信接続をリスンし リクエストを リクエストを処理し 外部 応答をリクエスト元のクライアントに返送します 環境における重要なコンポーネントであり 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf363a5d-7ff7";
              top.sc1[47] = t;
              top.sc2[47] = p;
              top.sc3[47] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd8() {
              var t="ビルトイン web サーバーの使用";
              var p="2 443 80 8500 8504 absolute add administrator adobe aliases apache catalina cf cfide cfm cfml cfusion coldfusion com conf connector context coyote directory directory1 directory2 docbase home http http11 http11protocol https index install ip language localhost markup org path path1 path2 port protocol root runtime server tcp tmp to tomcat unix url virtual web workdir www wwwroot xml およびコンピュータに が外部 が設定されていることを確認してください すべての そのポートを使用するようにビルトイン たとえば つの場合 で できる限り です と というエントリのコメントを解除します という文字列を検索します と並存させる場合 と入力します などです にはそのポートの指定を含めることができます にアクセスするには に移行する間 の大文字と小文字が区別されます は はこの は同等です をリスンします を参照してください を実行し を実行していても外部 を実行できます アプリケーションの開発およびテストを行うことができます インストール後に外部 インストール時にビルトイン インストール時に外部 オペレーティングシステムでは コネクタの サーバーが存在しない場合 サーバーが設定されます サーバーで使用されているポート番号を調べるには サーバーで別の サーバーとも呼ばれます サーバーのルートの下に サーバーの使用 サーバーの設定は サーバーは サーバーはポート サーバーは何らかの サーバーは次の場合に便利です サーバーを介して サーバーを使用して サーバーを使用してローカルで サーバーを使用するように設定してください サーバーを使用するように設定しなかった場合 サーバーを使用する場合は サーバーを使用する際のデフォルト サーバーを使用すれば サーバーを実行していない場合に サーバーを有効にした場合 サーバーを設定するには サーバーを選択してしまった場合 サーバー名 サーバー設定 サーバー設定のビルトイン サーバー設定ツールの詳細については サーバー設定ツールを実行します ソースコードを配信します テキストエディターで ディレクトリ デフォルトでは デフォルトの場合 デフォルトポートが既に使用されていると ビルトイン ファイルに仮想マッピングを定義します ファイルを開き ページがある場合は ページの ページを配信するように ポート ポートをリスンしており リクエストをリスンします ルートの下にあります ルートの下に保存されている ルートは ルートディレクトリのページを処理する場合は ワークステーションで 上で説明した 上に作成されており 下の 以前のバージョンの 以外は 仮想ディレクトリを追加するには 併存および移行 例えば 同一コンピュータ上で 同様に 外部 属性を確認します 属性を追加します 手動で 既存のアプリケーションを 次に大きな番号の使用可能ポートが自動的に検索され 次に示す 次の点に留意してください 要求のデフォルトのポートです 開発";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd8";
              top.sc1[48] = t;
              top.sc2[48] = p;
              top.sc3[48] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd7() {
              var t="外部 web サーバーの使用";
              var p="1 2 addhandler allowed apache assign buffer c cf cfc cfchandler cfflush cfm cfmhandler cfml cfmlhandler cfrhandler cfswfhandler cgi coldfusion coldfusion10 conf config debug dll enable false file filters fn from funcs httpd iis info init is isapi jakarta jk jknsapi level load loadmodule log magnus method mod modules name nametrans nsapi obj object one properties redirect root roots server server1 service shlib shm so sun tomcat true web worker workers wsconfig x および こうすると これは これを です という というエントリを というフォルダーが というフォルダーを という仮想ディレクトリを作成します という権限で に に作成します に変更します に指示します に設定します の の下に追加します の制限の下に追加します の場合 の設定ファイルに次の要素を追加します は または を を使用しない場合は を指します アプリケーションで グローバルレベル コネクタの詳細 コネクタ上で機能させる場合に行います コネクタ関連のすべてのファイルが格納される コネクタ関連のすべてのファイルを格納する サイトレベルのいずれかで サーバー サーバーからのリクエストを サーバーのコネクタが サーバーのバッファーを無効にするには サーバーの使用 サーバーコネクタは サーバーコネクタを使用して サーバー固有のプラグインモジュールを使用します サーバー設定ツールは ディレクティブは ディレクティブはコネクタを定義します ディレクトリにある デバッグの問題の場合は デバッグの場合は デフォルト ハンドラーを追加します パフォーマンスが向上する場合があります ファイルにすべての拡張子のエントリが追加されます ファイルに次のエントリが追加されます ファイルに次の要素を追加します ファイルの ファイルのログレベルを フォルダーに作成されます プロキシサービスとコネクタを使用してレスポンスを返します プロキシサービスへの接続を開きます ページに対するリクエストがあると ページに対するリクエストをコネクタを使用して転送するよう マネージャーのグローバルサイトの場合に当てはまります ランタイムシステムに転送します ランタイムシステムはリクエストを処理し ログレベルを 内 外部 接続モジュールは 次に例を示します 次の表に示すように 次の要素を追加します";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd7";
              top.sc1[49] = t;
              top.sc2[49] = p;
              top.sc3[49] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd6() {
              var t="web サーバーの設定";
              var p="coldfusion gui web いずれの場合も では に接続するためにコネクタが必要とするモジュールと設定を外部 グラフィカルユーザーインターフェイス コマンドラインインターフェイスまたは サーバーが設定されます サーバーとの間で通信を行えるように外部 サーバーに設定します サーバーの設定 サーバー設定ツールは サーバー設定ツールを使用して サーバー設定ツールを実行すると モードのどちらでも実行できます";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd6";
              top.sc1[50] = t;
              top.sc2[50] = p;
              top.sc3[50] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363a5d_7ffc() {
              var t="gui モードの使用";
              var p="10 adobe bin cf cfusion coldfusion exe gui html ip ok root runtime unix web windows wsconfig このモードでは この場合 で に移動します の場合 をクリックします を選択します を配信することはできません アドレスまたはサーバー名を入力します アプリケーションの アプリケーションのコンテキストルートが空 アプリケーションサーバーホストとアプリケーションサーバークラスタを提供します オプション グラフィカルインターフェイスを使用して外部 コマンドまたは コマンドを使用して コンソールウィンドウを開きます サーバーのルートディレクトリからスタティックコンテンツ サーバーのルートディレクトリからページを配信するには サーバーの下の対応するディレクトリに サーバーの属性 サーバーの設定 サーバーまたはクラスタは サーバーコネクタでは サーバーコンピュータ上に存在している必要はありません サーバーマッピングを作成します サーバー固有の情報を入力して サーバー設定を指定できます サーバー設定ツール サーバー設定ツールには サーバー設定ツールの実行 サーバー設定ツールを サーバー設定ツールを起動します サーバー設定ツールを起動するには サーバー設定ツールウィンドウが表示されます スタート チェックボックスを選択します ビルトイン ファイルやイメージなど プログラム モードがあります モードで使用する場合は モードによる モードの使用 リモートコンピューターの 追加 領域で";
              var n="WSc3ff6d0ea77859461172e0811cbf363a5d-7ffc";
              top.sc1[51] = t;
              top.sc2[51] = p;
              top.sc3[51] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd9() {
              var t="コマンドラインインターフェイスの使用";
              var p="0 1 2 all apache apache2 apachectl bat bin c cf cluster coldfusion conf config connector connectors dir etc exe files group h host httpd iis isp jar l list localhost norestart one opt options path program remove root runtime script server service site stronghold sun sunone to tomcat uninstall unix upgrade usr v verbose web web31 windows ws wsconfig このオプションを使用して この設定はすべての これらのファイルをプロトタイプとして使用し すべてのサイトで すべてのパラメータをリストします すべての既存 そのフィルタとマッピングがすべてのサイトに継承されるようにします それらのファイルは たとえば です では などではファイルが若干異なる場合があります に設定することでグローバルに定義されたコネクタを確立し の のすべてのサイトを のサイトを設定する必要はありません のパスを指定します のルートディレクトリ へのパスを指定します または を使用する場合は を実行するシステムでは を指定して を設定します オプション オプションが必要です オプションと クラスタへの接続を定義できます クラスタ名を指定します グローバルレベルのコネクタを設定します コネクタの コマンドまたは コマンドを実行します コマンドラインでの一般的なコネクタ設定を実装するバッチファイルとシェルスクリプトが含まれています コマンドラインインターフェイスの使用 コマンドラインインターフェイスの例 コマンドラインインターフェイスの実行 コンソールウィンドウを開きます コントロールスクリプトファイル サイト サイトに応じて編集して保存します サイトに適用されます サイトを設定します サイト名を指定します サーバーのバイナリファイル サーバーをリストします サーバーを使用する場合の例 サーバーを再起動しないよう指定します サーバーを指定します サーバーアドレスを指定します サーバー名の指定では サーバー設定 サーバー設定には サーバー設定ツールからの サーバー設定ツールはコマンドラインインターフェイスを使用して実行することもできます サービス名を指定します ディレクトリにあります ディレクトリに移動します デフォルト値は バッチファイルとシェルスクリプトの使用 ファイルでは ファイルの新しいモジュールでアップグレードします ロギングを有効化します 上の 出力を有効にします 単一サーバーではなく 台目の 大文字と小文字は区別されます 大文字と小文字は区別されません 指定されたホストのすべての 新しい 既存の設定済みコネクタを 構成ディレクトリ 次のように 次のようにして 次の表にオプションを示します 派生製品の 特定の 複数の 設定されたすべての 設定を削除します 設定済みコネクタをすべて削除します 説明 通常は個";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd9";
              top.sc1[52] = t;
              top.sc2[52] = p;
              top.sc3[52] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363a5d_7ffb() {
              var t="設定ファイル";
              var p="0 1 2 a acl addhandler addlog alias all allow allowoverride apache apache2 as assign authtrans b browser by c cf cfc cffileservlet cfform cfformgateway cfide cfm cfml cfr cfswf cfusion check clean coldfusion coldfusion10 common conf config d debug default deny dir directory dll error es extension file files find flashservices flex flex2gateway fn followsymlinks force format foundation from funcs gateway get h hbmxml head home html httpd icons include index indexes info init install internal iplanet j2ee j2eeplugin jakarta jk jklogfile jkloglevel jklogstampformat jkmountfile jknsapi jkshmfile jkworkersfile jsp level lib load loadmodule log logs m magnus match mc memory method mod module modules msie mxml name names nametrans none nsapi ntrans obj object objecttype one options oracle order pathcheck pathinfo pfx2dir plain post program properties put redirect rest root s select send service servlet set shared shlib shm shutdown so software ssl sun swc sws text the timestamp to tomcat trace true type unclean uri uriworkermap web webserver7 where worker workers wsconfig wwwroot y ここで説明する例では それぞれ と の下にファイルが作成され の下に作成されます の設定ファイル または をインストールする場合の一般的な コネクタ固有の サンプル設定ファイル サーバーと同じマシンに サーバーの一般的な サーバーは同一コンピューター上で実行されているものと想定します サーバープロパティの例を次に示します サーバー固有のサポートファイルが格納されています サーバー設定の場合 サーバー設定ツールを実行するたびに サーバー設定ファイルのパラメータをわかりやすく説明するため ファイルには ファイルには次のものが含まれています ファイルを次に示します プラットフォーム固有のコネクタモジュールと 以降の実行時も同様です 作成されたサブディレクトリには 例えば 回目には 最初の実行時には 次のエントリが含まれています 設定ファイル 設定ファイルおよびディレクトリが作成されます";
              var n="WSc3ff6d0ea77859461172e0811cbf363a5d-7ffb";
              top.sc1[53] = t;
              top.sc2[53] = p;
              top.sc3[53] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fc3() {
              var t="マルチホーム";
              var p="1 administrator alias apache cacherealpath cfform cfide coldfusion javascript js scripts scriptsrc web から返されるようにするには この手法は しかし すべての そのような仮想ホストは その仮想ホストから それらのスクリプトに対するアクセスを有効にするには たとえば つでもある場合は つの では として使用することや と呼ばれています にアクセスする必要があるアプリケーションが に対するアクセスの有効化 の または を を作成します を無効にします キャッシュ機能 サイトにコピーします サイトを作成します サーバーと サーバーとの接続を設定するには サーバーに接続します サーバーに転送することができます サーバーの種類によって異なります サーバーコネクタを使用して サーバーパスのキャッシュ サーバーマッピング サーバーマッピングを作成しない場合で サーバー固有のメソッドを使用して サーバー設定ツールを使用します タグを使用するアプリケーションが タグを修正し ディレクティブ ディレクトリにコピーします ディレクトリを ディレクトリを指す ディレクトリ全体をその仮想 ディレクトリ内の ファイルに対するアクセスの有効化 ファイルの場所を指定するようにします ファイルを検索できるようにします ページで ホスティング環境で個別のユーザー用に使用することができます マルチホーム マルチホームを有効化するために実行する手順は マルチホームを設定するタスクには次の作業が含まれます マルチホーム環境では マーケティング用など ルート 人事管理用 仮想サイトとも呼ばれます 仮想ホストの下に 個別のアプリケーション用 元の 同一コンピュータ上で実行する 属性で 属性の無効化 常に正しいサーバーのページが 次のいずれかの方法を使用します 用途ごとに個別の仮想 給与処理用 複数の仮想サイトへのリクエストを 複数の仮想ホスト 該当する仮想ホストの 通常は";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fc3";
              top.sc1[54] = t;
              top.sc2[54] = p;
              top.sc3[54] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363a5d_7fef() {
              var t="iis";
              var p="0 1 administrator bin cf coldfusion dns exe gui html iis root runtime site v web ws wsconfig および実行アクセスを有効にしてください すべて つの のドキュメントの説明に従って のドキュメントを参照してください のルートディレクトリは の場合は の複数の仮想サイトの接続 また を使用して を実行して追加 を設定します を選択し を選択します アプリケーションの オプションを指定します コマンドライン サイト サイトの サイトをテストし サイトを作成し サイトを作成します サーバーに サーバーに対する サーバーの設定 サーバー設定ツールを実行します チェックボックスを選択します ドロップダウンリストで ページが正しく配信されることを確認します ページは ルートの下に格納してください 各仮想 必要に応じて仮想 書き込み 次のサーバー設定例のように 次の手順に従って 詳細については 読み込み";
              var n="WSc3ff6d0ea77859461172e0811cbf363a5d-7fef";
              top.sc1[55] = t;
              top.sc2[55] = p;
              top.sc3[55] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd5() {
              var t="apache";
              var p="0 1 127 admin apache apache2 bin c cf coldfusion com conf dir dns documentroot employee error errorlog exe files group gui htdocs htdocs2 htdocs3 html httpd log logs myemployee mystore namevirtualhost program root runtime server02 serveradmin servername store unix v virtualhost web ws wsconfig yoursite つの と のマニュアルを参照してください のルートディレクトリ の他のコマンドライン例については の場合は を再起動します を参照してください を指定し を設定します アプリケーションの コマンドライン サイトの サンプルについては サーバーに サーバーに対する サーバーのドキュメントの説明に従って サーバーの設定 サーバー上の複数の サーバー設定ツールを実行します サーバー設定ツールウィンドウによって チェックボックスを選択します テキストエディタで ディレクティブで指定されたディレクトリに格納してください ファイルが更新されます ファイルは ファイルを修正して仮想ホストを作成し ファイルを含むディレクトリを指定して ファイルを含むディレクトリを指定します ファイルを開き ページが正しく配信されることを確認します ページは ルートの下に格納してください 仮想ホストの接続 各仮想 各仮想ホストの 各仮想ホストをテストし 必要に応じて仮想ホストを作成します 次に例を示します 次の例のように 次の手順に従って 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd5";
              top.sc1[56] = t;
              top.sc2[56] = p;
              top.sc3[56] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363a5d_7fed() {
              var t="sun one web サーバーおよび iplanet";
              var p="1 6 administrator bin cf coldfusion conf config dir dns gui html iplanet magnus obj one path root runtime server sun sunone to v web ws wsconfig が使用する仮想 つの では と のマニュアルを参照してください のルートの下に格納してください の場合は の複数の仮想ホストの接続 を使用して を使用して仮想サーバーを作成し を指定し を設定します アプリケーションの コマンドライン サイトごとに サイトの サーバーおよび サーバーに サーバーに対する サーバーのドキュメントの説明に従って サーバーの設定 サーバーを作成します サーバー設定ツールを実行します サーバー設定ツールを実行する必要があります チェックボックスを選択します バージョン ファイルと ファイルを含むディレクトリを指定して ファイルを含むディレクトリを指定します ページが正しく配信されることを確認します ページは 以前のバージョンの 各サイトに個別のサーバーインスタンスを作成し 各仮想 各仮想サーバーの 各仮想サーバーをテストし 次の例のように 次の手順に従って 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf363a5d-7fed";
              top.sc1[57] = t;
              top.sc2[57] = p;
              top.sc3[57] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363af9_7ff6() {
              var t="coldfusion アプリケーションのデプロイ";
              var p="adobe coldfusion には アプリケーションのデプロイ アプリケーションをパッケージ化してアーカイブファイルを作成できるように アーカイブとデプロイの方法に関するオプションが用意されています";
              var n="WSc3ff6d0ea77859461172e0811cbf363af9-7ff6";
              top.sc1[58] = t;
              top.sc2[58] = p;
              top.sc3[58] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363af9_8000() {
              var t="アーカイブとデプロイのオプション";
              var p="1 application archive car cfc cfcompile cfm cfr coldfusion ear enterprise j2ee java war web および設定を が付いたファイルにそのバイトコードを保存することもできます つの には また または を参照してください アプリケーションの アプリケーションのページ アプリケーションを アプリケーションサーバーに簡単にデプロイできます アーカイブ アーカイブとデプロイに関する次のオプションがあります アーカイブとデプロイのオプション アーカイブファイル クラスファイルにプリコンパイルできます データソース ファイルとしてパッケージ化すると ファイルにパッケージ化することができます ページを ページをコンパイルしてバイトコードに変換し ユーティリティ ユーティリティを使用すると 拡張子 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf363af9-8000";
              top.sc1[59] = t;
              top.sc2[59] = p;
              top.sc3[59] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd3() {
              var t="アプリケーションの car ファイルへのパッケージ化";
              var p="administrator car cfx coldfusion ear j2ee rds solr war web および およびアプリケーションをアーカイブしてデプロイできます およびデプロイの詳細については この名前は この機能を使用して その内容を復元する場所を指定します で で作成したアーカイブを展開することはできません の のアーカイブやパッケージとは異なります のアーカイブ定義にはそれぞれ名前が割り当てられます のオンラインヘルプを参照してください のパスワードをデプロイすることはできません また アプリケーションの アーカイブ アーカイブの内容を構築またはデプロイするたびに使用されます アーカイブをデプロイします アーカイブを構築します アーカイブ定義の名前を選択し アーカイブ定義を作成します コレクション サイトについてアーカイブする情報の種類を特定します サイトに関するほぼすべての種類の情報をアーカイブできます サイトの設定情報 サイトアプリケーションを別の場所にデプロイすることや サイト情報をアーカイブおよびデプロイするには サーバー設定など タグ ディレクトリ パッケージとデプロイ ファイル ファイルでは ファイルのアーカイブとデプロイは ファイルの作成 ファイルの場所と ファイルの格納場所を指定します ファイルの管理は ファイルへのパッケージ化 ファイルを使用する ファイルを簡単にすばやくバックアップすることができます マッピング 以前のバージョンの 作成する個 構築 次の手順を実行します 自動化タスク 領域で行います";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd3";
              top.sc1[60] = t;
              top.sc2[60] = p;
              top.sc3[60] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd1() {
              var t="アプリケーションの j2ee アーカイブファイルへのパッケージ化";
              var p="30 administrator api application archive cfc cfide cfm cfml cfmx cfr coldfusion com development ear enterprise hostname http index j2ee java rds remote services url war web および およびデプロイ先の環境によっては が設定され このアーカイブファイルの中には これにより これらの手順を そのファイルはエンタープライズ版の評価バージョンとしてデプロイされるため それぞれに固有の それらのディレクトリがデプロイ先のコンピュータに存在しない場合は たとえば で で作成できます と呼ばれるベース の のみ のコンテキストルートで のファイルを除外することでアーカイブファイルを小さくして の以前のリリースでは の最初の部分 の詳細については の部分の直後 ほとんどの または を をクリックします を使用して を使用してアプリケーションを変更する必要がない場合は を使用してシリアル番号を入力します を使用する場合 を使用できます を参照してください を実行している場合は を持ちます を表示します を選択します を開きます アプリケーション アプリケーションが作成されます アプリケーションで アプリケーションで使用する アプリケーションの アプリケーションのデプロイに使用できるアーカイブファイルをすばやく作成できます アプリケーションのパッケージ化 アプリケーションの内容 アプリケーションは アプリケーションは必要ありません アプリケーションを アプリケーションを本番環境の アプリケーションサーバーでは アプリケーションサーバーは アプリケーションサーバー上にデプロイするには アプリケーションサービスを決定します アプリケーションルートまたは アーカイブされたアプリケーションの アーカイブの作成または変更時に使用する設定項目について説明します アーカイブタイプ アーカイブファイルに付ける一意の名前を指定します アーカイブファイルに含まれるアプリケーションのデバッグを無効化できます アーカイブファイルに含めるデータソース定義を指定します アーカイブファイルへのパッケージ化 アーカイブファイルを作成した後は アーカイブファイル作成時に アーカイブ名 アーカイブ機能を使用すると インストール エンタープライズアプリケーションを含んだ エンタープライズ版にアップグレードする場合は エンタープライズ版のシリアル番号を指定します エンタープライズ版の有効なシリアル番号を指定しないと エンタープライズ版の機能です コンテキストパス コンテキストルート コンテキストルートとして サポートを使用しない場合は サポートを含める サポートファイルを除外することでアーカイブファイルのサイズを小さくできます サーバーがデバッグを有効化した状態で動作している場合に サーバーにデプロイする際 サーバールートに格納されて サーバー上で実行する各 シリアル番号 セキュリティ問題も軽減できます ソースを含める ソースコードをデプロイせず デバッグ デプロイに関する注意事項 デプロイは デプロイ後に次のような設定が必要となる場合があります デプロイ後の注意事項 データソース データソースなど データソース定義など バイトコードをデプロイすることもできます ファイルが ファイルが作成されます ファイルが含まれます ファイルは フィールドで ホスト名 マッピング マッピングは マッピングを変更します リソース 代わりに 作成 使用するリソース 元のコンピュータ上にあった各種ディレクトリを指しています 受信要求する 各サーバーインスタンスのアプリケーションのコンテキストルートとしてスラッシュ 形式または 形式を使用します 拡張子なし 指定のアプリケーション配布ディレクトリ内に 新しいアーカイブ定義の追加とアーカイブファイルの作成 新規アーカイブの追加 日が経過するとデベロッパー版に戻ります 次の表で 現在の 用の設定 画面が表示されます 画面でアーカイブ設定を指定します 管理者が繰り返して実行する必要がありました 管理者による 設定 設定でのデプロイに関する標準的なテクニックを使用してデプロイします 設定で実行している場合 詳細については 説明 追加";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd1";
              top.sc1[61] = t;
              top.sc2[61] = p;
              top.sc3[61] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd0() {
              var t="cfcompile ユーティリティの使用";
              var p="administrator bat bin c cf cfc cfcompile cfm cfml cfr cfusion coldfusion coldfusion10 compile deploy directory ear home inetpub inf j2ee j2eejar java output root sh to war web webapp webinf webroot wwwroot および このディレクトリは このパスの指定は必須です これらの これを行うと その前に で にあります の または をプリコンパイルできます を作成できます アプリケーションの アプリケーションのバイトコード版 アプリケーションをデプロイします アーカイブ オプションを使用する場合 オプションを指定することで クラスにコンパイルするには クラスファイルにプリコンパイルします コンパイルする対象のファイルが置かれているディレクトリの完全修飾パスです コンパイルによって作成されるデプロイ可能ファイルを格納するディレクトリの完全修飾パスです サーバールートの完全修飾パスです サーバー設定の場合 ソースコードの代わりにデプロイできます ソースコードの代わりにデプロイできるバイトコード形式に変換するには ソースファイルのディレクトリと同じ場所を指定することはできません ソースレス配布 テンプレートがすべてコンパイルされます ディレクトリ バイトコードの バイトコードを含んだ パラメータ ファイル ファイルで ファイルは ファイルをコンパイルして ファイルをバックアップします ファイルを元のディレクトリへとコピーします ファイルを含んだ プリコンパイルすると ページ ページのプリコンパイル ページは ページを ページをコンパイルする必要がなくなります ページを作成します ユーティリティに ユーティリティの使用 ユーティリティは ユーティリティを使用すると ユーティリティを使用するには ユーティリティを実行した後は ランタイムに ランタイムにおいてページの初期ロード時間が高速化されます ルートディレクトリの下位である必要があります ルートディレクトリ内にある 作成したバイトコード版の 例 元の 各パラメータについて説明します 変数を設定する必要があります 指定しない場合は 次のコマンドを使用します 次のコマンドラインを使用します 次の手順を実行します 次の用途に使用できます 次の表で 生成したバイトコード 画面で作成できます 設定で 設定の場合 説明";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd0";
              top.sc1[62] = t;
              top.sc2[62] = p;
              top.sc3[62] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7ff2() {
              var t="セキュリティの管理";
              var p="coldfusion サンドボックスセキュリティを設定することができます セキュリティの管理 パスワード認証を使用して各種の リソースを保護したり";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7ff2";
              top.sc1[63] = t;
              top.sc2[63] = p;
              top.sc3[63] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363b95_7ff6() {
              var t="coldfusion セキュリティについて";
              var p="1 administrator cfml coldfusion development e http layer pin rds remote secure services sockets ssl web およびカスタマイズを行います およびパスワードまたは個人識別番号 およびメッセージの改ざんを防止できます が公開鍵暗号によって暗号化されます このセキュリティリスクが最も複雑です この環境は すべてのコンピューターが そのユーザーに割り当てられたロールに基づいて つだけ設定できます つの大きなネットワークに接続されているので で では で実装します で開発するような など にある の のエンタープライズ版をご使用の場合は のスタンダード版をご使用の場合は のセキュリティ機能 のパスワード保護を設定します のランタイムセキュリティには次のカテゴリがあります の入力を求めるプロンプトが表示されます の公開接続経由で送信されるデータは監視される可能性があります の開発者および管理者は は ほとんどの またはユーザーが機密データを共有するグローバルコラボレーションサイトがある場合は より難しくなります を使用して を使用するためのパスワードと を使用するためのパスワードを設定することで実装します を参照してください アクセスのパスワード保護を設定します アクセスを有効化したり制限したりできるように アクセス制御 アプリケーションの保護 アプリケーションの利用に必要な部分的アクセスを許可することには危険が伴います アプリケーションの脅威となる可能性があるセキュリティリスクを把握しておく必要があります アプリケーションの開発 アプリケーションの開発とデプロイ用に インターネットでは インターネットプロトコル キーをインストールすると クライアントとサーバーの間で情報を渡す際のスヌーピング コマースサイト サンドボックスセキュリティ サーバーでサポートされている サーバーで自動的に処理されます スタンダード版では スヌーピングと傍受 セキュリティ セキュリティについて セキュリティの有効化 セキュリティは特に重要です セキュリティサンドボックスを セキュリティ許可 プロトコルを使用すれば ベースのアプリケーションでは ページ ページが使用できるアクションとリソースを定義します ページと ページ開発を可能にする ユーザーが自分の個人口座の情報に排他的にアクセスできる口座保守サイトを作成するのは ユーザーの偽装 ユーザーセキュリティ ユーザーセキュリティの詳細については ランタイムセキュリティ リソースセキュリティ リモートからの ログインしたユーザーをプログラムを使用して判別し 一意のログインまたはユーザー名 一般的な銀行業務の情報があるサイトを銀行が公開して自由にアクセスできるようにするのは簡単です 不正なユーザーが 不正アクセス 例えば 信頼されているユーザーに偽装して 信頼されているユーザーのみが表示またはダウンロードできる情報にアクセスされる可能性があります 傍受 制限されている機能を許可するかどうかを決定します 所属グループまたは開発者が指定した他の基準に基づいて特定の機能またはコンポーネントにアクセスできます 指定したディレクトリと下位のディレクトリ内で 暗号化 暗号化と復号が 有効なシステムユーザーであるかどうかが確認されます 機密情報にアクセスする可能性があります 次のタスクを実行できます 次の方法でセキュリティリスクを軽減するのに役立ちます 無効化 特定のシステムまたはデータソースへのアクセスを完全に許可または禁止するのは比較的簡単ですが 発信データを暗号化するための秘密鍵がサーバーにあります 着信データを復号し 複数のセキュリティサンドボックスを設定できます 詳細については 認証 認証されたユーザーは 認証では 開発環境や実行環境に影響を与える可能性のあるセキュリティリスクを十分理解する必要があります 開発用のセキュリティ 領域では 顧客がクレジットカード番号を入力する 高度にセキュリティ保護された環境を提供しています";
              var n="WSc3ff6d0ea77859461172e0811cbf363b95-7ff6";
              top.sc1[64] = t;
              top.sc2[64] = p;
              top.sc3[64] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363b95_7ffb() {
              var t="パスワード保護の使用";
              var p="2004 500 8 admin administrator builder cf coldfusion dreamweaver homesite mx rds report web および から このパスワードの入力を要求するプロンプトが表示されます この作業はサーバーを使用していないとき すべてのデータソース接続はリセットされます そのため で でファイル関連のダイアログボックスに使用されるアプレットも無効になります によって割り当てられたデフォルトのシード値 にアクセスしようとすると に加えられるのを防止できるため に移動し のアプリケーションやドキュメントディレクトリへのアクセス許可を設定できるかどうかは のインストール時に設定した場合 のパスワード保護 へのアクセスのセキュリティはデフォルトで有効です へのアクセスをパスワードで保護することにより または またはユーザーが指定したシード値を変更するには をクリックします を無効にすると を無効化する場合や を開くと アクセスに対するパスワード保護を インストール後の インストール時に入力したパスワードは サーバーおよびオペレーティングシステムのセキュリティ設定によって決まります サーバーへのアクセスが制限されます シード値を変更すると セキュリティ セキュリティを使用してアクセスを試みるときに セキュリティを使用する場合は セクションで新しいシード値を デフォルトのパスワードとして保存されます データソースパスワードを暗号化するための新しいシード値を指定できます パスワード パスワードの使用を強くお勧めします パスワードを変更する場合は パスワードを無効化または変更するには パスワードを要求するプロンプトが表示されます パスワードシード パスワード保護の使用 パスワード保護を有効にすると パスワード暗号化に使用するシードの設定変更 ページを使用します 初期段階に行うことをお勧めします 変更の送信 文字から 文字の間で指定します 認可されない変更が";
              var n="WSc3ff6d0ea77859461172e0811cbf363b95-7ffb";
              top.sc1[65] = t;
              top.sc2[65] = p;
              top.sc3[65] = n;
          }
  
          function fWSA25F4E98_110A_4092_9F3F_A5D6A8B0BCFA() {
              var t="ユーザーに対するサービスの公開";
              var p="amf cfchart cfdocument cfimage cfmail cfpdf cfpop coldfusion ctrl flash ip remoting soap web および これらのサービスには これらのサービスのユーザーアクセスコントロールを設定することもできます これを行うには すべてのサービスが では また をクリックして を使用してアクセスできます アップロードサービス アドレスの範囲を設定します キーを押しながら サービスとして公開されます サービスへのアクセスを許可するクライアントの セキュリティ セクションで デフォルトでは ドロップダウンリストに表示されます ページの ボタンをクリックします ユーザーによるアクセスを許可するサービスを選択して ユーザーに対するサービスの公開 ユーザーのアクセスを許可するサービスを選択できます ユーザーの編集 ユーザーマネージャ ユーザー設定の変更を有効にします 不明なアプリケーションやユーザーによるアクセスを防止できます 公開されているサービスをセキュリティで保護すると 公開されるサービスには次のものがあります 公開サービス 既存のさまざまなエンタープライズサービスが 禁止されているサービス";
              var n="WSA25F4E98-110A-4092-9F3F-A5D6A8B0BCFA";
              top.sc1[66] = t;
              top.sc2[66] = p;
              top.sc3[66] = n;
          }
  
          function fWS8193FF16_0341_45c4_AF9C_047EB392A0A7() {
              var t="公開サービスにアクセスするための ip アドレスの設定";
              var p="ip に移動します をクリックして をクリックします アドレス アドレスの表示 アドレスの設定 アドレスを削除します アドレスを削除するには アドレスを指定して アドレスを設定するには アドレスを追加するには アドレスを選択します セキュリティ フィールドで リストから 使用できる 公開サービスにアクセスするために 公開サービスにアクセスするための 公開サービス用に選択した 削除 追加 選択の削除";
              var n="WS8193FF16-0341-45c4-AF9C-047EB392A0A7";
              top.sc1[67] = t;
              top.sc2[67] = p;
              top.sc3[67] = n;
          }
  
          function fWSe61e35da8d318518_32a693a2134f111bf34_8000() {
              var t="coldfusion administrator へのアクセスの制限";
              var p="10 access add addresses administrator coldfusion have ip localhost remove which will この操作を繰り返します さらに つまり で始まるすべての とすべての と指定すると に移動します へのアクセスの制限 へのアクセスを制限できます をクリックします アクセスを許可する必要がある アドレス アドレスから アドレスのアクセスが許可されます アドレスを指定します アドレスを追加するには サーバーにアクセスできます セキュリティ テキストボックスに デフォルトでは 使用できる 正規表現がサポートされています 追加";
              var n="WSe61e35da8d318518-32a693a2134f111bf34-8000";
              top.sc1[68] = t;
              top.sc2[68] = p;
              top.sc3[68] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fc8() {
              var t="サンドボックスセキュリティの使用";
              var p="1 2 207 220 3 80 88 a access adminapi administrator adobe all api args auth bin c cachegetproperties cachesetproperties cf cfc cfhttp cfide cfldap cfmail cfpop cfregistry cfscript cftags cfusion coldfusion coldfusion10 com config createobject customtags d dev dir directory diskstore djava ehcache files ftp getproperty ibm inetpub inf io ip j2ee jaas java jvm lang ldap lib lightweight manager meta mytestapps neo openoffice org path pix policy program protocol qa rnd root runtime sales security securitymanager servers someservername system taglib temp tld tmpdir tomcat web websphere writeoutput www wwwroot xml および およびポート範囲を指定します およびリソース およびリソースを決定します があります があるファイルパスはすべてのファイルを指します がある場合は が実行されている必要があり ここでは ここには この このオプションの場合はサブディレクトリ内のファイルには一切アクセスできません このサンドボックスが このサンドボックスにある このサンドボックス内で実行された外部リソースタグは このサンドボックス内の このサンドボックス内のページが このタブに値を設定した場合 このフォルダには このボタンには このポートとそれ以下 この名前は この引数は この後の手順では この階層形式のセキュリティにより これが初期ページです これによって顧客が別の顧客のデータソースやファイルにアクセスするのを制限できます これらの すべてのサーバーおよびポートへのグローバルアクセス すべてのデータソース そのような関数の例としては そのアプリケーションサーバーでセキュリティマネージャー そのタグを無効にしても問題ありません その後でサンドボックスを設定して その設定が ただし たとえば つのワイルドカード文字を使用する方法については で です で定義 とは と入力し と入力します と表示されます どのタグ など などの他のタブで無効にする項目を選択する場合とは異なります には にアクセスするには に対して読み取りまたは書き込みを行う関数が正しく動作しない場合があります に対する実行権限 に対する読み取り権限 に対する読み取り権限を付与しないと に適用されません の のオンラインヘルプを参照してください のサンドボックス設定が のリソースを操作する のルートディレクトリ の使用 の共有サーバー上で複数のクライアントにホスティングしている の場合 の後の文字は重要です の設定のほうが優先されます は また または またはアスタリスク またはドメイン名 または外部サーバー または既存のサンドボックスを選択してその設定を新しいサンドボックスにコピーします または絶対パスのいずれかでなければなりません や を をオフにするには をクリックして をクリックします を使用して接続できる を使用するには を使用できるかを指定できます を参照してください を指定します を選択して を開きます アイコンをクリックします アクセス許可 アドレス アドレスとポート番号を入力します アプリケーションが必要とするタグ アプリケーションとその使い方を解析し インジケータ エンタープライズ版では エンタープライズ版のみ オペレーティングシステムのファイルベースのアクセス許可と連動します サブディレクトリのサンドボックスを定義した場合には サブディレクトリのリストにもアクセスできます サブディレクトリは親の設定を継承しなくなり サンドボックス サンドボックスについての注意事項 サンドボックスのサブディレクトリは サンドボックスの変更を保存します サンドボックスの外側にあるディレクトリへのアクセスを有効にするときは サンドボックスの外側にあるファイルへのアクセスを有効にするときは サンドボックスの外側のファイルおよびディレクトリにアクセスできるようにします サンドボックスの権限を付与する必要があります サンドボックスの設定 サンドボックスを追加する サンドボックスセキュリティ サンドボックスセキュリティの使用 サンドボックスセキュリティの設定は サンドボックスセキュリティは有効になっていません サンドボックスセキュリティを サンドボックスセキュリティを使用すると サンドボックスセキュリティを有効にした状態で サンドボックスセキュリティ許可 サンドボックス内での サンドボックス内でのキャッシングの使用 サンドボックス内でのサービス サンドボックス内でディスクベースのキャッシングを使用するには サンドボックス内の サンドボックス内のアプリケーションが サンドボックス内のタグおよび関数が サードパーティリソースを呼び出す サーバー サーバーなどローカルリソースへのアクセスを有効にしてください サーバー名 スタンダード版では スタンダード版ではリソースセキュリティ スタンダード版の場合は セキュリティ セキュリティサンドボックスの設定を開始する前に セキュリティサンドボックスの追加 セキュリティ制限の適用対象となるサイト内の所定のディレクトリです タグ タグおよび関数からサンドボックスの外側にあるファイルやディレクトリに対して実行可能なアクションも指定できます タグおよび関数は指定したディレクトリ内のすべてのファイルにアクセスできる他 タグが使用できるサーバー タグによるサイト全体へのアクセスを拒否するには タグの使用を制限します タグをハイライトし タグを使用しない場合は タグを無効にするには タブおよび タブの左側の列で タブの左側の列で関数を強調表示して タブは タブは有効になりません タブをクリックします チェックボックスをオンにすると ディスクキャッシュディレクトリに対する読み取り ディスクキャッシュ用のディレクトリを指定するには ディレクトリ ディレクトリでは元の設定が保持され ディレクトリと ディレクトリとそのサブディレクトリでは ディレクトリとアクセス許可について ディレクトリにあるファイルを読み取ることができます ディレクトリにも適用されます ディレクトリにサンドボックスを定義した場合には ディレクトリに対する意味 ディレクトリのサンドボックスも定義した場合は ディレクトリの削除 ディレクトリの名前または ディレクトリの設定よりも ディレクトリへのアクセスを許可します ディレクトリ内のすべてのファイルのリスト ディレクトリ名 デフォルトで デフォルトでは デフォルトのディレクトリ デフォルトの動作 デフォルトサンドボックスをベースにしてサンドボックスを作成するか データソース データソースなど データソースの使用を制限します データソースを無効にするには ドロップダウンリストから パスの編集 パスの追加 ファイル ファイルおよびディレクトリのアクセス許可の関係を示します ファイルに対する意味 ファイルの ファイルのパス ファイルのパスおよびその権限が ファイルのパスが正しいことを確認します ファイルの削除 ファイルの実行 ファイルの表示 ファイルへの書き込み ファイルまたはディレクトリを入力して ファイルまたはディレクトリを有効にするには ファイルシステムにアクセスする ファイルベースのアクセス許可を使用します ファイル名を指定します フィールドに ブラウズします プロパティで指定されたユーザー設定ディレクトリを使用できます プロパティを使用します ページ ページが表示されます ページで有効化するまで ページについて ページの場所を使用して ページは ページはすべてのデータソースにアクセスできます ページを開きます ホスティング管理者の場合は ボックスに ボックスに新しいサンドボックスの名前を入力します ポート ポート番号 マッピング メール ユーザーが別のユーザーのディレクトリをブラウズしないように制限するには リストされたタグすべてにアクセスすることができます リストされた関数すべてにアクセスすることができます リストで リストに新規サンドボックスが表示されます リストに表示されます リソースへのアクセスを制御します リソースセキュリティ ルートセキュリティコンテキストが唯一のサンドボックスです ルートディレクトリ レジストリ レベル上のディレクトリの設定を継承します ログなど ローカルメールサーバーや 一時ディレクトリを指定するには 上の 以下にある 例 保護されたファイルとディレクトリ 円記号 円記号とアスタリスク 円記号とハイフン 円記号の後ろにアスタリスクを付けると 円記号の後ろにダッシュを付けると 再帰的にサブディレクトリ内のすべてのファイルにもアクセスできます 列に 列に移動すると 制限できるのは 制限できるリソース 削除 右矢印をクリックします 各タブの使い方を説明します 各顧客に対してサンドボックスを設定することができます 外部リソースにアクセスするタグ 定義されたディレクトリ権限 定義済みのディレクトリ権限の初期リストが存在しません 実行 引数を定義する必要があります 必要なリソースへのアクセスを有効化することや 必要に応じてポートの制限も指定できます 指定されたサーバーおよびポートのみにアクセスできます 指定できるのは 新しいデータソースはすべて無効になります 新規のサンドボックス 既存のサンドボックスを編集するときは 書き込み 書き込み権限をサンドボックスで付与する必要があります 有効にする項目を選択するのであって 有効化されたデータソース 次の 次のようにダッシュ 次のコードを使用します 次のディレクトリの例を考えてみます 次のファイルパスに対して 次のリソースです 次の手順を実行します 次の権限を付与する必要があります 次の表に 無効にするデータソースをハイライトし 無効化されたデータソース 特定のディレクトリとその下位ディレクトリにある 特殊トークン 異なるセキュリティレベルのユーザーへのパーソナライズされたサンドボックスの設定が可能です 終了 編集 行で定義します 複数のサンドボックスの使用 複数のセキュリティサンドボックスを定義できます 複数のタブがあるページが表示されます 親のディレクトリのサンドボックス設定は完全に上書きされます 設定で使用するには 設定で実行する場合 該当なし 詳しくは 詳細については 読み取り 読み込み 追加 追加するすべてのデータソースが有効になります 適切なタグおよび関数の使用を無効にすることができます 適切な権限を選択します 関数 関数の使用を制限します 関数を無効にするには";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fc8";
              top.sc1[69] = t;
              top.sc2[69] = p;
              top.sc3[69] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363c31_7ff4() {
              var t="複数のサーバーインスタンスの使用";
              var p="10 coldfusion jrun tomcat が組み込まれます のインストーラーでは の代わりに をスタンドアローンモードでインストールした後 エンタープライズ版またはデベロッパー版のライセンスがある場合は スタンドアローンインストールでは スタンドアローンインストールのみをインストールできます マルチサーバーインストールを作成できましたが 以前のバージョンの 複数のインスタンスおよびクラスタを作成できます 複数のサーバーインスタンスの使用";
              var n="WSc3ff6d0ea77859461172e0811cbf363c31-7ff4";
              top.sc1[70] = t;
              top.sc2[70] = p;
              top.sc3[70] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363c31_7ff5() {
              var t="複数のサーバーインスタンスについて";
              var p="1 administrator cfm coldfusion html java jvm tomcat web いずれかのサーバーインスタンスが停止した場合は別のサーバーインスタンスにリクエストを転送することで ここでの説明は その場合は それらのサーバーをクラスタに追加することもできます それらのサーバーインスタンスを だとすると つのアプリケーションで問題が発生しても他のアプリケーションに影響を与えません つのクラスタに追加します では の の複数のインスタンスを実行することには また または を参照してください を自動的に配信しません アプリケーションのコンテキストルートが空 アプリケーションのルートの下に アプリケーションのルートの下を使用できます アプリケーションの隔離 アプリケーションルートからファイルを配信できるようにする必要があります アプリケーションルート以下のページに アプリケーション用にコンテキストルートを指定していることを前提としています クラスタリング コネクタはスタティックコンテンツ サーバーに接続し サーバーのルートから サーバーのルートの下 サーバーインスタンスやクラスタを作成できます サーバーコネクタは負荷分散を自動的に管理し サーバーコネクタを使用してアクセスする場合 サーバーマッピングを定義して デフォルト パフォーマンスと安定性を最適化します ファイルの位置についての注意事項 ページの格納場所として ページやイメージファイル ページを格納し ページを配信する場合の詳細については リモートの ロードバランスとフェイルオーバー 上で実行されるので 仮想マシン 各サーバーインスタンスが別の 各サーバーインスタンスに個別のアプリケーションをデプロイできます 各サーバーインスタンスに同じアプリケーションをデプロイし 外部 次のような利点があります 複数のサーバーインスタンスについて 設定内容はサーバーインスタンスごとに個別に保持されます";
              var n="WSc3ff6d0ea77859461172e0811cbf363c31-7ff5";
              top.sc1[71] = t;
              top.sc2[71] = p;
              top.sc3[71] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fd4() {
              var t="追加サーバーインスタンスの定義";
              var p="administrator coldfusion の複数のインスタンスを作成できます を使用して 追加サーバーインスタンスの定義";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fd4";
              top.sc1[72] = t;
              top.sc2[72] = p;
              top.sc3[72] = n;
          }
  
          function fWSAB4367BA_6D91_4c69_8DBA_E2839394658A() {
              var t="サーバーインスタンスの定義";
              var p="1 2 administrator coldfusion web windows この場合 で であるとします にアクセスします にチェックを付けます のインスタンスを作成します をインストールした後 をクリックします を使用して インスタンスがクラスタの一部である場合のみです インスタンスが担当する付加を表しています インスタンスマネージャに移動します インスタンスマネージャーで インスタンスマネージャーを編集できます エンタープライズマネージャ オプション サイトを開始 サーバーインスタンスの定義 サーバーポートおよび負荷分散係数を編集します サーバー名とサーバーディレクトリを入力します サービスの作成 スタンドアローンモードで 例えば 倍のリクエストを受け取ります 停止 内部 再起動 削除またはアクセスするか 新規インスタンスの追加 最初のインスタンスの負荷分散係数が 番目のインスタンスの負荷分散係数が 番目のインスタンスは 編集アイコンをクリックすれば 負荷分散係数が適用されるのは 負荷分散係数は 送信";
              var n="WSAB4367BA-6D91-4c69-8DBA-E2839394658A";
              top.sc1[73] = t;
              top.sc2[73] = p;
              top.sc3[73] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fc0() {
              var t="アプリケーションの隔離の有効化";
              var p="1 anothercompany apache cf cfm coldfusion com http iis ip j2ee mycompany services tomcat web windows www および ここでは この この場合 この方法で複数の独立したアプリケーションを実行することには この概念を表す用語は この設定では すべての そのような それぞれに対して別の それぞれ別の ただし たとえば つの では では個別の では複数の仮想ホストを作成します と と同様に の の両方 の場合 はコンテキストルートですが またはサイト をサポートし を割り当てるのが普通です を参照してください を定義し を実行する場合の手順を説明しますが を実行する場合も原理は同じです を指定して を指定します アドレスまたはドメイン名 アプリケーションが動作している場合は アプリケーションごとに異なるコンテキストルートを使用する必要があります アプリケーションに影響を与えません アプリケーションのディレクトリ構造とは関連していません アプリケーションの隔離の有効化 アプリケーションの隔離を完全に実現するには アプリケーションを実行する個別のサーバーインスタンスを作成すると アプリケーションサーバーで アプリケーションサーバーにも同等の機能があるので アプリケーションサーバーに外部 アプリケーションレベルまたは インストール エンタープライズ版のライセンスが必要です コンテキストルート コンテキストルートが コンテキストルートの詳細については サイト サイトを作成します サーバーで複数の サーバーとの統合機能があるわけではありません サーバーに サーバーによって異なります サーバーのリソースを個別に割り当てることができます サーバーの機能を使用して サーバーを サーバーレベルでエラーが発生しても サーバー版でのみ使用可能 ページにアクセスするには ページにアクセスできます ページ名 ホスト名 マルチサーバー設定で マルチホームサーバーをサポートできます ユーザーが ユーザーは ルートの内容を提供できます 他の 使用する 個 台のコンピュータ上に構成し 台のコンピュータ上に複数のサーバーインスタンスを作成する方法を説明しています 各アプリケーションに 各アプリケーションをそれぞれ名前の付いたコンテキストルートにデプロイするものと仮定します 各アプリケーション用に個別の 各コンピュータ上に個別の 各サーバーインスタンスごとに仮想ホスト 同じサーバーインスタンスで別の 次のような利点があります 次の手順では 複数のサーバーインスタンスを実行する単一の外部 複数台のコンピュータ上にサーバーインスタンスを作成するには 設定をデプロイする場合もほとんどの概念がそのまま通用します 詳細については";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fc0";
              top.sc1[74] = t;
              top.sc2[74] = p;
              top.sc3[74] = n;
          }
  
          function fWSf01dbd23413dda0e_25e72d5d120574d8991_8000() {
              var t="複数のサーバーインスタンスを使用したアプリケーションの隔離";
              var p="1 6 coldfusion html web ここまでの手順を繰り返します つ作成します に進みます の手順に従って または使用する を作成します を参照してください アプリケーションの アプリケーションの仮想 アプリケーションの移植性のために アプリケーションをテストします アプリケーションルートまたは仮想 アプリケーションルートを使用することをお勧めします サイト サイトとサーバーインスタンスとの接続を設定します サイトの サイトをテストし サーバーに応じた手順で サーバーに応じた方法で サーバーのマニュアルを参照してください サーバーを使用する場合は サーバーインスタンスごとに ビルトインの ファイルを ページが正しく配信されることを確認します ルートに格納します 下の手順 仮想 使用する 別の 別個のサーバーインスタンスをもう 各仮想 複数のサーバーインスタンスを使用したアプリケーションの隔離 詳細については";
              var n="WSf01dbd23413dda0e-25e72d5d120574d8991-8000";
              top.sc1[75] = t;
              top.sc2[75] = p;
              top.sc3[75] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fc4() {
              var t="アプリケーションの隔離を行う場合の web サーバー設定";
              var p="1 2 8014 ajp ajp13 apache apacheroot cf cfusion coldfusion conf config gui host html httpd iis jk jkmountfile list localhost mod mx one port properties root runtime server server1 sun type uriworkermap uriworkermap1 vh1 vh2 web worker workers wsconfig xml および ここでは この手順では これは すべてのスタティックコンテンツ つに格納します つの つのインスタンスがあるものとします で で確認できます という となっている必要があります にある にコピーします に含まれます に置き換えます に追加します の のようにします のインスタンスごとに実行します のインスタンスです の仮想 の内容を の組み合わせごとにフィルタとマッピングを定義します の説明に従って作成されていることを前提に説明します は また またはそのサブディレクトリの を を使用した を使用する場合にアプリケーションを隔離するための複数のサーバーインスタンスの設定 を参照してください を選択してください アプリケーションのオプション アプリケーションのルートディレクトリから配信するスタティックコンテンツの量は極力少なくしてください アプリケーションの隔離のための複数のサーバーインスタンスの設定 アプリケーションの隔離を行う場合の アプリケーションを隔離するために複数のサーバーインスタンスを使用する場合 インスタンスがマップされます インスタンスに コネクタ関連のファイルを サイトおよびサーバーインスタンス間の通信を設定する手順は サイトが サイトとサーバーインスタンスの個 サイトにつき サイトを使用する場合は サーバーで複数のサーバーインスタンスを使用する場合 サーバーによって異なります サーバーのルートディレクトリ サーバーの設定 サーバーを設定します サーバーインスタンスに サーバーインスタンスを指定する必要があります サーバー上でのアプリケーションの隔離の設定 サーバー設定 サーバー設定ツールを サーバー設定ツールを実行する方法の詳細については ツールを使用して パフォーマンスを向上するには ファイルは ファイルやイメージなど ファイルを手作業で編集します フォルダーに作成します ポートで ポートは 上でのアプリケーションの隔離の設定 仮想 仮想ホストを設定します 例えば 個 各 各仮想ホストで 回ずつ 外部 実行のたびに異なるサイトとサーバーを指定します 実行のたびに異なる設定ディレクトリと 既にサーバーインスタンスが 既にサーバーインスタンスと仮想 次のブロックを追加します 次の行を追加します 環境で 環境で複数のサーバーインスタンスを含む複数の仮想ホストを使用する場合は 繰り返し実行します 複数のサーバーインスタンスを持つ複数の仮想 複数のサーバーインスタンスを持つ複数の仮想ホストを使用する場合は";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fc4";
              top.sc1[76] = t;
              top.sc2[76] = p;
              top.sc3[76] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363c31_7ffa() {
              var t="クラスタリングの有効化によるロードバランスとフェイルオーバーの実現";
              var p="0 1 100 228 3000 4 4003 45564 45565 500 5000 6 8 address adminapi administrator apache auto autobind catalina cfc cfccomponent cfide cfroot cfset cfusion channel channelsendoptions check classname cluster clusterlistener clustersessionlistener coldfusion component conf config createobject datasource datasourcecomponent deltamanager droptime engine expiresessionsonshutdown false filter frequency group groupchannel ha host instance interceptor interceptors j2ee jvm jvmroutebindervalve jvmroutesessionidbinderlistener manager maxthreads mcastservice membership messagedispatch15interceptor name nio nioreceiver notifylistenersonreplication org pooledparallelsender port receiver replicationtransmitter replicationvalve runtime selectortimeout sender server session simpletcpcluster solr tcp tcpfailuredetector testdsn tomcat transport tribes true valve verifydsn web xml いずれかのサーバーインスタンスが停止した場合は別のサーバーインスタンスにリクエストを転送することで がリクエストを自動的に転送します この動作のためにパフォーマンスが低下する可能性があります したがって すべてのインスタンスを再起動します そのインスタンスに必ずマッピングされるようになります そのクライアントからのそれ以降のすべてのリクエストが そのセッションで配信されるすべてのページでデータにアクセスすることができます その情報をデータベース内のクライアント変数に格納することを検討してください それらのインスタンスを ただし つのクラスタに追加します つのクラスタ内で複数台のコンピュータを使用してください で です でのクラスタ設定について詳しくは で有効になっていない場合 とはエンタープライズレベルの機能で にアクセスできるようになります にクラスタブロックを追加します のインスタンスを実行してサーバーの負荷を分散させている場合 のシリアル化により のシリアル化を有効にするには のメソッドにアクセスしてメソッドを呼び出すことができます また または変数内の配列のレプリケーションはサポートされません をクリックします を使用して を使用してクラスタを管理します を参照してください を同じにする必要があります を含む を有効化してください を格納して を設定します アプリケーションおよび設定内容を複数のサーバーインスタンスにデプロイし アプリケーションサーバーがクラスタ内にある複数のサーバーインスタンスへと自動的にリクエストを分散させることです インスタンスにセッションが確立された後 インスタンスをクラスタに追加します エンタープライズマネージャ エンタープライズ版ライセンスを購入する必要があります エントリと エントリの間に次のブロックを追加します エントリ内のメンバーシップポートをクラスタのマルチキャストポートで更新します クラスタが動作するには クラスタで クラスタにリモートインスタンスを追加するには クラスタへのリモートインスタンスの追加 クラスタを作成すると クラスタマネージャをクリックします クラスタメンバーをグループ化するために使用されます クラスタリングの有効化によるロードバランスとフェイルオーバーの実現 クラスタリングを使用すると クラスタ内のすべてのインスタンスでセッションデータの クラスタ内のすべてのサーバーインスタンスに対して クラスタ内のサーバーインスタンスでセッションフェイルオーバーを実装するには クラスタ内のサーバーインスタンス間でセッション情報をリアルタイムに調整する機能です クラスタ名をクリックして クラスタ名を入力して コレクション サーバーインスタンスのクラスタの設定 サーバーコネクタは負荷分散を自動的に管理し スティッキーセッションが必要かどうかを指定します スティッキーセッションでは スティッキーセッションを有効にする場合は セッションが セッションを有効化します セッションスコープに大量の情報を格納していると セッションスコープに格納する情報が大量になると考えられる場合は セッションスコープ内に格納された セッションスコープ変数もクラスタ内で複製されます セッションデータは セッションフェイルオーバーの場合は セッションレプリケーションではセッションスコープの セッションレプリケーションは セッションレプリケーションは正しく機能しません セッションレプリケーションを使用し セッションレプリケーションを使用するクラスタの場合 セッションレプリケーションを使用する場合は セッションレプリケーションを有効にすると セッション内に有用なデータ デプロイするアプリケーションおよび設定するリソース データソース ネットワークに接続されている必要があります パフォーマンスと安定性を最適化します ファイルにポートが追加されます ファイルを開きます フェイルオーバーが発生したら フェイルオーバーの後でもセッションスコープで使用できます ページに移動して マッピングなど マルチキャストポートについて詳しくは マルチキャストポートのデフォルト値は マルチキャストポートは マルチキャストポートを編集します メモリ変数 リモートインスタンスとローカルインスタンスの リモートインスタンスの リモートインスタンスをローカルマシンに登録します リモートインスタンスを登録して ルートを同じにしないでください ローカルインスタンスとリモートインスタンスをクラスタに追加します ローカルホストの ローカルマシンでクラスタを作成します ロードバランス ロードバランスとフェイルオーバーのための ロードバランスとフェイルオーバーを実現するには 使用するコンピュータごとに個別の 例えば 元のサーバーインスタンスが停止した場合でも 内にデータを保持してアクセスすることもできます 動作中の他のサーバーへと 動作中の他のサーバーインスタンスへとアプリケーションサーバーがリクエストを転送できます 各インスタンスとも 各サーバーインスタンスでセッションレプリケーションを有効化します 同じ 変化するたびにクラスタ内の他の各サーバーへとコピーされます 必要に応じて 最大限のフェイルオーバー保護を実現するには 構造体は 次に 次のように 次のようにセッションで 現在のサーバーが使用不可能な場合に 複数の 要件に基づいてサーバーをクラスタに移動します 追加 送信";
              var n="WSc3ff6d0ea77859461172e0811cbf363c31-7ffa";
              top.sc1[77] = t;
              top.sc2[77] = p;
              top.sc3[77] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363c31_7ff2() {
              var t="リモートサーバーインスタンスに関する coldfusion administrator での定義";
              var p="8985 admin administrator ajp bio cfroot cfusion coldfusion conf etc http ip jetty jvm mortbay org runtime server socketconnector tomcat xml この機能を有効にするには これらのポートは で です での定義 という文字列を検索します の新規リモートインスタンスを登録します をクリックします を使用して を参照してください を開きます アドレスでホストを更新します インスタンスの インスタンスを識別するために使用される文字列です インスタンスポートはコネクタポートです インスタンスマネージャ インスタンス名 インスタンス名は エンタープライズマネージャ コンポーネントのデフォルトポートは コンポーネントのパスワードを入力します コンポーネントのポート コンポーネントのユーザー名および コンポーネントをインストールします サーバーを再起動します スティッキーセッションを有効にして ファイルに指定されています フォルダーにある ポート ポートがインスタンスマネージャページに表示されます ポートで リモートインスタンスとローカルインスタンスをクラスタに追加した場合は リモートインスタンスの登録をクリックします リモートインスタンス名です リモートサーバーインスタンスに関する リモートホスト リモートホストで リモートホストに リモートホストの リモートポート リモートポートと リモートポートは ルート ルートについて詳しくは ルートは ルートを設定することはできません ワーカーに対する識別子として機能する属性です 両方のインスタンスに同じ 特定の 経由のリモート起動機能とリモート停止機能が必要な場合は 負荷分散係数などの詳細を指定します 送信";
              var n="WSc3ff6d0ea77859461172e0811cbf363c31-7ff2";
              top.sc1[78] = t;
              top.sc2[78] = p;
              top.sc3[78] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff7() {
              var t="coldfusion サーバーモニタの使用";
              var p="coldfusion また エラーといった クエリー サーバーについての情報を確認できます サーバーのステータスを追跡する場合は サーバーのスナップショットを撮ったりできます サーバーモニタの使用 サーバーモニタを使用すると サーバー上のアクティビティを追跡できます サーバー情報の収集を開始および終了したり マルチサーバーモニタを使用します メモリ使用量 リクエスト 複数の";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ff7";
              top.sc1[79] = t;
              top.sc2[79] = p;
              top.sc3[79] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7fce() {
              var t="coldfusion サーバーについての情報の収集";
              var p="coldfusion jvm およびスレッド およびタイムアウト アラート アラートおよびエラー エラー クエリー サーバーについての情報の収集 サーバーについての情報を取得できます サーバーのステータスを追跡するのに適しています サーバーモニタではマルチサーバーモニタより詳細な情報が提供されますが サーバーモニタとマルチサーバーモニタを使用すると サーバーモニタは サーバー情報のスナップショット セッション マルチサーバーモニタは マルチサーバーモニタは複数の メモリ使用量 リクエスト 応答時間 次の情報を提供します 通常";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7fce";
              top.sc1[80] = t;
              top.sc2[80] = p;
              top.sc3[80] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff1() {
              var t="coldfusion サーバーモニタの開始";
              var p="access administrator cfide cfml coldfusion crossdomain multiservermonitor policy swf web xml および およびメッセージボックスのデータを更新します からアクセスする このファイルは このファイルを この情報を開発サーバーで使用できます この情報収集によって すべてのアプリケーションとサーバースコープでのメモリ使用量 すべてのリクエストについての情報の収集を開始します すべての統計情報をリセット に配置されていました の低速なリクエストやメモリ消費量の多いリクエストごとに詳細を表示できます をクリックします を参照してください を選択し を選択して を開始します アクション アクティブなクエリー アクティブなセッション アクティブなリクエスト アクティブなリクエストのレポートの アプリケーションです アプリケーションのボトルネックを特定できます エラーが発生したリクエスト キャッシュクエリー クエリーキャッシュのステータスについての情報 クエリー関連のレポートを表示するには クロスドメインに関する詳細は サーバーについての情報を提供する サーバーのアラートなどの情報を収集できます サーバーの監視 サーバーの詳細情報を収集するには サーバーモニタ サーバーモニタの上部のバーにあるボタンをクリックします サーバーモニタの起動 サーバーモニタの開始 サーバーモニタは サーバーモニタはオフになっています サーバーモニタを使用します サーバーモニタを開始すると サーバー上で収集されたすべての統計情報をリセットします スタックトレース タイムアウトしたリクエスト テンプレートキャッシュのステータス デフォルトでは データの収集と表示が開始されます データベースプールのステータス ヒット数の多いリクエスト ファイルで指定し フィルタの設定 プロファイリング プロファイリングが有効な場合は プロファイリングとメモリトラッキングを有効にする必要があります プロファイリングについての情報の収集を開始します プロファイリングを有効にする必要があります プロファイリングを開始 プロファイリング情報を収集するには ページで除外されたリクエストについての情報は収集しません ページ上のすべてのグラフ ボタン マルチサーバーモニタの起動 マルチサーバーモニタの開始 マルチサーバーモニタは マルチサーバーモニタを使用します メモリトラッキングを有効にします メモリトラッキングを開始 メモリトラッキングを開始または終了するには メモリ使用量の多いクエリーのレポートを表示するには メモリ使用量の多いリクエストのレポートでの最大の変数に関するプロファイリング情報などを収集できます メモリ消費量が最も高い変数を確認できます メモリ消費量についての情報の収集を開始します リクエストスロットルデータ ルート ルートの直下に配置する必要があります レポート 低速なクエリー 低速なリクエスト 低速なリクエストのレポートのタグや関数のタイミング情報 個 全体的なメモリ使用量 実行速度に影響を及ぼしているタグや関数を特定したり 実行頻度の高いクエリーなどの情報を収集できます 従来 必要であれば 更新 最もメモリを使用しているクエリーとセッション 有効にするとサーバーの動作が大幅に遅くなります 本番サーバーではこれらのオプションを有効にしないでください 次の表は 特定の 監視 監視を開始 累積サーバー使用量の多いリクエスト 複数の 複数のサーバーの情報を収集するには 詳細については 開始ボタンをクリックしたときにサーバーモニタが収集するデータを示しています";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ff1";
              top.sc1[81] = t;
              top.sc2[81] = p;
              top.sc3[81] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff3() {
              var t="サーバーモニタのレポートの表示";
              var p="30 5 およびクエリーのメモリ使用量を追跡します およびクエリーの実行時間の監視を有効にします およびメモリトラッキングのどの機能を有効にするかで さまざまなスコープでのメモリ使用量の追跡を有効にします すべてのクエリーのレポートでは すべてのグラフは すべての監視を有効にします たとえば のタグ または指定した最近の一定期間内に収集したデータを表示します をクリックします グラフのデータを サーバーモニタが収集するデータが決まります サーバーモニタでは サーバーモニタのレポートの表示 サーバーモニタはデフォルトで サーバーモニタは個 サーバーモニタを開始すると プロファイリング プロファイリングも有効になっていれば プロファイリングを有効にする必要があります プロファイリングを開始 ページが表示されます ページに戻るには メモリトラッキングを有効にした場合はパフォーマンスに大きく影響することがあります メモリトラッキングを開始 レポートのデータを 他のページから 個 収集したすべてのデータ 概要 次のボタンを使用して有効と無効を切り替えることで 監視 監視とプロファイリングを有効にした場合のパフォーマンスへの影響はほとんどありませんが 監視を開始 秒ごとに 秒ごとに取得します 詳細を制御できます 関数";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ff3";
              top.sc1[82] = t;
              top.sc2[82] = p;
              top.sc3[82] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff5() {
              var t="概要";
              var p="1 10 20 4 40 5 coldfusion kb mb このページには さらに すべてのアラートをリストします または過去 を選択します アラート アラートが生成される条件を指定するには アラートの設定 アラートは エラーが発生したリクエスト サーバーが無応答状態に近づいているか サーバーの全体的なパフォーマンスの目安と サーバーモニタを開始すると サーバー上のいずれかのアプリケーションによって生成された最新のエラーです サーバー開始時から収集されたデータ タイムアウトしたリクエスト ドロップダウンリストをクリックして フィルタの設定 ページが表示されます ページで指定されたインクルードパスにある ページで設定されたしきい値よりも低速なアクティブリクエストです ページで設定されたレポートサイズによって異なります ページは リスト中のリクエストの数は 低速なアクティブリクエスト 低速なリクエスト 使用できるレポートは次のとおりです 使用可能な他のレポートをリストします 分間に収集されたデータ 分間に収集されたデータを表示します 別のレポートを表示するには 前回のエラー 名前をクリックします 実行が遅くなっていることを示します 平均で 平均応答時間 応答時間の合計をリクエスト数で割ったものです 概要 次のサイズを超過したクエリー 次のサイズを超過したセッション 次のメモリ使用量を超過したリクエスト 次のレポートが表示されます 次の時間を超過したクエリー 次の時間を超過したリクエスト 秒 秒あたりのリクエスト数 秒あたりのリクエスト数です 要約 過去";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ff5";
              top.sc1[83] = t;
              top.sc2[83] = p;
              top.sc3[83] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf364104_7fba() {
              var t="統計情報";
              var p="1 4 administrator assemblers cachedafter cachedwithin cf cfc cfm cfml cfquery coldfusion com cpu data flash http java least livecycle lru management mb recently remoting server sql used web および およびいつメモリの使いすぎが始まったかがわかります およびすべてのアクティブなアプリケーションスコープとセッションスコープの推定メモリ消費量を確認できます およびそのテンプレートでエラーが発生した回数が含まれます およびクエリーキャッシュのヒット率のグラフを表示します およびサーバーにログインしたユーザー数が表示されます および実行開始のためにアプリケーションサーバースレッドの割り当てを待っているリクエスト数が表示されます および接続数をリストします がクラスタにデプロイされている場合は がコンパイルされた がリクエストをキューに入れたときに が含まれます このレポートではクエリーの このレポートには このレポートにはキャッシュクエリーについての情報は含まれません このレポートはキャッシュクエリーについての情報は提供しません この情報によって これらのレポートにリストされたクエリーを調整します これを使用するとデッドロックしているリクエストや実行時間の長いリクエストがブロックされている場所を発見できます さまざまな しきい値が低いほど したがって すべてのアクティブなセッションをリストします すべてのリクエストのグラフを すべての現在アクティブなスレッドをリストします そのクエリーの そのクエリーのインスタンスが低速な理由を特定できます そのパフォーマンスを示します その数は つのビューに表示するには つまり高いキャッシュのヒット率が必要です で です で設定された数を超えることがあります どちらのレポートでも どちらのレポートにもキャッシュクエリーは含まれません のインスタンスの実行時間が短い場合でも のクエリーの詳細を表示できます のクエリーキャッシュを使用してクエリーをキャッシュすることでパフォーマンスを向上できる可能性があります のテンプレートの詳細を表示できます のデータソースの詳細を表示できます の設定で指定されたレポートのリクエスト間隔よりもロードに時間がかかるすべての現在アクティブなリクエストをリストします はテンプレートキャッシュにあるコンパイルされた形式のテンプレートを使用します また または またはグラフを表示できます または個 より効率的なロードバランスのためにサーバーインスタンスを追加してください より多くのリクエストがリストに表示されます より多くのリクエストがレポートに表示されます をクリックします を参照してください を選択してキャッシュのサイズを増やしてください を選択します アクティブな アクティブなクエリー アクティブなクエリーのレポートは アクティブなスレッドのリスト アクティブなセッション アクティブなセッションのリスト アクティブなセッションのレポートは アクティブなリクエスト アクティブなリクエストのリスト アクティブなリクエストのレポートは アプリケーションのクエリーキャッシュの使用方法を分析するには アプリケーションスコープ アプリケーションスコープでのメモリ使用量 アプリケーションスコープでのメモリ使用量のレポートは エラー エラーが発生したリクエスト エラーが発生したリクエストのレポートは エラーを生成したテンプレートをリストします エラーメッセージ オブジェクトのメモリ使用量情報は追跡されません キャッシュからいくつかクエリーを削除できないか判断します キャッシュされたクエリーをリストします キャッシュとソフトキャッシュの両方が含まれます キャッシュにあるテンプレート数およびキャッシュが占有する推定メモリ量を監視できます キャッシュのヒットとは キャッシュのヒット数とキャッシュのミス数の割合を示します キャッシュのヒット率が低すぎる場合は キャッシュのヒット率は キャッシュのミスとは キャッシュクエリーの数 キャッシュ機能 キャッシュ済みのクエリー キャッシュ済みのクエリーのリスト キャッシュ済みのクエリーのレポートは キューに入れられず キューに入れられます クエリーがこのレポートに表示された場合 クエリーの クエリーのリスト クエリーの個 クエリーの実行時間が短い場合は クエリーの結果が固定的である場合は クエリーをキャッシュしてメモリ消費量とネットワークのトラフィックを減らしてください クエリーを調整して結果セットのサイズを減らすか クエリーキャッシュが大きすぎる場合は クエリーキャッシュが消費する推定メモリ量 クエリーキャッシュのサイズを増やしてください クエリーキャッシュのステータス クエリーキャッシュのステータスのレポートは クエリーキャッシュのヒット率が高いほど グラフには グラフによってどのスコープがメモリを使いすぎているか ゲートウェイ コードは表示されません サーバーが現在処理しているリクエスト数 サーバーによってスロットルされたすべてのリクエストをリストします サーバーの サーバーのパフォーマンスを向上させるにはヒット数をミス数より多くすること サーバーのメモリ消費量が多すぎる場合 サーバーの設定 サーバースコープ サーバースコープでのメモリ使用量 サーバーモニタでは サーバーモニタには サーバーモニタに表示されるメモリ使用量の情報は推定であり サーバー上のアプリケーションがデータソースを使用しているかどうか サーバー上のパーシスタントスコープによる推定メモリ消費量のグラフを表示します サーバー全体のパフォーマンスの向上に役立ちます サービス スコープ スコープ変数をリストします スタックトレース スタックトレースが含まれており スタックトレースが含まれます スタックトレースは提供されません スタックトレースも表示します ステートメントが含まれます ステートメントはインスタンスによって異なる可能性があるので ステートメントを表示します スレッド スレッドがこのレポートに表示されるかどうかを決定するしきい値を指定できます スレッドのレポートは スレッドをリストします スレッドプールのサイズを増やしてください スロットルのしきい値とメモリを変更するには セクションには次のレポートがあります セクションは セッションスコープなどの タイプがメモリを消費する方式の経験的評価に基づくものです タイプとそれに対応する タイムアウトしたテンプレートをリストします タイムアウトしたリクエスト タイムアウトは タグの チャート テンプレートがキャッシュから取得されたことを指します テンプレートが初めて実行されると テンプレートが変更されない限り テンプレートが最近使用された時刻 テンプレートと テンプレートのタイムアウト回数 テンプレートのパス テンプレートのリスト テンプレートの名前と行番号でクエリーを識別できます テンプレートの最近の応答時間 テンプレートをコンパイルしてキャッシュに配置する必要があることを指します テンプレートを格納するメモリのことです テンプレートキャッシュ テンプレートキャッシュについての情報を表示して テンプレートキャッシュに格納されます テンプレートキャッシュのステータス テンプレートキャッシュのステータスのレポートは テンプレートキャッシュの数には テンプレートキャッシュは デフォルト値は データソース データソースのリスト データベース バイトコードにコンパイルされ パフォーマンスが向上します パフォーマンスを向上させるには ヒット数の多いリクエスト ヒット数の多いリクエストのリストまたはグラフを表示できます ヒット数の多いリクエストのレポートは ヒット数の多いリクエストをリストします ブラウザのリクエスト プールのステータス プールのステータスのレポートは ページでは ページではキャッシュのヒット率を監視できます ページは メモリを最も使用した メモリを最も使用したアプリケーションスコープをリストします メモリを最も使用したアプリケーションスコープ変数をリストします メモリを最も使用したクエリーをリストします メモリを最も使用したセッションをリストします メモリを最も使用したリクエストをリストします メモリ使用量 メモリ使用量のレポートの情報は メモリ使用量の多い メモリ使用量の多いクエリー メモリ使用量の多いクエリーのレポートは メモリ使用量の多いセッション メモリ使用量の多いセッションのレポートは メモリ使用量の多いリクエスト メモリ使用量の多いリクエストのレポートは メモリ使用量の要約 メモリ使用量の要約のレポートは メモリ消費量のレポートで得られる情報は絶対的な基準としてではなく リクエスト リクエストがこのページに表示されるかどうかを決定するしきい値を指定できます リクエストがスロットルされます リクエストとして リクエストには リクエストの実行中に最もメモリを使用した変数をリストします リクエストの統計情報 リクエストを処理するのに十分なメモリが使用可能でないために リクエストスロットルのメモリサイズを超えている場合は リクエストスロットルデータ リクエストスロットルデータのレポートは リストに表示するアイテム数を制限できます リストまたは詳細ビューを表示できます レポートには レポートは レポートサイズのオプションを使用すると 低速な 低速なクエリー 低速なクエリーのレポートで指定されたしきい値よりもロードに時間がかかるすべての現在アクティブなクエリーをリストします 低速なクエリーのレポートと平均で低速なクエリーのレポートを提供します 低速なクエリーのレポートは 低速なクエリーの特定のインスタンスと 低速なリクエスト 低速なリクエストのリストまたは詳細ビューを表示できます 低速なリクエストのレポートは 低速なリクエストをリストします 使用時期が最も古い 全般 内でのみ発生するので 合計メモリの一部としてカウントされません 回のリクエストの実行時間が短くても 実行回数が多い場合は 実行待ちのリクエスト数が多いことがグラフからわかった場合は 実行頻度の高いクエリー 実行頻度の高いクエリーのレポートは 実行頻度の高いクエリーを調整するとパフォーマンスを向上できます 実際のメモリ使用量と異なる可能性があります 属性と 属性を調整できるか判断します 平均で低速なクエリーのレポートは平均して低速なクエリーを示します 指定された制限よりも小さいリクエストは 指定された制限を超えるリクエストは総メモリの一部としてカウントされ 時間を消費することがあります 時間を累積して最も使用したリクエストをリストします 最も頻繁に実行されたクエリーをリストします 最近の推定リクエストサイズ 最近発生したエラーの発生時間 本当にキャッシュする必要があるか判断します 次のレポートを含みます 目安として使用してください 累積サーバー使用量の多いリクエスト 累積サーバー使用量の多いリクエストのリスト 累積サーバー使用量の多いリクエストのレポートは 累積サーバー時間が多いリクエストを調整すると 統計情報 設定 設定と 設定を調整してください 詳細では 詳細については 詳細ビュー 詳細ビューには 詳細ビューは 詳細レポートによって 詳細情報には 頻繁に実行されれば多くの";
              var n="WSc3ff6d0ea77859461172e0811cbf364104-7fba";
              top.sc1[84] = t;
              top.sc2[84] = p;
              top.sc3[84] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ffb() {
              var t="アラート";
              var p="administrator cfc coldfusion および送信する際の宛先を指定できます そのファイルによってリクエストスレッドが応答しない場所を特定できます それによって どちらのタイプのアラートでも の また を実行できます アラート アラートが発生したときにカスタム アラートが発生したときに電子メールを送信するかどうか アラートによって生成されたすべてのスナップショットをリストします アラートのレポートは アラートの設定 アラートは アラートを生成するしきい値を指定できます アラート状態に対して独自の自動応答を返すことができます サーバーの平均応答時間が ページでは ページで指定されたサーバーにログインするためのユーザー名とパスワードを指定することもできます メール 低速サーバーのアラートは 低速サーバーや無応答サーバーを含む 指定された制限を超えると発生します 指定された数を超えるスレッドが 指定された秒数よりも長い間ビジーになったときに発生します 潜在的な問題を警告します 無応答サーバーのアラートは 無応答サーバーのアラートはスナップショットファイルを作成し";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ffb";
              top.sc1[85] = t;
              top.sc2[85] = p;
              top.sc3[85] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7fd2() {
              var t="スナップショット";
              var p="coldfusion java jvm logs snapshot snapshots sysgen txt usrgen およびセッションスコープでのメモリ使用量 これらの詳細は次のとおりです のルートディレクトリ をクリックしたとき をクリックした場合 アプリケーション キャッシュクエリーについての情報 サーバー サーバーについての詳細が含まれます サーバーモニタがスナップショットを作成する場合 サーバーモニタの サーバーモニタはスナップショットの情報を収集して スタックトレース スナップショット スナップショットが実行された時刻と原因 スナップショットが実行された瞬間に存在した実行中および実行待ちのリクエスト数 スナップショットが実行された瞬間の スナップショットには スナップショットのレポートは スナップショットは スナップショットを実行 スロットルのキューサイズとメモリ使用量 タイムスタンプ データベースプールのステータス ファイルに保存します ファイルに情報を保存します フォルダの プロファイリングとメモリトラッキングが有効になっているかどうか ページにある メモリ使用量 メモリ使用量についての次のような情報 ユーザーのスナップショット 実行されたすべてのスナップショットをリストします 次のいずれかの場合に実行されます 無応答サーバーまたは低速サーバーのいずれかのしきい値を超えたとき";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7fd2";
              top.sc1[86] = t;
              top.sc2[86] = p;
              top.sc3[86] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ffa() {
              var t="サーバーモニタの設定の指定";
              var p="administrator coldfusion webroot および この機能は その場合は除外するパスを指定すると の をクリックして をクリックします を監視するかどうかを指定する場合は インクルードパスのオプションを使用すると エイリアス サーバーのすべてのリクエストを監視する必要がない場合もあります サーバーモニタのグラフの更新頻度 サーバーモニタのレポートの更新頻度 サーバーモニタの設定の指定 サーバーモニタは サーバーモニタは指定したディレクトリとそのサブディレクトリにあるファイルについての情報は収集しません タブをクリックします テンプレートについての情報を収集します テンプレートのパスのエイリアスを指定するには テンプレートの完全なパスを表示するかどうか ディレクトリとそのサブディレクトリ デフォルトでは フィルタの設定 プロファイリングから除外するファイルパスを指定するには プロファイリングフィルタ ページで指定されたディレクトリにあるすべての マッピング レポートの生成に使用する設定を指定するには 一方 平均応答時間の計算頻度 本番サーバーで監視対象を制限する際に特に役立ちます 次の項目を指定できます 監視で除外するファイルパスと含めるファイルパスを指定する場合や 設定 除外したディレクトリのサブディレクトリを監視できます";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ffa";
              top.sc1[87] = t;
              top.sc2[87] = p;
              top.sc3[87] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff4() {
              var t="coldfusion サーバーモニタ api";
              var p="1 8500 admin adminapi administrator adminobj api array arraylen br cfc cfide cfloop cfoutput cfscript coldfusion component connected createobject data dbpool dsn explorer following from get getaverageresponsetime getdbpoolstats http i index instantiate is list localhost login monitor myobj object pool rds server servermonitoring sources the to totalconnectioncount およびマニュアルを参照するには この例では そのためには たとえば に にアクセスします の のインスタンス化と のメソッド の使用 をインスタンス化します を使用して を使用しています を使用してください を使用すると コンポーネントの サーバーが接続しているデータソースと接続数をリストしています サーバーの平均応答時間を取得するには サーバーモニタ サーバーモニタが収集するすべてのデータをプログラムで取得することができます サーバーモニタのタスクを実行するために呼び出すメソッドが含まれています パスワードまたは パスワードを渡します メソッドの呼び出しを メソッドを使用します メソッドを呼び出します メソッドを呼び出す際には メソッド引数 例 次のように 次のようにして 次の例では 目的の 行のコードで実行することもできます";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7ff4";
              top.sc1[88] = t;
              top.sc2[88] = p;
              top.sc3[88] = n;
          }
  
          function fWSc3ff6d0ea77859461172e0811cbf363cdd_7fe2() {
              var t="サーバーモニタを使用したサーバーのパフォーマンスの向上";
              var p="0 1 128 128m 180 256 3 512 6 64 administrator application args cachedafter cachedwithin cfcache cfif cfml cfquery cfstoredproc coldfusion config cookie gb home i ibm isdefined j2ee java jvm lang lib machine maxpermsize mb myvariable n o outofmemoryerror permanent rdbms runtime server sql sun tomcat variables virtual websphere xmsnm xmxnm xx および およびメモリトラッキングを有効にします が使用できるメモリ量を表します が含まれています が開始時に使用するメモリ量を表し ここで このエラーが発生するよくある原因に このサイズを増やすことができます この値は この情報を使用します この設定によって この設定の最適値を判断するには この設定は この領域のデフォルトのサイズは これは これらの これらの設定は さらに しかない場合 その他のより複雑な条件で発生することがあります それぞれ それぞれのリクエストに対して たとえば つのプロセッサにつき です では と とともに使用している には にはメガバイト に増やしています に減らすとパフォーマンスが向上する可能性があります に表示できます に設定されています に設定されている に設定しないでください に設定します の のメモリしか使用していなければ のメモリ使用量を監視します のルートディレクトリ のルートディレクトリを指すように変更します のレポートを表示します の値を の最も重要な設定は の組み込みバージョンと の設定 の設定に初期ヒープサイズを指定し の設定に最大ヒープサイズを指定します の設定は の設定を有効にすると の設定方法によってパフォーマンスに大きな影響が出ることがあります は はエンタープライズ はメモリ管理を行っているため ほとんどのアプリケーションにとって また または や よりもかなりパフォーマンスが向上します よりもはるかに効率的です よりも大幅に少なくなります を使用します を使用するように を切り替えるとソフトウェアの環境が大幅に変更されるため を参照してください を変更することで を変更することもできます を最小化できます を設定するには を設定するのが最適です アプリケーションが実際には アプリケーションが実際に使用するメモリ量を監視します アプリケーションでは可能な限り次のいずれかの方法でキャッシュを使用してください アプリケーションなので アプリケーションに負荷をかけてさまざまな値でテストして アプリケーションをテストしている間 アプリケーションを十分にテストしてください アプリケーションサーバーとしての エラーが発生します エラーは オブジェクトがヒープの オペレーティングシステムや他の実行中のアプリケーションもメモリを使用するため ガベージコレクションの頻度が高くなり キャッシュ キャッシュ機能 キャッシングを実行するには クエリーよりも一般的にパフォーマンスが向上します クエリーオブクエリー クライアント変数 クライアント変数を使用する際は コードを追加するほうが サーバーのパフォーマンスの向上に役立つ情報を提供します サーバーモニタの サーバーモニタは サーバーモニタを使用したサーバーのパフォーマンスの向上 サーバー上でアプリケーションを実行する上で最適なヒープサイズを判断することで ストアドプロシージャを使用すると セクションにある セクションを使用します ソフトウェアアプリケーションの必要条件に合ったハードウェアを導入することの重要性を示しています ソースコードが最後にコンパイルされたときから変更されたかどうかを見るためにサーバーがファイルシステムを確認しないようになります タグ タグなどのデータベースタグの タグを使用すると テンプレートの数にほぼ等しくなるように設定してください テンプレートを実行します テンプレートキャッシュサイズ デフォルトの最大ヒープサイズは デュアルプロセッサコンピュータを使用している場合は データをセッションスコープなどのパーシスタントスコープに格納して データベース データベースキャッシングはパフォーマンスと拡張性を大幅に向上させます データベースクエリーのキャッシング データベース応答時間 データベース応答時間の情報を表示するには データ操作は データ操作を行う ハードウェアの物理メモリは バージョン パフォーマンスが向上します パフォーマンスについて異なる特性を持っています パフォーマンスに大きく影響するシステム パフォーマンスに最も影響するソフトウェアコンポーネントは パフォーマンスに深刻な悪影響が出ます パフォーマンスを向上できる可能性があります ヒープが大きいことで必要になる内部メモリ管理が発生してパフォーマンスが低下します ヒープサイズに小さすぎる値を設定すると ヒープサイズを ピーク負荷をシミュレーションした状態でアプリケーションを実行して ファイルをテキストエディタで編集して ファイル内の プロセスが使用できるメモリは プロファイリング ページで ページで変更できます ページで設定します ページに ページにある ページに次の ページは メモリ使用量 メモリ使用量の多いリクエストのレポートで リクエストの処理 リクエストの統計情報 レポートを 一方 上で動作する 世代領域を使い切ってしまうことがあります 以上の物理メモリを搭載したサーバーハードウェアで実行してください 仮想マシン 低速なタグと関数 低速なリクエストおよびメモリ使用量の多いリクエストのレポートのしきい値をゼロ 低速なリクエストのレポートで 使用する 使用可能であるよりも多いメモリをアプリケーションが使用したときに 使用時のパフォーマンスが最高になるようにクライアント変数ストレージを設定してください 信頼できるキャッシュ 初期ヒープサイズと最大ヒープサイズです 初期ヒープサイズと最大ヒープサイズを同じ値に設定します 初期ヒープサイズと最大ヒープサイズを指定する 初期ヒープサイズは 初期メモリサイズ 単位のヒープサイズを指定します 受信リクエストを同時に処理する際に使用するスレッド数を決定します 可能であれば 可能な限りデータベースサーバーに実行させることをお勧めします 同じベンダでもバージョンの異なる 同時リクエスト 同時リクエストの制限を 呼び出しのクエリーをストアドプロシージャに変換して 回のリクエストよりも長い間使用可能にする方法 変数によるメモリ使用量を監視するには 変数のメモリ使用量 変数名を完全なスコープで指定することをお勧めします 大きすぎる値を設定すると 大きなヒープを割り当てておき 属性と 属性を使用します 平均応答時間をサーバーモニタの 引数は 引数を追加することで 文字列操作やメモリ内クエリー 最初に開発環境またはテスト環境で切り替えてください 最初は 最大の変数 最大ヒープサイズは 最大ヒープサイズを 最大メモリサイズ 最適なヒープサイズを判断する上で重要です 最適なヒープサイズを判断する際に 最適なヒープサイズを最も効果的に判断するには 最高のパフォーマンスを得るには 最高の結果を得るために 本番アプリケーションで 本番サーバーに変更を加える前に 次のものを見つけます 次の例では 物理メモリが 物理メモリの空き容量より大きく設定すると 特に 用 異なる 異なるベンダの 監視 要約 設定 設定がパフォーマンスに影響する度合いを監視するには 設定の値として保存されます 負荷がかかった状態でのアプリケーションのパフォーマンスに最も大きく影響します 負荷をかけた状態で最もパフォーマンスが良い値を見つけます 逆に 通常 通常の 通常使用する 開発中のアプリケーションのボトルネックの発見 関数を使用する際は";
              var n="WSc3ff6d0ea77859461172e0811cbf363cdd-7fe2";
              top.sc1[89] = t;
              top.sc2[89] = p;
              top.sc3[89] = n;
          }
  
          function fWS3AB107E1_16CB_48bb_BA20_C653175A831B() {
              var t="server manager クライアントのセットアップ";
              var p="1 air coldfusion manager server は複数の を参照してください アプリケーションは クライアント クライアントのセットアップ クライアントを設定する方法の詳細については サーバーの監視 サーバーを サーバーインスタンスに対して ベースアプリケーションです ページからダウンロードしてインストールできます 箇所から集中管理するための";
              var n="WS3AB107E1-16CB-48bb-BA20-C653175A831B";
              top.sc1[90] = t;
              top.sc2[90] = p;
              top.sc3[90] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7fff() {
              var t="サーバーの監視設定の設定";
              var p="admin administrator api cfc coldfusion jetty monitoring neo servermonitoring xml および を使用します を手動で編集します サーバーの監視設定の設定 次のいずれかの方法で設定できます 監視サーバーは";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7fff";
              top.sc1[91] = t;
              top.sc2[91] = p;
              top.sc3[91] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffe() {
              var t="coldfusion administrator の使用";
              var p="5500 administrator args coldfusion config dcoldfusion java jsafe jvm ssl true ここに記載した設定は です に のサーバーの監視の設定ページ の使用 を使用して を使用するように設定する場合は を記述してください アプリケーションを再起動するまで反映されません サーバーの監視 サーバーの監視を有効にして サーバーの監視を有効にします サーバー監視アプリケーションが既に実行中の場合は デフォルトのポートは ファイルの 次の設定が行えます 監視の設定 監視サーバーでリスンするポートを指定します";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ffe";
              top.sc1[92] = t;
              top.sc2[92] = p;
              top.sc3[92] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffd() {
              var t="neo monitoring xml および jetty xml の手動での編集";
              var p="0 1 10 100 1u2u1wml1z7s1z7a1wnl1u2g 1vny1zlo1x8e1vnw1vn61x8g1zlu1vn4 2 300000 5000 5500 acceptors acceptqueuesize addconnector arg boolean call cfusion class coldfusion connector connectors eclipse false host https inf ismonitoringserverenabled j2ee jetty keypassword keystore lib lowresourcesconnections lowresourcesmaxidletime maxidletime monitoring name neo new nio obf org password path port selectchannelconnector server set ssl sslselectchannelconnector statson to true trustpassword truststore value var web xml および に変更します のルートディレクトリ の変更は の手動での編集 または または接続に を開きます コメントアウトします サーバー設定の場合 セクションのコメントアウトを外します セクションを削除するか ファイルでは プロトコルを使用している場合 プロトコルを使用する場合にのみ行います ポート ポートおよびキーストア関連の設定を指定します ポートの変更が必要な場合 ロギング 接続に 最大スレッド数 次のコードの値を 次の場所に移動します 次の設定を指定できます 設定の場合";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ffd";
              top.sc1[93] = t;
              top.sc2[93] = p;
              top.sc3[93] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffc() {
              var t="admin api の使用";
              var p="admin administrator api cfc configuremonitoringserver disablemonitoringserver enablemonitoringserver flag getmonitoringserverport getmonitoringserverprotocol ismonitoringserverenabled ismonitoringserverrunning port servermonitoring setmonitoringserverport startmonitoringserver stopmonitoringserver が追加されています の使用 を使用します サーバーを監視するサーバーをプログラムで設定するには ポート情報を設定します 今回のリリースで 実行中でない場合は実行を開始します 実行中の場合は停止します 次の 監視サーバーが実行中であるかどうかを通知します 監視サーバーが有効であるかどうかを通知します 監視サーバーでリスンするポートの詳細を取得します 監視サーバーのプロトコルの詳細を取得します 監視サーバーのポート情報を設定します 監視サーバーの実行を開始します 監視サーバーを停止します 監視サーバーを有効にして 監視サーバーを無効にして 説明";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ffc";
              top.sc1[94] = t;
              top.sc2[94] = p;
              top.sc3[94] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffb() {
              var t="トラブルシューティング";
              var p="トラブルシューティング";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ffb";
              top.sc1[95] = t;
              top.sc2[95] = p;
              top.sc3[95] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffa() {
              var t="マルチサーバーの監視";
              var p="coldfusion crossdomain monitoringserver xml でクロスドメインの詳細を指定します の のルートディレクトリ マルチサーバーで監視を行う場合は マルチサーバーの監視";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ffa";
              top.sc1[96] = t;
              top.sc2[96] = p;
              top.sc3[96] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff9() {
              var t="他者による xml のポート定義の変更";
              var p="administrator coldfusion xml に例外は表示されません のポート定義の変更 ログを確認してください 他者による";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ff9";
              top.sc1[97] = t;
              top.sc2[97] = p;
              top.sc3[97] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff8() {
              var t="ssl を使用した監視";
              var p="config dcoldfusion disablejsafe jvm ssl true この既知の問題を解決するには に追加してください を使用した監視 エラーが発生することがあります モードで監視サーバーの実行を開始すると 次のコードを";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ff8";
              top.sc1[98] = t;
              top.sc2[98] = p;
              top.sc3[98] = n;
          }
  
          function fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff7() {
              var t="スレッドプールの更新";
              var p="2 5 50 blocking bounded class concurrent corepoolsize default eclipse java jetty job maximumpoolsize maxthreads minthreads name new optional org queue queued queuedthreadpool server set thread threadpool util with xml でスレッドプールを更新することができます スレッドプールの更新 セクションのスレッドプールを変更します ファイルの";
              var n="WSbfbbf049491c37b01e63e3d129fe2500fd-7ff7";
              top.sc1[99] = t;
              top.sc2[99] = p;
              top.sc3[99] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_8000() {
              var t="server manager の使用";
              var p="adobe air coldfusion manager server に付属する の使用 は アプリケーションです サーバーに適用することができます サーバーの設定を他の サーバー管理者はこのクライアントを使用して 特定の 複数のサーバーを監視または管理したり";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-8000";
              top.sc1[100] = t;
              top.sc2[100] = p;
              top.sc3[100] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7fff() {
              var t="server manager の起動";
              var p="7 a add administrator adobe air applicable application are be because cannot cfide coldfusion configuration context downloaded extension file handler host http if iis iis7 installer is j2ee manager map mime mimetype of package page port requesting root script served server servermanager severmanager should the url vnd web you zip がインストールされていることを確認してください このエラーを回避するには このパスワードはリセットすることもできます このパスワードをリセットすると この場合は すべての登録済みサーバーにパスワードを入力して接続する必要があります すべての登録済みサーバーのパスワードが無効になります その にアクセスして にログインします に初めてログインするときは に変更してから実行するか の のホームディレクトリ の実行可能ファイルを呼び出して の起動 は次の場所からダウンロードできます をクリックし をクリックします をダウンロードしようとすると を使用している場合は を使用するには を初めて起動するには を設定します を設定できない場合は を起動します を起動するための を起動する前に を追加し を追加することによって アプリケーションをダウンロードするには アプリケーションをダウンロードする場合は インストールディレクトリから インストール後の作業 サーバーで サーバーで実行中の サーバーまたは サーバーモニタ スタンダード版の タイプとして タイプを設定します ディレクトリにある ファイルをコンピュータ上に保存して実行します ファイルをダウンロードし ファイルをダウンロードします ファイルを実行できます ファイル名拡張子として ファイル拡張子を プラットフォームが必要になるため マスターパスワードを設定します 次の 次のようなエラーが表示されることがあります";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-7fff";
              top.sc1[101] = t;
              top.sc2[101] = p;
              top.sc3[101] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ffe() {
              var t="サーバーの登録";
              var p="1 10 2 2008 30000 7 8443 8985 a add addconnector admin adminservlet air alias an application arg auth authentication b bin bio blazeds cacerts call cer certificatekey cf cfide cfusion changeit class code coldfusion conf config console default deploy domain error etc exception exe export failure file flag flex flexsession genkeypair home http https importcert inf installation installtion invalid invoker ip is j2ee jaas java jboss jbossappstartup jetty jks jmx jndi jndifactory jre keyalg keypassword keystore keytool lib listener localizedexception login manager mapping maxidletime message messaging module mortbay name new on option org password pattern policy port processing properties props required restricted rfc roles rolesproperties rsa sar security selfsignedcert server servermanager servlet set socketconnector spi ssl sslsocketconnector storepass systemproperty the there to tomcat trustpassword truststore unhandled url users usersproperties usersrolesloginmodule validity vista war was web weblogic websphere when windows wlogicappstartup wsappstartup wwwroot xml および から このオプションを使用すると この機能を有効にするには これらのタスクは これらのタスクを実行する方法については すべてのサーバー つのサーバーに対して実行できます つのサーバーを選択します つのサーバーインスタンスの設定の相違を確認できます つのサーバーインスタンスまたはクラスタの設定の相違を確認できます つのサーバーインスタンス間で相違がある設定が強調表示されます つのサーバー設定の相違の表示 つを右クリックします で です でリモートサーバーを実行している場合は で一部の設定を再定義する際には で利用可能な で指定されているユーザー名 で登録します と という文字列を検索して という文字列を検索します と表示され と表示されます に による にデプロイされている に表示されます の のインストール中に指定した のインストール時に のセキュアアクセスが有効になっている場合にのみ機能します のセキュアアクセスを有効にする方法の詳細については のセキュアアクセスを設定するには のデプロイ先と同じドメインに属す のバージョン のホームディレクトリ のリモートインスタンスの のリモートインスタンス名です の右ペインにあるプラス記号 の場合は の設定の相違 は または をクリックし をクリックして をクリックします をデプロイする方法について詳しくは を使用したリモート起動および停止機能の設定 を使用して を使用します を使用すると を使用する場合は を参照してください を実行するには を実行するサーバーの を選択します を開きます アドレス アドレスでホストを更新します アドレスのいずれかを指定します アドレスを使用して アプリケーションから アプリケーションがデプロイされているドメインのユーザー名 アプリケーションでサポートされるのは アプリケーションの名前 アプリケーションサーバーに アプリケーションサーバーパスワード アプリケーションサーバーユーザー名 アプリケーション名 インスタンスがアプリケーションサーバー上で実行されている必要があります インスタンスがデプロイされている次のタイプのサーバーであれば インスタンスのみです インスタンスのデプロイ先と同じプロファイルで インストール エントリのキーストア名 オプションを使用すると キーストアファイルに秘密鍵を生成します キーパスワードおよび クイックビュー クラスタ内の各インスタンスを グループタブの下にも表示されます コンソールにアクセスするためのポート番号 コンテキストルート コンテキストルートが指定されてないときの コンポーネントのパスワードです コンポーネントのユーザー名です サーバー サーバーおよび認証に関する詳細が正しい場合は サーバーからこれらの情報を取得します サーバーに サーバーに関する詳細を入力します サーバーの サーバーのステータスが サーバーのポートです サーバーの再起動が必要になる場合があります サーバーの登録 サーバーの起動操作と停止操作を実装する一般的な方法は サーバーを再起動します サーバーを登録するには サーバーを起動します サーバーを起動または停止するには サーバーインスタンスごとに実行することも サーバーインスタンスに関する最新情報を取得するには サーバーインスタンスの詳細を取得するには サーバーインスタンスの起動と停止 サーバーインスタンスまたはクラスタをグループに関連付けている場合は サーバーインスタンスを登録した後は サーバーインスタンスを管理するには サーバーインスタンスを起動または停止するには サーバークラスタの場合は サーバーテンプレートキャッシュをクリアすることができます サーバーポート サーバーマネージャーの サーバーマネージャーのリモートインスタンス機能の起動と停止を設定できます サーバー名 サーバー固有のパラメータ サービスの サービスを使用することもできます サーブレットマッピングのコメントを解除します スタンドアローン スタンドアローンサーバー タブで必要な詳細を指定した後に有効になります タブには タブの右ペインにある ダイアログボックスで ディレクトリにコピーします ディレクトリに移動して デフォルト デフォルトでは デフォルト値は デプロイ済みの ドロップダウンリストの横にあるアイコンを選択します パスワード パラメーター ファイルおよび ファイルと ファイルには ファイルにアクセスするためのポート番号 ファイルのコンテキストルート ファイルの名前 ファイルを ファイルをアプリケーションサーバーにデプロイして ファイルをデプロイします ファイルを任意の場所にコピーします ファイルを更新します ファイルを開きます プラス記号 プロンプトが表示されたら ホストにログインせずにサーバーを再起動できます ホストの名前または ホストを設定するには ホスト名または ホットフィックスを適用したり ポート ポートです ポートは ポート番号 メインの ユーザー名 ユーザー名とパスワードなど ユーザー名に対応するパスワード リストに表示されます リモートインスタンスを追加するローカルホストで リモートインスタンス機能の起動と停止を設定できます リモートインスタンス管理者をインストールします リモートホストで リモートホストで作成された リモートホストで作成した リモートホストの リモートホストのポート番号でホストを更新します ログイン失敗 ログイン済み ローカルホストの ロールのカンマ区切りリスト 以外のサーバー 使用しているアプリケーションサーバーに固有の 値は 停止 停止の詳細 再起動などのオプションは 到達不能 各アプリケーションサーバーに対応する 各サーバーインスタンスを登録します 同じサーバーを複数回登録すると 回だけ登録することをお勧めします 固有のパラメータ 存在しない場合 対応するユーザー名のパスワード 左ペインの 形式 接続の詳細を指定します 次の 次のとおりです 次のような例外が発生する場合があります 次のようにします 次のエントリを追加します 次のセクションを参照してください 次のポリシーを追加します 次の形式のエントリが登録されている必要があります 次の情報を指定します 次の行のコメントを解除します 次へ 正しくない場合は 比較する設定を選択します 特定のサーバーを登録するときは 状態にある 登録されたサーバーは 登録済みの 登録済みサーバーは 相違 管理サーバーポート 管理者権限で 自己署名証明書または認証機関からの証明書が必要です 複数のサーバーに対して実行することもできます 設定を展開します 証明書をインポートします 証明書をエクスポートします 詳細を指定します 起動 起動または停止の機能を設定できます 起動操作および停止操作を実行するために必要なパラメーターについて詳しくは 起動操作と停止操作は 起動操作と停止操作を実行します 通常は 通常は管理サーバーポート 適用 選択したサーバーインスタンスと比較するもう 開始 関連パラメータがあります";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-7ffe";
              top.sc1[102] = t;
              top.sc2[102] = p;
              top.sc3[102] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff7() {
              var t="グループの作成";
              var p="1 manager server からグループを編集または削除するには から既存のグループを編集または削除するには つ以上のグループに関連付けることができます では の右ペインに または をクリックします を選択します グループ グループの作成 グループの追加 グループを作成して グループを作成してサーバーをグループに関連付けるには サーバーの編集 サーバーインスタンスをグループに関連付けるには サーバーインスタンスを追加するグループを選択します サーバーインスタンスを選択し タブをクリックします ダイアログボックスで メニューから 削除 新しいグループのタブが作成されます 新しいグループの名前を入力し 登録済みのサーバーや新しいサーバーを 編集 追加 適用 選択したサーバーがグループに追加されたことを確認するには";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-7ff7";
              top.sc1[103] = t;
              top.sc2[103] = p;
              top.sc3[103] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff6() {
              var t="複数のサーバーの管理";
              var p="1 administrator coldfusion jar jvm lib manager server updates url xxx からサーバーへの再接続が試みられます が この このオプションはデフォルトで選択されています このオプションを選択します このオプションを選択解除すると このチェックボックスはデフォルトで選択されています このチェックボックスを選択すると このチェックボックスを選択解除した場合は このドロップダウンリストを使用して この手順はホットフィックスが すべてのデータソースを検証します そのデータソースがサーバー上に既に存在していた場合 そのデータソースは新しい設定で上書きされます その設定を適用する他の その設定項目がドロップ先のサーバーに既に存在しているときは それらのインスタンスを更新できます たとえば では では次の環境設定を定義できます でサーバーインスタンスのステータスが というデータソースを特定のサーバーにドロップし どの設定を編集する場合も になった場合は に保存されます に登録した後は のオプションと同じです のホームディレクトリ の右ペインで の左ペインに の左ペインに表示されている設定を使用して の環境設定の定義 の環境設定を定義するには は はい また をクリックし をクリックして をクリックします を使用すると を内部ブラウザまたはシステムのデフォルトブラウザで開くことができます を設定します アイコンが表示されます アイコンと アイコンをクリックしてキャッシュログを保存するか アイコンをクリックしてログを削除できます アイコンをクリックしてログファイルを保存します アクション アラートウィンドウ位置 ウィンドウの下部に表示されなくなります ウィンドウの下部に進捗状況バーが表示され エラーが発生してもバッチ操作が続行されます エラー発生時にバッチ操作を停止 オプションをクリックします オプションを選択します キャッシュのクリア状況が表示されます サーバー サーバーからの設定の取得 サーバーでアラートや警告が発生していないかをチェックする間隔 サーバーに設定を適用するには サーバーに設定を適用できるだけでなく サーバーに関して設定可能な項目が一覧表示されます サーバーの確認応答の受信後にダイアログボックスを閉じる サーバーの設定を定義します サーバーを再起動します サーバーを選択します サーバーインスタンスに対してバッチ操作を実行できます サーバーインスタンスに適用されたホットフィクス サーバーインスタンスを サーバータスク サーバータスクまたは設定の適用 サーバー設定を編集および更新します サーバー設定ダイアログボックスの値が編集されているときに スケジュールされたタスク スケジュールされたタスクを追加します スナップショットを保存 タスクが完了すると タスクが成功したかどうかを示すメッセージが表示されます タスクに対しては タスクの完了後 タスクを一時停止します タスクを再開します タスクを実行します タスク項目を右クリックして チェックボックスをオンにして チャート チャート設定を編集および更新します テンプレートキャッシュのクリア テンプレートキャッシュをクリアするには ディレクトリに配置してください データソース データソースの横に赤いアイコンとエラーメッセージが表示されます データソースを追加します データソースノードの横に緑のアイコンが表示されます ドロップすることもできます ドロップする場合 バッチ操作では バッチ操作には バッチ操作のログを保存するには バッチ操作の進行状況が バッチ操作の進行状況を表示 ファイル ファイルである場合にのみ役立ちます ファイルの場所に移動します ファイルは ホットフィックスとして使用する ホットフィックスの適用 ホットフィックスをサーバーインスタンスに適用します ホットフィックスを有効にするために ホットフィックスを適用した後は ポーリング間隔 マッピング マッピングを追加します メモリ メモリ設定を編集および更新します メール メール設定を編集および更新します リクエストの調整 リクエストの調整設定を編集および更新します ロギング ロギング設定を編集および更新します 一時停止 下部の進行状況バーに 他の場所にホットフィックスファイルを配置した場合は 任意のサーバー 内で通知やアラートを表示する位置を選択します 内蔵ブラウザを使用 再開 到達不能 削除 台の 台以上の 右上のメニューバーで 右上隅にある 失敗した場合は 実行 左ペインにある 左ペインにあるデータソースを右クリックして 左ペインにあるデータソースノードを右クリックして 左ペインにあるマッピングを右クリックして 左ペインにある設定を右クリックして 手動でホットフィックスを実装する必要があります 指定されたポーリング間隔が経過した後に 既存のスケジュールされたタスクを編集します 既存のデータソースを削除します 既存のデータソースを検証します 既存のデータソースを編集します 既存のマッピングを削除します 既存のマッピングを編集します 既存の設定値が新しい設定値で上書きされます 更新する必要があるサーバーインスタンスを選択します 最初に内容を更新して最新の設定を取得してから 検証に成功した場合は 次のアクションも実行できます 次のアクションを実行できます 次のタスクを実行できます 特定の設定項目をドラッグ 環境設定 確認メッセージが表示されたら 確認応答を受信するまでダイアログボックスを閉じないようにする場合は 秒 複数の 複数のサーバーにホットフィックスを適用するには 複数のサーバーに対する設定の適用 複数のサーバーのテンプレートキャッシュを同時にクリアできます 複数のサーバーの管理 複数のサーバーへの設定の適用などのタスクが含まれます 設定 設定に対しては 設定の編集に使用するオプションは 設定の適用状況が示されます 設定を右クリックし 設定を右クリックして 設定を編集および更新します 設定を編集します 警告は表示されません 進行状況バーの右側には 選択したサーバーに設定をドラッグ 選択したサーバーに適用 開く";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-7ff6";
              top.sc1[104] = t;
              top.sc2[104] = p;
              top.sc3[104] = n;
          }
  
          function fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff1() {
              var t="複数のサーバーの監視";
              var p="administrator coldfusion jvm manager server およびログイン状態のクイックスナップショットを表示します これには これらのアラートは これらのアラートを表示するには これらのビューを切り替えるには でこのオプションを有効にするには でこれらのアラートを表示できるようにするには でのインスタントサーバーアラート で使用できるビューには次のものがあります で表示するアラートに関連するすべてのタブで には に送信され の右下隅にポップアップメニューとして表示されます をクリックします を参照してください アプリケーションが実行中の場合にのみ表示できます アプリケーションに登録されたサーバーを監視するためのさまざまなビューが用意されています アラート アラートの種類 アラートの設定 アラートの設定について詳しくは エラーの時刻 エラービュー クイックビュー クライアントに通知 サーバーのオンライン時間 サーバーの監視 サーバーの行の右隅にある緑色の矢印をクリックして サーバーの詳細を表示するには サーバーアラートが発生するたびにクライアントに通知するオプションを有効にします サーバーインスタンスに関連して発生した サーバーインスタンスの実行中に発生したエラーに関する詳細を表示します サーバーサイドでアラートを設定する必要があります サーバーモニタ サーバーモニタの起動 タイムアウトなどのアラートは チェックボックスを選択します メモリ リクエスト時間 レスポンス時間などの詳細を含む精密なサーバーステータスを表示します 低速サーバー 右上隅にあるビューアイコンをクリックします 失敗の詳細などが含まれます 失敗コード 失敗文字列 無応答サーバー 行を展開します 複数のサーバーの監視 詳細ビュー 警告";
              var n="WSfd7453be0f56bba4-2a6b48f122a6582c7f-7ff1";
              top.sc1[105] = t;
              top.sc2[105] = p;
              top.sc3[105] = n;
          }
  
          function fWS6029a80579ffffcd1f6883df134d05bd229_8000() {
              var t="基本的なトラブルシューティングとよくある質問";
              var p="基本的なトラブルシューティングとよくある質問";
              var n="WS6029a80579ffffcd1f6883df134d05bd229-8000";
              top.sc1[106] = t;
              top.sc2[106] = p;
              top.sc3[106] = n;
          }
  
          function fWSe61e35da8d318518_69b2bf03134d0730d5e_8000() {
              var t="基本的なトラブルシューティングの概要";
              var p="administrator coldfusion com http system web windows が実行されます が実行中であることを確認します これは では で作業を始める際のトラブルを避けるために のログファイルには の実行 またはサイトのアプリケーションページの問題を特定する助けになる貴重な情報が含まれています をインストールした後 をインストールする前に を使用して を参照してください を実行する必要があります を操作するためのアクセス権限が アカウントで アプリケーションのページにない場合は オブジェクト サーバーがインストールされていて実行中であることを確認します サーバーの実行 テストを実行できます デフォルトでホストの ブラウザーに読み込むことによって行えます プロトコルを使用してページを ユーザーアカウントの変更 リソース リモートデータソース ログファイルのアクティビティの分析 ログファイルのサーバーアクティビティの分析 他のアプリケーションページ 基本的なトラブルシューティングの概要 必要なアクセス権限がある特定のアカウントで 次を確認します 詳しくは";
              var n="WSe61e35da8d318518-69b2bf03134d0730d5e-8000";
              top.sc1[107] = t;
              top.sc2[107] = p;
              top.sc3[107] = n;
          }
  
          function fWSe61e35da8d318518_69b2bf03134d0730d5e_7fff() {
              var t="web サーバーが実行中であることの確認";
              var p="0 1 127 8500 coldfusion enter htm http localhost myindex url web そうでなければ の または をアドレス行に入力します をインストールする前に をクリックします を入力してページをブラウザーに読み込みます エラーメッセージが表示されます サーバー サーバーがインストールされて実行中であることを確認します サーバーが実行中であることの確認 サーバーが実行中であれば ドキュメントのルートディレクトリにある場合は ビルトイン ファイルが ブラウザーを開きます ページが表示され ページまたはサイトの 例えば 次のように";
              var n="WSe61e35da8d318518-69b2bf03134d0730d5e-7fff";
              top.sc1[108] = t;
              top.sc2[108] = p;
              top.sc3[108] = n;
          }
  
          function fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffe() {
              var t="coldfusion が実行中であることの確認";
              var p="8500 administrator cfide cfm coldfusion cookie enter hostname http index localhost unix url web があるサーバーの名前です がリモートサーバーにインストールされている場合 がローカルサーバーにインストールされている場合 が実行中であることの確認 が実行中の場合 が開きます ここで では と指定します の のセキュリティを使用している場合は の大文字と小文字が区別されます は をアドレス行に入力します をクリックします を実行するには を有効にする必要があります サーバーを使用している場合は パスワードプロンプトが表示されます ブラウザーの ブラウザーを開きます 内部 次のように 示されているとおりにアドレスを入力したことを確認してください 適切な";
              var n="WSe61e35da8d318518-69b2bf03134d0730d5e-7ffe";
              top.sc1[109] = t;
              top.sc2[109] = p;
              top.sc3[109] = n;
          }
  
          function fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffd() {
              var t="coldfusion ユーザーアカウントの変更";
              var p="10 application coldfusion com ok server system windows が実行されます そのため ただし のアプリケーションページにない場合があります をクリックして を実行する必要があります を選択して右クリックし を選択します アカウント アカウントで オブジェクトなどの他のリソースを操作するために必要なアクセス権限が オプションを選択し コントロール サービスをクリックします サービスを再起動します サービスウィンドウを閉じます スタート デフォルトでホストの パネル フレームで プラットフォームでは プロパティ ユーザーアカウントの変更 リモートデータソース ログオン 他のアプリケーションページ 変更を有効にするために 必要なアクセス権限がある特定のアカウントで 情報を保存します 管理ツール 適切なアカウントのユーザー名とパスワードの情報を入力します 閉じる";
              var n="WSe61e35da8d318518-69b2bf03134d0730d5e-7ffd";
              top.sc1[110] = t;
              top.sc2[110] = p;
              top.sc3[110] = n;
          }
  
          function fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffc() {
              var t="ログファイルのサーバーアクティビティの分析";
              var p="coldfusion によって生成されたログファイルは のパフォーマンスのトラブルシューティングまたはサイトのページの問題の修復を行えます を参照してください アプリケーションのアクティビティを監視するのに役立ちます サーバーおよび ロギングの環境設定について詳しくは ロギングの環境設定によっては ログビューアを使用してログファイルの情報を分析し ログファイルのサーバーアクティビティの分析 例えば 処理するために指定した時間よりも長くかかるアプリケーションのページを識別できます";
              var n="WSe61e35da8d318518-69b2bf03134d0730d5e-7ffc";
              top.sc1[111] = t;
              top.sc2[111] = p;
              top.sc3[111] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_8000() {
              var t="よくある質問";
              var p="よくある質問";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-8000";
              top.sc1[112] = t;
              top.sc2[112] = p;
              top.sc3[112] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7fff() {
              var t="coldfusion はどのようにアンインストールしますか";
              var p="cd cf coldfusion j2ee odbc root sh uninstall unix windows からの がサーバーから削除されます この説明は としてログインします のルートディレクトリ の削除 はい はどのようにアンインストールしますか を をアンインストールすると をアンインストールするには をクリックします を選択します アプリケーションをアンデプロイします アンインストールすることを確認するダイアログボックスが表示されます アンインストールを開始するには コントロールパネル コンピューターを再起動します サーバーにデプロイする場合には当てはまりません サーバーの サービスをアンインストールして システムの スタート ディレクトリに移動します プログラムが完了したら プログラムの追加と削除 プログラムファイルと関連するコンポーネントがシステムからすべて削除されます 削除 次のコマンドを入力して 次のコマンドを入力します 設定";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7fff";
              top.sc1[113] = t;
              top.sc2[113] = p;
              top.sc3[113] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ffd() {
              var t="coldfusion administrator のパスワードはどのように変更しますか";
              var p="50 administrator coldfusion のパスワードはどのように変更しますか のページへのアクセスを制限するパスワードの設定または変更は の認証タイプを選択します をクリックします を選択します セクションで デフォルト ナビゲーションペインでセキュリティ パスワード パスワードには最大 パスワードの確認 ボックスで ボックスに新規のパスワードを指定します ルート 別のユーザー名とパスワードで認証する 単一のパスワードのみを使用する 変更の送信 推奨しません 文字まで使用できます 新規のパスワード 新規のパスワードを確認します 次のようにします 次のオプションがあります 複数のユーザーを許可する 認証を必要としない";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ffd";
              top.sc1[114] = t;
              top.sc2[114] = p;
              top.sc3[114] = n;
          }
  
          function fWSe61e35da8d318518_1bc1bf7e13586a377e4_8000() {
              var t="administrator パスワードまたは administrator コンポーネントパスワードを忘れた場合はどうすればよいですか";
              var p="administrator bat bin cfusion linux mac passwordreset passwordrest sh windows の場合 を実行します コンポーネントパスワードを忘れた場合はどうすればよいですか パスワードまたは フォルダーに移動します 次の手順に従います 要求されたら 詳細を指定します";
              var n="WSe61e35da8d318518-1bc1bf7e13586a377e4-8000";
              top.sc1[115] = t;
              top.sc2[115] = p;
              top.sc3[115] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ffc() {
              var t="coldfusion をどのように開始および停止しますか";
              var p="administrator coldfusion j2ee java jvm ok windows この説明は これはサービスを停止して開始するのと同じです で でなくなります で実行した後は と になっています になります のサービスとプロセスが常に開始されて実行されるように設定します のサービスとプロセスを起動して のサービスを停止して再起動します の設定ページのオプションの変更 はい は一連のシステムサービスとしてインストールされ または を をどのように開始および停止しますか をクリックします を選択します インストール時に コントロールパネルのサービスウィンドウでサービスをダブルクリックします コントロールパネルのサービスウィンドウを開きます サーバーにデプロイする場合には当てはまりません サーバーの自動開始または手動開始の設定 サーバーサービスの手動停止または手動開始 サービスが実行中の場合 サービスのウィンドウが開きます サービスの状態が サービスを停止することを確認するプロンプトが表示されるので サービスを停止するには サービスを再起動するには サービスを選択して サービスを開始するには サービスウィンドウが閉じます システムの起動時に スタートアップの種類 セキュリティの有効化または無効化 ネイティブの パフォーマンスモニターを使用できるようにするパフォーマンス監視オプションの有効化 停止 再起動 実行中でない場合 手動 次のアクションのいずれかを 状態が 状態は 状態は表示されません 自動 設定が保存されます 設定時に 通常は 通常はシステムの起動時に自動的に開始されます 閉じる 開始";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ffc";
              top.sc1[116] = t;
              top.sc2[116] = p;
              top.sc3[116] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ffb() {
              var t="パフォーマンスモニターはどのように設定しますか";
              var p="1 coldfusion configure ctrl j2ee monitor performance the windows このユーティリティは この変更内容が有効になります この説明は にインストールした場合 にインストールする場合は のインストールの一部として自動的にインストールされ のカウンターを次に示します を をクリックします を再起動すると を参照してください を選択します オプションを選択します オプション選択をします カウンターの追加ウィンドウが表示されます カウンターリストで キーを押したままでクリックします コントロールパネル サーバー サーバーにデプロイする場合には当てはまりません スタート タイムアウトとなったリクエスト数 デバッグ出力の設定ページの デバッグ出力の設定ページを使用して ドロップダウンリストボックスで パフォーマンスを選択して パフォーマンスオブジェクト パフォーマンスモニターで有効にできる パフォーマンスモニターの実行が開始されます パフォーマンスモニターの概要 パフォーマンスモニターはどのように設定しますか パフォーマンスモニターを設定します パフォーマンスモニターを設定できます パフォーマンスモニターウィンドウを開きます パフォーマンスモニターユーティリティを使用したパフォーマンス監視を有効にできます パフォーマンスモニターユーティリティを使用してサーバーのパフォーマンスを追跡できます パフォーマンス監視の有効化 パフォーマンス監視を有効にした後 パフォーマンス監視を有効にするには パフォーマンス管理を使用するには 一連のカウンターと連動してサーバーのパフォーマンスを監視します 使用するカウンターを選択します 変更の送信 実行中のリクエスト数 実行待ちのリクエスト数 平均キュー時間 平均データベーストランザクション時間 平均リクエスト時間 秒あたりのキャッシュポップ数 秒あたりのデータベースヒット数 秒あたりのページヒット数 秒あたりの着信バイト 秒あたりの送信バイト 管理ツール 表示属性はすべてのカウンターに適用されます 複数のカウンターを選択するには 設定 詳しくは 追加 追加ボタン 閉じる";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ffb";
              top.sc1[117] = t;
              top.sc2[117] = p;
              top.sc3[117] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ffa() {
              var t="マルチサーバーモニターはどのように使用しますか";
              var p="0 1 127 coldfusion flash ip monitor ok server sha1 summary xor いくつかのサーバーのステータスをすばやく表示して このページにリストされているエラーには これは これらの これらのサーバーは同じサーバーとは見なされません これらの共有オブジェクトに保存される情報は で作成されるためです で動作するマルチサーバーモニターに一部のサーバーを登録して のサーバーモニターに表示されます をクリックします を参照してください アドレス アドレスに対して異なる共有オブジェクトが アプリケーションのエラーは アラートの有無がマルチサーバーモニターに表示されます エラー クイックビュー コンテキストルート サーバーが実行されている期間 サーバーと通信するポート サーバーにアクセスするユーザー名とパスワード サーバーのアクティビティを追跡できます サーバーのエラーのみが含まれます サーバーの追加 サーバーをハイライトにします サーバーエラーに関する情報を表示するには サーバー名 サーバー名または ページの下部に詳細が表示されます ボタンをクリックします ポート マルチサーバーモニタの起動 マルチサーバーモニターでは マルチサーバーモニターのマスターパスワードは マルチサーバーモニターはどのように使用しますか リスト内のサーバーの詳細を表示するには ローカルホストで動作するマルチサーバーモニターを開いた場合 各サーバーの詳細情報を表示できます 存在する場合 暗号化を使用して保存されます 次を入力します 監視対象にサーバーを追加するには 監視対象のすべてのサーバーのステータスをすばやく表示するには 監視対象のすべてのサーバーの詳細ステータスを表示するには 監視対象の各サーバーに対して 複数の 要約ページの個 詳しくは 詳細ビュー 詳細ビューに各サーバーがリストされます";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ffa";
              top.sc1[118] = t;
              top.sc2[118] = p;
              top.sc3[118] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ff9() {
              var t="アプリケーションごとの設定の設定方法";
              var p="2 administrator application c cfc cfm cfset coldfusion customtagpaths inetpub listappend mapped1 mapped2 mapped3 mappings mymap mystuff structinsert this これらの設定は その後 つあり に定義されているカスタムタグよりも優先されます のサーバーサイドの設定よりも優先されます のメモリ変数ページでアプリケーション変数を無効にしている場合 の設定とアプリケーションごとの設定でそれらの場所が異なる場合は の設定ページでアプリケーションごとの設定を有効にする必要があります の設定ページにある まず または を使用するアプリケーションではサポートされていません アプリケーションごとのカスタムタグのパスを設定するには アプリケーションごとのマッピングを設定するには アプリケーションごとの設定で指定されているカスタムタグが最初に取得されます アプリケーションごとの設定のカスタムタグは アプリケーションごとの設定の有効化 アプリケーションごとの設定の設定方法 アプリケーションごとの設定は アプリケーションごとの設定は機能しません アプリケーションごとの設定を指定しても アプリケーションごとの設定を設定するには オプションを選択します カスタムタグのパス サーバー全体の設定は変更されません ファイルでマッピングまたはカスタムタグのパスを設定します ファイルに含めます ファイルを使用するアプリケーションでのみサポートされており マッピング 例えば 同じ名前のカスタムタグが 指定されたアプリケーションに限り 次のものをアプリケーションごとに設定できます 次のようなコードを";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ff9";
              top.sc1[119] = t;
              top.sc2[119] = p;
              top.sc3[119] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ff8() {
              var t="未配達メールをどのように管理しますか";
              var p="このページにアクセスして未配達メールを管理するには または をクリックします サーバーの設定 ファイルサイズおよび日付の各列で昇順または降順にソートするには ページに表示しない列を選択解除します ボタンをクリックします メール メールのソート メールの再スプール メールの削除 メールをソートする列を指定します メールを削除または再スプールするには メールページで リストからメールを選択して 下向き矢印をクリックしてソート順序を選択します 件名 任意の列を指定して下向き矢印をクリックします 再スプール 列をクリックして 削除 受信者 未配達メールのリストを表示できます 未配達メールの表示 未配達メールをどのように管理しますか 未配達メールページで 未配達メールページでは 次のタスクを実行できます 特定の列を表示するための選択 送信元 選択した列を未配達メールページで表示するには";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ff8";
              top.sc1[120] = t;
              top.sc2[120] = p;
              top.sc3[120] = n;
          }
  
          function fWSe61e35da8d31851842debae5134d0ab42ed_7ff7() {
              var t="ログ内容をどのように表示および検索しますか";
              var p="1 10 20 adobe and coldfusion content date events filtering hello html id log message messages number of or p time から このページには この文字列は というタグ属性が表示されますが と表示されます に増やします の厳格度のレベルがあります を参照してください アプリケーションの名前が表示されます アプリケーションを停止させるエラー アプリケーション名 イベントが発生した日付と時刻が表示されます イベントのスレッド エラー エラーメッセージの内容を短くして クリックすると コンパクト表示 サーバーのステータスと設定の詳細 スレッド タグが存在する場合 タグが存在する場合はタグも含めて タグで書式設定されています テクニカルサポートの担当者が ファイルの検索中 フィルタの開始 ブラウザーでレンダリングされる ページあたりに表示されるログエントリを ボタン ボタンをクリックします メッセージの合計数が表示されます ログビューアページが表示されます ログビューアページの使用 ログビューアページの内容にフィルターを適用するには ログビューアページの領域について説明します ログビューアページを使用して ログファイルの名前をクリックします ログファイルビューアの内容をカスタマイズできるフィルターダイアログボックスが開きます ログファイルページで ログファイルメッセージの実際の内容が表示されます ログ内容をどのように表示および検索しますか ログ内容を表示および検索できます 前のページと次のページを表示するためのリンクとともに 厳格度 問題を追跡してトラブルシューティングするために使用します 回復可能なエラー 多くのエラーメッセージは 必要に応じて 情報 次の表で 生データには 生データの表示 生データ機能を使用せずにファイルを表示すると 番号が表示されます 発生したエラーの説明が表示されます 表示しているログファイルの名前が表示されます 表示するようにログファイルページで指定した各ログファイルの内容が表示されます 詳しくは 説明 警告 警告的な情報 重大 領域";
              var n="WSe61e35da8d31851842debae5134d0ab42ed-7ff7";
              top.sc1[121] = t;
              top.sc2[121] = p;
              top.sc3[121] = n;
          }
  
          function fWSe61e35da8d318518_2d7f111b134e73f05d7_8000() {
              var t="アーカイブはどのようにデプロイしますか";
              var p="5 a administrator as car coldfusion deployment run specific this unix user web このシステムの既存のユーザー名とパスワードに完全に一致している必要があります このシステムアカウントの既存のユーザー名とパスワードと一致していない場合は そのユーザーでこのデプロイプロセスを実行する の左側のナビゲーションペインで の絶対パスを指定します の絶対パスを選択します をインストールしておく必要があります をクリックして をクリックします を参照 アプリケーションディレクトリが破損しなかったことを確認します アプリケーションディレクトリに正しく復元されました アーカイブされた内容を確認します アーカイブの復元に進みます アーカイブの要約パネルが表示されます アーカイブの要約パネルで アーカイブはどのようにデプロイしますか アーカイブを選択します アーカイブウィザードを終了します アーカイブファイル名 アーカイブページが表示されます オプションを選択します サーバーのブラウズ ターゲットシステムに テキストボックスに入力し テキストボックスに入力します デプロイ デプロイする デプロイに成功しました デプロイの位置パネルが表示されます デプロイ操作が失敗した場合 デプロイ操作が失敗します デプロイ操作が成功しませんでした パスワード パッケージとデプロイ パネルにあるリンクをクリックします ファイル ファイルが ファイルへのパスを指定します ファイルを復元します ページに表示される情報を確認します ボタンをクリックして ユーザーの場合のみ ユーザー名 ユーザー名とパスワードが ユーザー名とパスワードは 任意のシステムアカウント名を 別のシステムにアーカイブを復元するには 問題の原因を特定するには 問題の発生理由をさらに分析するには 場所を指定し 失敗 対応するアカウントパスワードを 復元 復元するアーカイブファイル名 復元操作中に 手順 指定した 既存のアーカイブのデプロイパネルで 次に 次のいずれかのアーカイブメッセージが表示されます 次へ 特権ユーザーとしてデプロイプロセスを実行する必要がある場合は 選択した 閉じる";
              var n="WSe61e35da8d318518-2d7f111b134e73f05d7-8000";
              top.sc1[122] = t;
              top.sc2[122] = p;
              top.sc3[122] = n;
          }
  

          var funcArr = new Array(fWSf01dbd23413dda0e51f089d212047ee7a02_8000,fWSc3ff6d0ea77859461172e0811cbf3637ad_7ffd,fWSc3ff6d0ea77859461172e0811cbf3637ad_7fff,fWSc3ff6d0ea77859461172e0811cbf36383a_8000,fWSc3ff6d0ea77859461172e0811cbf364104_8000,fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffe,fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffd,fWSc3ff6d0ea77859461172e0811cbf3638e6_7ffc,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fe9,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fe0,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fd4,fWSc3ff6d0ea77859461172e0811cbf364104_7ff3,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fce,fWSc3ff6d0ea77859461172e0811cbf364104_7ff4,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fc5,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fc2,fWSe61e35da8d318518_33adffe0134c60cd31c_8000,fWSe61e35da8d318518_33adffe0134c60cd31c_7fff,fWSe61e35da8d318518_33adffe0134c60cd31c_7ffe,fWSc3ff6d0ea77859461172e0811cbf3638e6_7fbf,fWSc3ff6d0ea77859461172e0811cbf364104_7fcf,fWSc3ff6d0ea77859461172e0811cbf364104_7ffa,fWSc3ff6d0ea77859461172e0811cbf3639b1_7ffd,fWSc3ff6d0ea77859461172e0811cbf3639b1_7ffc,fWSc3ff6d0ea77859461172e0811cbf364104_7fdb,fWSc3ff6d0ea77859461172e0811cbf364104_7fda,fWSc3ff6d0ea77859461172e0811cbf364104_7fdd,fWSc3ff6d0ea77859461172e0811cbf364104_7fe8,fWSc3ff6d0ea77859461172e0811cbf364104_7fe7,fWSc3ff6d0ea77859461172e0811cbf364104_7fe6,fWSc3ff6d0ea77859461172e0811cbf364104_7fe5,fWSc3ff6d0ea77859461172e0811cbf364104_7fe4,fWSfd7453be0f56bba4bcf6a8f122a6749eaf_8000,fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7fff,fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7ffe,fWSfd7453be0f56bba4bcf6a8f122a6749eaf_7ffd,fWS70f0d54f063b9b08238ab6dc122b1a20785_8000,fWS50260aa90e50c24b_32f8955c122c2720693_8000,fWS50260aa90e50c24b_32f8955c122c2720693_7fff,fWSc3ff6d0ea77859461172e0811cbf364104_7fe3,fWSc3ff6d0ea77859461172e0811cbf364104_7fe2,fWSc3ff6d0ea77859461172e0811cbf364104_7fe9,fWSc3ff6d0ea77859461172e0811cbf3639b1_7fff,fWSc3ff6d0ea77859461172e0811cbf364104_7fe0,fWSc3ff6d0ea77859461172e0811cbf364104_7fdf,fWSc3ff6d0ea77859461172e0811cbf3639b1_7fe6,fWSc3ff6d0ea77859461172e0811cbf364104_7ffd,fWSc3ff6d0ea77859461172e0811cbf363a5d_7ff7,fWSc3ff6d0ea77859461172e0811cbf364104_7fd8,fWSc3ff6d0ea77859461172e0811cbf364104_7fd7,fWSc3ff6d0ea77859461172e0811cbf364104_7fd6,fWSc3ff6d0ea77859461172e0811cbf363a5d_7ffc,fWSc3ff6d0ea77859461172e0811cbf364104_7fd9,fWSc3ff6d0ea77859461172e0811cbf363a5d_7ffb,fWSc3ff6d0ea77859461172e0811cbf364104_7fc3,fWSc3ff6d0ea77859461172e0811cbf363a5d_7fef,fWSc3ff6d0ea77859461172e0811cbf364104_7fd5,fWSc3ff6d0ea77859461172e0811cbf363a5d_7fed,fWSc3ff6d0ea77859461172e0811cbf363af9_7ff6,fWSc3ff6d0ea77859461172e0811cbf363af9_8000,fWSc3ff6d0ea77859461172e0811cbf364104_7fd3,fWSc3ff6d0ea77859461172e0811cbf364104_7fd1,fWSc3ff6d0ea77859461172e0811cbf364104_7fd0,fWSc3ff6d0ea77859461172e0811cbf364104_7ff2,fWSc3ff6d0ea77859461172e0811cbf363b95_7ff6,fWSc3ff6d0ea77859461172e0811cbf363b95_7ffb,fWSA25F4E98_110A_4092_9F3F_A5D6A8B0BCFA,fWS8193FF16_0341_45c4_AF9C_047EB392A0A7,fWSe61e35da8d318518_32a693a2134f111bf34_8000,fWSc3ff6d0ea77859461172e0811cbf364104_7fc8,fWSc3ff6d0ea77859461172e0811cbf363c31_7ff4,fWSc3ff6d0ea77859461172e0811cbf363c31_7ff5,fWSc3ff6d0ea77859461172e0811cbf364104_7fd4,fWSAB4367BA_6D91_4c69_8DBA_E2839394658A,fWSc3ff6d0ea77859461172e0811cbf364104_7fc0,fWSf01dbd23413dda0e_25e72d5d120574d8991_8000,fWSc3ff6d0ea77859461172e0811cbf364104_7fc4,fWSc3ff6d0ea77859461172e0811cbf363c31_7ffa,fWSc3ff6d0ea77859461172e0811cbf363c31_7ff2,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff7,fWSc3ff6d0ea77859461172e0811cbf363cdd_7fce,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff1,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff3,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff5,fWSc3ff6d0ea77859461172e0811cbf364104_7fba,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ffb,fWSc3ff6d0ea77859461172e0811cbf363cdd_7fd2,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ffa,fWSc3ff6d0ea77859461172e0811cbf363cdd_7ff4,fWSc3ff6d0ea77859461172e0811cbf363cdd_7fe2,fWS3AB107E1_16CB_48bb_BA20_C653175A831B,fWSbfbbf049491c37b01e63e3d129fe2500fd_7fff,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffe,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffd,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffc,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffb,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ffa,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff9,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff8,fWSbfbbf049491c37b01e63e3d129fe2500fd_7ff7,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_8000,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7fff,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ffe,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff7,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff6,fWSfd7453be0f56bba4_2a6b48f122a6582c7f_7ff1,fWS6029a80579ffffcd1f6883df134d05bd229_8000,fWSe61e35da8d318518_69b2bf03134d0730d5e_8000,fWSe61e35da8d318518_69b2bf03134d0730d5e_7fff,fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffe,fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffd,fWSe61e35da8d318518_69b2bf03134d0730d5e_7ffc,fWSe61e35da8d31851842debae5134d0ab42ed_8000,fWSe61e35da8d31851842debae5134d0ab42ed_7fff,fWSe61e35da8d31851842debae5134d0ab42ed_7ffd,fWSe61e35da8d318518_1bc1bf7e13586a377e4_8000,fWSe61e35da8d31851842debae5134d0ab42ed_7ffc,fWSe61e35da8d31851842debae5134d0ab42ed_7ffb,fWSe61e35da8d31851842debae5134d0ab42ed_7ffa,fWSe61e35da8d31851842debae5134d0ab42ed_7ff9,fWSe61e35da8d31851842debae5134d0ab42ed_7ff8,fWSe61e35da8d31851842debae5134d0ab42ed_7ff7,fWSe61e35da8d318518_2d7f111b134e73f05d7_8000);

		  for(var ndx=0; ndx < funcArr.length; ndx++) {
			  funcArr[ndx]();
		  }
		  didDbLoad=1;
  